
. capture cmdlog using "/Users/juansolon/Documents/GitHub/sampa-mwanza/jscmd.txt", replace

. 
. * Set up directory global macros
. global github = "~/Documents/GitHub"

. global gshared = "~/Google Drive/Shared drives/"

. global gmydrive = "~/Google Drive/My Drive/"

. global sampamwanza = "$github/sampa-mwanza/"

. global dropboxsampa = "~/Cox working group Dropbox/TB Nutrition working group/SAMPA"

. 
. cd ~
/Users/juansolon

. cd "$dropboxsampa"
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA

. cd "Data monitoring"
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring

. cd Data
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data

. cd Sampa
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data/SAMPA

. 
. use "All_Crf4a_Blood_Sampling_And_Processing.dta"

. 
. merge 1:1 sampa_id using "All_Crf4b_Repeat_Ogtt.dta"
(label sex already defined)
(label cohort already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             1,907  (_merge==3)
    -----------------------------------------

. 
. drop _merge

. 
. merge 1:1 sampa_id using "All_crf1_eligibility_consent.dta", keepusing(rec_diab)
(label sex already defined)
(label cohort already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             1,907  (_merge==3)
    -----------------------------------------

. 
. drop _merge

. 
. 
. cd ~
/Users/juansolon

. cd "$dropboxsampa"
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA

. cd "Data monitoring"
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring

. cd Data
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data

. cd prior_cohort_data
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data/prior_cohort_data

. 
. 
. merge 1:1 orgid using "cohort_flag_malnutrition.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,939
        from master                       355  (_merge==1)
        from using                      3,584  (_merge==2)

    Matched                             1,552  (_merge==3)
    -----------------------------------------

. 
. drop if _merge==2
(3,584 observations deleted)

. 
. cd ~
/Users/juansolon

. cd Downloads
/Users/juansolon/Downloads

. do SAMPA_create_missing_code_label.do"

. /* -----------------------------------------------------------------------------
>         SAMPA_create_missing_code_label.do
>         Created by Dixi on 30 JAN 2023
>         Stata v17 Dixi
>         Last edit 30 JAN 2023
> --------------------------------------------------------------------------------
>         Purpose:
>         --------
>         To create a label for missing code values
>         
>         Called by:
>         ----------
>         * No other do-file 
>         
>         Changelog:
>         ----------
>                 * 
> 
> */
. 
. 
. 
. label define code_miss -97 "Dont know" -98 "Refused" -99 "Not applicable" -100 "Pending" -101 "Forgot/Misplaced" -102 "Absconded/No show respondents" -103 "Equipment or value not available" -104 "Les
> s than Min" -105 "More than max" -106 "Unclear utz/mri images" -107 "Blood sample not enough/extracted" -108 "Results invalid"

. 
. 
. 
. 
. 
. 
. 
end of do-file

. 
. *** Check missing data
. *** Check missing data
. 
. gen missing=.
(1,907 missing values generated)

. replace missing=hba1c if hba1c < 0
(8 real changes made)

. replace missing=-100 if hba1c == .
(82 real changes made)

. 
. ** apply code_miss label
. label values missing code_miss

. table cohort missing

--------------------------------------------
          |              missing            
          |  Less than Min   Pending   Total
----------+---------------------------------
Cohort    |                                 
  DIVIDS  |                       15      15
  SAM     |                        8       8
  CICADA  |                        8       8
  NUSTART |                       19      19
  STATT   |              2        30      32
  CLHNS   |              4         4       8
  Total   |              6        84      90
--------------------------------------------

. 
. 
. 
. ** customize the table
. 
. collect layout (cohort) (missing#result[frequency])

Collection: Table
      Rows: cohort
   Columns: missing#result[frequency]
   Table 1: 8 x 3

--------------------------------------------------
          |                 missing               
          |  Less than Min     Pending       Total
          |      Frequency   Frequency   Frequency
----------+---------------------------------------
Cohort    |                                       
  DIVIDS  |                         15          15
  SAM     |                          8           8
  CICADA  |                          8           8
  NUSTART |                         19          19
  STATT   |              2          30          32
  CLHNS   |              4           4           8
  Total   |              6          84          90
--------------------------------------------------

. 
. ** customize the display numbers
. 
. 
. 
. 
. 
. 
. 
. ** customize the column labels
. 
. collect label dim missing "Reasons for missing data", modify

. collect style header result, level(hide)

. collect preview

--------------------------------------------
          |      Reasons for missing data   
          |  Less than Min   Pending   Total
----------+---------------------------------
Cohort    |                                 
  DIVIDS  |                       15      15
  SAM     |                        8       8
  CICADA  |                        8       8
  NUSTART |                       19      19
  STATT   |              2        30      32
  CLHNS   |              4         4       8
  Total   |              6        84      90
--------------------------------------------

. 
. ** customize the row labels
. 
. 
. 
. collect style row stack, nobinder spacer

. collect preview

--------------------------------------------
          |      Reasons for missing data   
          |  Less than Min   Pending   Total
----------+---------------------------------
Cohort    |                                 
  DIVIDS  |                       15      15
  SAM     |                        8       8
  CICADA  |                        8       8
  NUSTART |                       19      19
  STATT   |              2        30      32
  CLHNS   |              4         4       8
  Total   |              6        84      90
--------------------------------------------

. 
. collect style cell border_block, border(right, pattern(nil))

. collect preview

------------------------------------------
               Reasons for missing data   
           Less than Min   Pending   Total
------------------------------------------
Cohort                                    
  DIVIDS                        15      15
  SAM                            8       8
  CICADA                         8       8
  NUSTART                       19      19
  STATT                2        30      32
  CLHNS                4         4       8
  Total                6        84      90
------------------------------------------

. 
. 
. ** output to an excel file
. putexcel set "Tables.xlsx", sheet(Sheet1, replace) modify

. putexcel A1 = collect
(collection Table posted to putexcel)

. putexcel save

. 
. 
. *** output to a document
. putdocx begin

. putdocx paragraph, style(Title)

. putdocx text ("Understanding Diabetic Status of SAMPA Participants")

. putdocx paragraph, style(Heading1)

. putdocx text ("SAMPA Participants")

. putdocx paragraph

. collect style putdocx, layout(autofitcontents) ///
> title("Table 1: Reasons for missing hba1c")

. putdocx collect
(collection Table posted to putdocx)

. putdocx save "Tables.docx", replace
successfully replaced "/Users/juansolon/Downloads/Tables.docx"

. 
. 
. 
. 
. ** set numeric values to missing value
. mvdecode hba1c, mv(-97/-108)
       hba1c: 8 missing values generated

. 
. * clear collection
. collect clear

. 
. * check collections
. collect dir

Collections in memory
Current: default
-------------------
   Name   No. items
-------------------
default   0        
-------------------

. collect dims

. 
. 
. /*
> * table_mc (note it calculates a statistic by default)
> 
> table1_mc, by(cohort) vars(hba1c conts) statistic
> 
> * Using tables / collect 
> /*
> * Cross tabulate summary summary of continuous variables with two catvars (cohort and high or low hba1c)
> 1. This creates a sequentially named collection  named c#
> 2. Then we use multiple table commands (one per cont var) and places each collected results into a previously named collection (c1,c2)
> 3. The collections are then combined using collect combine into a single collection.
> 4.  All the results are then collected and it is a question lf layout.
> The progression can be seen using 
> collect dir
> */
> 
> collect clear
> collect dir
> collect dims
> 
> collect create c1, replace
> table cohort high_hba1c_1, stat(mean hba1c) stat(median hba1c) stat(freq) stat(min hba1c) stat(iqr hba1c) stat(max hba1c) name(c1)
> collect save c1, replace
> 
> collect create c2, replace
> table cohort high_hba1c_1, stat(mean mmol_glu0) stat(median mmol_glu0) stat(freq) stat(min mmol_glu0) stat(iqr mmol_glu0) stat(max mmol_glu0) name(c2)
> collect save c2, replace
> 
> collect combine c3 = c1 c2
> collect save c3, replace
> /*This generates 2 tables (one for each variable being summarized ) ((colname))
> Cohort and statistic name are in the first column (cohort#result)
> The results are in cells separated by column ((high_hba1c_1))
> */
> collect layout (cohort#result) (high_hba1c_1) (colname)
> collect export tab1.xlsx, replace sheet(1)
> 
> /*This generates 3 tables for each category of ((high_hba1c_1)) plus the total
> Cohort and statistic name are in the first column (cohort#result)
> The results are in cells separated by column ((high_hba1c_1))
> */
>  
> collect layout (cohort#result) (colname) (high_hba1c_1) 
> collect export tab1.xlsx, sheet(2) modify
> 
> /*This generates 3 tables for each category of ((high_hba1c_1)) plus the total
> Cohort is the row in the first column (cohort)
> The results (colname#result) are in columns separted by colnames (hba1c/glucose) 
> */
> 
> collect layout (cohort) (colname#result) (high_hba1c_1)
> collect export tab1.xlsx, sheet(3) modify
> 
> * in all cases, we have no frequency 
> /* This specifies the results to be displayed, in particular N , but this does not work as only mean is shown */
> 
> collect layout (cohort) (colname#result[mean N]) (high_hba1c_1)
> collect export tab1.xlsx, sheet(4) modify
> 
> /* This specifies the results to be displayed, in particular N , but this does not work as only mean is shown */
> 
> collect layout (cohort) (colname#result) (high_hba1c_1) 
> collect export tab1.xlsx, sheet(4) modify
> 
> /* Is frequency retained using c1 and c2 separately?
> */
> collect use c1, replace
> collect layout (cohort) (high_hba1c_1#result) 
> collect export tab1.xlsx, sheet(5) modify 
> collect layout (cohort) (result) (high_hba1c_1)
> collect export tab1.xlsx, sheet(6) modify
> 
> /* Is frequency retained using c1 and c2 separately? yes
> */
> collect use c2, replace
> collect layout (cohort) (high_hba1c_1#result) 
> collect export tab1.xlsx, sheet(7) modify 
> collect layout (cohort) (result) (high_hba1c_1)
> collect export tab1.xlsx, sheet(8) modify
> 
> /* Do we need 3 collections to make a combined table with multiple varlist?
> No,each varlist can be added after the summary statistic
> So, above commands were superfluous!
> 
> */
> */
. 
. * This is the pertinent code for now feb 1
. collect create c4, replace
(current collection is c4)

. table cohort high_hba1c_1, ///
>         stat(mean mmol_glu0 hba1c) ///
>         stat(median mmol_glu0 hba1c) ///
>         stat(freq) stat(min mmol_glu0 hba1c) ///
>         stat(iqr mmol_glu0 hba1c) ///
>         stat(max mmol_glu0 hba1c) ///
>         name(c4)

-------------------------------------------------------------------------------------
                                                    |            hba1c>6.5%          
                                                    |         0          1      Total
----------------------------------------------------+--------------------------------
Cohort                                              |                                
  DIVIDS                                            |                                
    Mean                                            |                                
      Timepoint 0 Glucose in mmol/L                 |  4.695719              4.695719
      Hba1c result [%] from baseline sample In OGTT |  5.260367              5.260367
    Median                                          |                                
      Timepoint 0 Glucose in mmol/L                 |      4.67                  4.67
      Hba1c result [%] from baseline sample In OGTT |       5.3                   5.3
    Frequency                                       |       331                   331
    Minimum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |      3.61                  3.61
      Hba1c result [%] from baseline sample In OGTT |       4.1                   4.1
    Interquartile range                             |                                
      Timepoint 0 Glucose in mmol/L                 |        .5                    .5
      Hba1c result [%] from baseline sample In OGTT |  .4000001              .4000001
    Maximum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |      7.11                  7.11
      Hba1c result [%] from baseline sample In OGTT |       6.2                   6.2
  SAM                                               |                                
    Mean                                            |                                
      Timepoint 0 Glucose in mmol/L                 |  4.934898          6   4.976667
      Hba1c result [%] from baseline sample In OGTT |  5.231915        7.3   5.316327
    Median                                          |                                
      Timepoint 0 Glucose in mmol/L                 |         5          6          5
      Hba1c result [%] from baseline sample In OGTT |       5.2        7.3        5.2
    Frequency                                       |        49          2         51
    Minimum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |       .32       4.33        .32
      Hba1c result [%] from baseline sample In OGTT |         4        6.7          4
    Interquartile range                             |                                
      Timepoint 0 Glucose in mmol/L                 |  .7199998       3.34   .7799997
      Hba1c result [%] from baseline sample In OGTT |  .7999997        1.2   .6999998
    Maximum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |      7.28       7.67       7.67
      Hba1c result [%] from baseline sample In OGTT |       6.4        7.9        7.9
  CICADA                                            |                                
    Mean                                            |                                
      Timepoint 0 Glucose in mmol/L                 |  5.848101   6.658286   6.037397
      Hba1c result [%] from baseline sample In OGTT |  5.538676   7.188571   5.924166
    Median                                          |                                
      Timepoint 0 Glucose in mmol/L                 |       5.9        6.4          6
      Hba1c result [%] from baseline sample In OGTT |       5.6          7        5.8
    Frequency                                       |       579        175        754
    Minimum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |       .31        4.4        .31
      Hba1c result [%] from baseline sample In OGTT |         4        6.5          4
    Interquartile range                             |                                
      Timepoint 0 Glucose in mmol/L                 |  .9000001          1   .9000001
      Hba1c result [%] from baseline sample In OGTT |  .7000003   .8000002        1.1
    Maximum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |       9.4       24.7       24.7
      Hba1c result [%] from baseline sample In OGTT |       6.4       10.9       10.9
  NUSTART                                           |                                
    Mean                                            |                                
      Timepoint 0 Glucose in mmol/L                 |  5.030102   5.719565   5.102182
      Hba1c result [%] from baseline sample In OGTT |  5.257868    8.03913   5.548636
    Median                                          |                                
      Timepoint 0 Glucose in mmol/L                 |         5       5.28          5
      Hba1c result [%] from baseline sample In OGTT |       5.3        7.2        5.4
    Frequency                                       |       197         23        220
    Minimum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |       3.5       3.44       3.44
      Hba1c result [%] from baseline sample In OGTT |         4        6.5          4
    Interquartile range                             |                                
      Timepoint 0 Glucose in mmol/L                 |  .8800001   .9500003   .8899999
      Hba1c result [%] from baseline sample In OGTT |  .6999998        2.1   .8000002
    Maximum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |      7.72      11.28      11.28
      Hba1c result [%] from baseline sample In OGTT |       6.4         14         14
  STATT                                             |                                
    Mean                                            |                                
      Timepoint 0 Glucose in mmol/L                 |  5.803349   13.37886       6.89
      Hba1c result [%] from baseline sample In OGTT |  4.856439   8.951429   5.453625
    Median                                          |                                
      Timepoint 0 Glucose in mmol/L                 |      6.17      13.22       6.33
      Hba1c result [%] from baseline sample In OGTT |       4.8        8.8        4.9
    Frequency                                       |       220         35        255
    Minimum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |      -104       6.39       -104
      Hba1c result [%] from baseline sample In OGTT |       3.7        6.5        3.7
    Interquartile range                             |                                
      Timepoint 0 Glucose in mmol/L                 |         1          6      1.365
      Hba1c result [%] from baseline sample In OGTT |  .5999999        2.3        .95
    Maximum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |     12.86      24.51      24.51
      Hba1c result [%] from baseline sample In OGTT |       6.4       12.8       12.8
  CLHNS                                             |                                
    Mean                                            |                                
      Timepoint 0 Glucose in mmol/L                 |   6.00803   7.591579   6.263008
      Hba1c result [%] from baseline sample In OGTT |  5.486959   7.671053   5.844698
    Median                                          |                                
      Timepoint 0 Glucose in mmol/L                 |      5.94      6.335       5.94
      Hba1c result [%] from baseline sample In OGTT |       5.7        7.2       5.75
    Frequency                                       |       199         38        237
    Minimum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |       .81       5.17        .81
      Hba1c result [%] from baseline sample In OGTT |      3.74        6.5       3.74
    Interquartile range                             |                                
      Timepoint 0 Glucose in mmol/L                 |       .77       1.55   .8049998
      Hba1c result [%] from baseline sample In OGTT |  .7000003        1.1   .7999997
    Maximum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |     13.78      17.28      17.28
      Hba1c result [%] from baseline sample In OGTT |       6.4       12.7       12.7
  Total                                             |                                
    Mean                                            |                                
      Timepoint 0 Glucose in mmol/L                 |  5.487477   7.565897   5.798046
      Hba1c result [%] from baseline sample In OGTT |  5.337487   7.554212   5.670545
    Median                                          |                                
      Timepoint 0 Glucose in mmol/L                 |      5.56        6.4       5.67
      Hba1c result [%] from baseline sample In OGTT |       5.4        7.1        5.5
    Frequency                                       |     1,575        273      1,848
    Minimum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |      -104       3.44       -104
      Hba1c result [%] from baseline sample In OGTT |       3.7        6.5        3.7
    Interquartile range                             |                                
      Timepoint 0 Glucose in mmol/L                 |      1.26        1.7       1.34
      Hba1c result [%] from baseline sample In OGTT |  .6999998        1.2   .9000001
    Maximum value                                   |                                
      Timepoint 0 Glucose in mmol/L                 |     13.78       24.7       24.7
      Hba1c result [%] from baseline sample In OGTT |       6.4         14         14
-------------------------------------------------------------------------------------

. collect save c4, replace
(collection c4 saved to file c4.stjson)

. 
. collect layout (cohort) (colname#result) (high_hba1c_1)

Collection: c4
      Rows: cohort
   Columns: colname#result
    Tables: high_hba1c_1
   Table 1: 8 x 10
   Table 2: 7 x 10
   Table 3: 8 x 10

hba1c>6.5% = 0
--------------------------------------------------------------------------------------------------------------------------------------------------------------
          |                       Timepoint 0 Glucose in mmol/L                                     Hba1c result [%] from baseline sample In OGTT             
          |      Mean   Median   Minimum value   Interquartile range   Maximum value       Mean   Median   Minimum value   Interquartile range   Maximum value
----------+---------------------------------------------------------------------------------------------------------------------------------------------------
Cohort    |                                                                                                                                                   
  DIVIDS  |  4.695719     4.67            3.61                    .5            7.11   5.260367      5.3             4.1              .4000001             6.2
  SAM     |  4.934898        5             .32              .7199998            7.28   5.231915      5.2               4              .7999997             6.4
  CICADA  |  5.848101      5.9             .31              .9000001             9.4   5.538676      5.6               4              .7000003             6.4
  NUSTART |  5.030102        5             3.5              .8800001            7.72   5.257868      5.3               4              .6999998             6.4
  STATT   |  5.803349     6.17            -104                     1           12.86   4.856439      4.8             3.7              .5999999             6.4
  CLHNS   |   6.00803     5.94             .81                   .77           13.78   5.486959      5.7            3.74              .7000003             6.4
  Total   |  5.487477     5.56            -104                  1.26           13.78   5.337487      5.4             3.7              .6999998             6.4
--------------------------------------------------------------------------------------------------------------------------------------------------------------

hba1c>6.5% = 1
--------------------------------------------------------------------------------------------------------------------------------------------------------------
          |                       Timepoint 0 Glucose in mmol/L                                     Hba1c result [%] from baseline sample In OGTT             
          |      Mean   Median   Minimum value   Interquartile range   Maximum value       Mean   Median   Minimum value   Interquartile range   Maximum value
----------+---------------------------------------------------------------------------------------------------------------------------------------------------
Cohort    |                                                                                                                                                   
  SAM     |         6        6            4.33                  3.34            7.67        7.3      7.3             6.7                   1.2             7.9
  CICADA  |  6.658286      6.4             4.4                     1            24.7   7.188571        7             6.5              .8000002            10.9
  NUSTART |  5.719565     5.28            3.44              .9500003           11.28    8.03913      7.2             6.5                   2.1              14
  STATT   |  13.37886    13.22            6.39                     6           24.51   8.951429      8.8             6.5                   2.3            12.8
  CLHNS   |  7.591579    6.335            5.17                  1.55           17.28   7.671053      7.2             6.5                   1.1            12.7
  Total   |  7.565897      6.4            3.44                   1.7            24.7   7.554212      7.1             6.5                   1.2              14
--------------------------------------------------------------------------------------------------------------------------------------------------------------

hba1c>6.5% = Total
--------------------------------------------------------------------------------------------------------------------------------------------------------------
          |                       Timepoint 0 Glucose in mmol/L                                     Hba1c result [%] from baseline sample In OGTT             
          |      Mean   Median   Minimum value   Interquartile range   Maximum value       Mean   Median   Minimum value   Interquartile range   Maximum value
----------+---------------------------------------------------------------------------------------------------------------------------------------------------
Cohort    |                                                                                                                                                   
  DIVIDS  |  4.695719     4.67            3.61                    .5            7.11   5.260367      5.3             4.1              .4000001             6.2
  SAM     |  4.976667        5             .32              .7799997            7.67   5.316327      5.2               4              .6999998             7.9
  CICADA  |  6.037397        6             .31              .9000001            24.7   5.924166      5.8               4                   1.1            10.9
  NUSTART |  5.102182        5            3.44              .8899999           11.28   5.548636      5.4               4              .8000002              14
  STATT   |      6.89     6.33            -104                 1.365           24.51   5.453625      4.9             3.7                   .95            12.8
  CLHNS   |  6.263008     5.94             .81              .8049998           17.28   5.844698     5.75            3.74              .7999997            12.7
  Total   |  5.798046     5.67            -104                  1.34            24.7   5.670545      5.5             3.7              .9000001              14
--------------------------------------------------------------------------------------------------------------------------------------------------------------

. collect export tab1.xlsx, sheet(9) modify
(collection c4 exported to file tab1.xlsx)

. 
. * We can use macros to contain varlists
. collect create c5, replace /* create a collection */
(current collection is c5)

. local var "hba1c mmol_glu0" /* create a macro storing varlist for analysis */

. 
. table cohort high_hba1c_1, /// /* this is a table command for continuous vars */
>         stat(mean `var') ///
>         stat(sd `var') ///
>         stat(median `var') ///
>         stat(min `var') ///
>         stat(iqr `var') ///
>         stat(max `var') ///
>         stat(freq)  ///.  /* frequency is here  */
>         name(c5)

-------------------------------------------------------------------------------------
                                                    |            hba1c>6.5%          
                                                    |         0          1      Total
----------------------------------------------------+--------------------------------
Cohort                                              |                                
  DIVIDS                                            |                                
    Mean                                            |                                
      Hba1c result [%] from baseline sample In OGTT |  5.260367              5.260367
      Timepoint 0 Glucose in mmol/L                 |  4.695719              4.695719
    Standard deviation                              |                                
      Hba1c result [%] from baseline sample In OGTT |  .3200266              .3200266
      Timepoint 0 Glucose in mmol/L                 |  .4091192              .4091192
    Median                                          |                                
      Hba1c result [%] from baseline sample In OGTT |       5.3                   5.3
      Timepoint 0 Glucose in mmol/L                 |      4.67                  4.67
    Minimum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |       4.1                   4.1
      Timepoint 0 Glucose in mmol/L                 |      3.61                  3.61
    Interquartile range                             |                                
      Hba1c result [%] from baseline sample In OGTT |  .4000001              .4000001
      Timepoint 0 Glucose in mmol/L                 |        .5                    .5
    Maximum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |       6.2                   6.2
      Timepoint 0 Glucose in mmol/L                 |      7.11                  7.11
    Frequency                                       |       331                   331
  SAM                                               |                                
    Mean                                            |                                
      Hba1c result [%] from baseline sample In OGTT |  5.231915        7.3   5.316327
      Timepoint 0 Glucose in mmol/L                 |  4.934898          6   4.976667
    Standard deviation                              |                                
      Hba1c result [%] from baseline sample In OGTT |  .4996113   .8485283   .6520311
      Timepoint 0 Glucose in mmol/L                 |  .9507807   2.361737   1.011424
    Median                                          |                                
      Hba1c result [%] from baseline sample In OGTT |       5.2        7.3        5.2
      Timepoint 0 Glucose in mmol/L                 |         5          6          5
    Minimum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |         4        6.7          4
      Timepoint 0 Glucose in mmol/L                 |       .32       4.33        .32
    Interquartile range                             |                                
      Hba1c result [%] from baseline sample In OGTT |  .7999997        1.2   .6999998
      Timepoint 0 Glucose in mmol/L                 |  .7199998       3.34   .7799997
    Maximum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |       6.4        7.9        7.9
      Timepoint 0 Glucose in mmol/L                 |      7.28       7.67       7.67
    Frequency                                       |        49          2         51
  CICADA                                            |                                
    Mean                                            |                                
      Hba1c result [%] from baseline sample In OGTT |  5.538676   7.188571   5.924166
      Timepoint 0 Glucose in mmol/L                 |  5.848101   6.658286   6.037397
    Standard deviation                              |                                
      Hba1c result [%] from baseline sample In OGTT |  .5058496    .821049   .9170056
      Timepoint 0 Glucose in mmol/L                 |  .7712346   1.786291    1.14699
    Median                                          |                                
      Hba1c result [%] from baseline sample In OGTT |       5.6          7        5.8
      Timepoint 0 Glucose in mmol/L                 |       5.9        6.4          6
    Minimum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |         4        6.5          4
      Timepoint 0 Glucose in mmol/L                 |       .31        4.4        .31
    Interquartile range                             |                                
      Hba1c result [%] from baseline sample In OGTT |  .7000003   .8000002        1.1
      Timepoint 0 Glucose in mmol/L                 |  .9000001          1   .9000001
    Maximum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |       6.4       10.9       10.9
      Timepoint 0 Glucose in mmol/L                 |       9.4       24.7       24.7
    Frequency                                       |       579        175        754
  NUSTART                                           |                                
    Mean                                            |                                
      Hba1c result [%] from baseline sample In OGTT |  5.257868    8.03913   5.548636
      Timepoint 0 Glucose in mmol/L                 |  5.030102   5.719565   5.102182
    Standard deviation                              |                                
      Hba1c result [%] from baseline sample In OGTT |  .5224564   2.068978   1.183967
      Timepoint 0 Glucose in mmol/L                 |  .7009054   1.920484   .9246017
    Median                                          |                                
      Hba1c result [%] from baseline sample In OGTT |       5.3        7.2        5.4
      Timepoint 0 Glucose in mmol/L                 |         5       5.28          5
    Minimum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |         4        6.5          4
      Timepoint 0 Glucose in mmol/L                 |       3.5       3.44       3.44
    Interquartile range                             |                                
      Hba1c result [%] from baseline sample In OGTT |  .6999998        2.1   .8000002
      Timepoint 0 Glucose in mmol/L                 |  .8800001   .9500003   .8899999
    Maximum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |       6.4         14         14
      Timepoint 0 Glucose in mmol/L                 |      7.72      11.28      11.28
    Frequency                                       |       197         23        220
  STATT                                             |                                
    Mean                                            |                                
      Hba1c result [%] from baseline sample In OGTT |  4.856439   8.951429   5.453625
      Timepoint 0 Glucose in mmol/L                 |  5.803349   13.37886       6.89
    Standard deviation                              |                                
      Hba1c result [%] from baseline sample In OGTT |  .5062836   1.555894    1.63118
      Timepoint 0 Glucose in mmol/L                 |  7.698936   4.211023   7.765148
    Median                                          |                                
      Hba1c result [%] from baseline sample In OGTT |       4.8        8.8        4.9
      Timepoint 0 Glucose in mmol/L                 |      6.17      13.22       6.33
    Minimum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |       3.7        6.5        3.7
      Timepoint 0 Glucose in mmol/L                 |      -104       6.39       -104
    Interquartile range                             |                                
      Hba1c result [%] from baseline sample In OGTT |  .5999999        2.3        .95
      Timepoint 0 Glucose in mmol/L                 |         1          6      1.365
    Maximum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |       6.4       12.8       12.8
      Timepoint 0 Glucose in mmol/L                 |     12.86      24.51      24.51
    Frequency                                       |       220         35        255
  CLHNS                                             |                                
    Mean                                            |                                
      Hba1c result [%] from baseline sample In OGTT |  5.486959   7.671053   5.844698
      Timepoint 0 Glucose in mmol/L                 |   6.00803   7.591579   6.263008
    Standard deviation                              |                                
      Hba1c result [%] from baseline sample In OGTT |  .5863857   1.403645   1.122073
      Timepoint 0 Glucose in mmol/L                 |  1.023778   3.237224   1.693759
    Median                                          |                                
      Hba1c result [%] from baseline sample In OGTT |       5.7        7.2       5.75
      Timepoint 0 Glucose in mmol/L                 |      5.94      6.335       5.94
    Minimum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |      3.74        6.5       3.74
      Timepoint 0 Glucose in mmol/L                 |       .81       5.17        .81
    Interquartile range                             |                                
      Hba1c result [%] from baseline sample In OGTT |  .7000003        1.1   .7999997
      Timepoint 0 Glucose in mmol/L                 |       .77       1.55   .8049998
    Maximum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |       6.4       12.7       12.7
      Timepoint 0 Glucose in mmol/L                 |     13.78      17.28      17.28
    Frequency                                       |       199         38        237
  Total                                             |                                
    Mean                                            |                                
      Hba1c result [%] from baseline sample In OGTT |  5.337487   7.554212   5.670545
      Timepoint 0 Glucose in mmol/L                 |  5.487477   7.565897   5.798046
    Standard deviation                              |                                
      Hba1c result [%] from baseline sample In OGTT |  .5354379   1.307751   1.061822
      Timepoint 0 Glucose in mmol/L                 |  2.946264   3.344631   3.098123
    Median                                          |                                
      Hba1c result [%] from baseline sample In OGTT |       5.4        7.1        5.5
      Timepoint 0 Glucose in mmol/L                 |      5.56        6.4       5.67
    Minimum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |       3.7        6.5        3.7
      Timepoint 0 Glucose in mmol/L                 |      -104       3.44       -104
    Interquartile range                             |                                
      Hba1c result [%] from baseline sample In OGTT |  .6999998        1.2   .9000001
      Timepoint 0 Glucose in mmol/L                 |      1.26        1.7       1.34
    Maximum value                                   |                                
      Hba1c result [%] from baseline sample In OGTT |       6.4         14         14
      Timepoint 0 Glucose in mmol/L                 |     13.78       24.7       24.7
    Frequency                                       |     1,575        273      1,848
-------------------------------------------------------------------------------------

. 
. collect save c5, replace /*this saves the collection on your pwd */
(collection c5 saved to file c5.stjson)

. 
. collect layout (cohort) (colname#result) (high_hba1c_1) /* this is the table layout*/

Collection: c5
      Rows: cohort
   Columns: colname#result
    Tables: high_hba1c_1
   Table 1: 8 x 12
   Table 2: 7 x 12
   Table 3: 8 x 12

hba1c>6.5% = 0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
          |                          Hba1c result [%] from baseline sample In OGTT                                                          Timepoint 0 Glucose in mmol/L                               
          |      Mean   Standard deviation   Median   Minimum value   Interquartile range   Maximum value       Mean   Standard deviation   Median   Minimum value   Interquartile range   Maximum value
----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Cohort    |                                                                                                                                                                                             
  DIVIDS  |  5.260367             .3200266      5.3             4.1              .4000001             6.2   4.695719             .4091192     4.67            3.61                    .5            7.11
  SAM     |  5.231915             .4996113      5.2               4              .7999997             6.4   4.934898             .9507807        5             .32              .7199998            7.28
  CICADA  |  5.538676             .5058496      5.6               4              .7000003             6.4   5.848101             .7712346      5.9             .31              .9000001             9.4
  NUSTART |  5.257868             .5224564      5.3               4              .6999998             6.4   5.030102             .7009054        5             3.5              .8800001            7.72
  STATT   |  4.856439             .5062836      4.8             3.7              .5999999             6.4   5.803349             7.698936     6.17            -104                     1           12.86
  CLHNS   |  5.486959             .5863857      5.7            3.74              .7000003             6.4    6.00803             1.023778     5.94             .81                   .77           13.78
  Total   |  5.337487             .5354379      5.4             3.7              .6999998             6.4   5.487477             2.946264     5.56            -104                  1.26           13.78
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

hba1c>6.5% = 1
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
          |                          Hba1c result [%] from baseline sample In OGTT                                                          Timepoint 0 Glucose in mmol/L                               
          |      Mean   Standard deviation   Median   Minimum value   Interquartile range   Maximum value       Mean   Standard deviation   Median   Minimum value   Interquartile range   Maximum value
----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Cohort    |                                                                                                                                                                                             
  SAM     |       7.3             .8485283      7.3             6.7                   1.2             7.9          6             2.361737        6            4.33                  3.34            7.67
  CICADA  |  7.188571              .821049        7             6.5              .8000002            10.9   6.658286             1.786291      6.4             4.4                     1            24.7
  NUSTART |   8.03913             2.068978      7.2             6.5                   2.1              14   5.719565             1.920484     5.28            3.44              .9500003           11.28
  STATT   |  8.951429             1.555894      8.8             6.5                   2.3            12.8   13.37886             4.211023    13.22            6.39                     6           24.51
  CLHNS   |  7.671053             1.403645      7.2             6.5                   1.1            12.7   7.591579             3.237224    6.335            5.17                  1.55           17.28
  Total   |  7.554212             1.307751      7.1             6.5                   1.2              14   7.565897             3.344631      6.4            3.44                   1.7            24.7
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

hba1c>6.5% = Total
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
          |                          Hba1c result [%] from baseline sample In OGTT                                                          Timepoint 0 Glucose in mmol/L                               
          |      Mean   Standard deviation   Median   Minimum value   Interquartile range   Maximum value       Mean   Standard deviation   Median   Minimum value   Interquartile range   Maximum value
----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Cohort    |                                                                                                                                                                                             
  DIVIDS  |  5.260367             .3200266      5.3             4.1              .4000001             6.2   4.695719             .4091192     4.67            3.61                    .5            7.11
  SAM     |  5.316327             .6520311      5.2               4              .6999998             7.9   4.976667             1.011424        5             .32              .7799997            7.67
  CICADA  |  5.924166             .9170056      5.8               4                   1.1            10.9   6.037397              1.14699        6             .31              .9000001            24.7
  NUSTART |  5.548636             1.183967      5.4               4              .8000002              14   5.102182             .9246017        5            3.44              .8899999           11.28
  STATT   |  5.453625              1.63118      4.9             3.7                   .95            12.8       6.89             7.765148     6.33            -104                 1.365           24.51
  CLHNS   |  5.844698             1.122073     5.75            3.74              .7999997            12.7   6.263008             1.693759     5.94             .81              .8049998           17.28
  Total   |  5.670545             1.061822      5.5             3.7              .9000001              14   5.798046             3.098123     5.67            -104                  1.34            24.7
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. collect export tab1.xlsx, sheet(10) modify /* this exports to excel */
(collection c5 exported to file tab1.xlsx)

. 
. /* Confidence intervals of continuous var means
> These can be calculated using ci means ; see p 95 tables.pdf
> */
. collect create c6, replace /* create a collection */
(current collection is c6)

. 
. foreach x of varlist hba1c mmol_glu0 {
  2. ttest `x', by(high_hba1c_1)
  3. collect get mymean=r(mu_1) mysd=r(sd_1), tags(var[`x'] high_hba1c_1[1]) 
  4. collect get mymean=r(mu_2) mysd=r(sd_2), tags(var[`x'] high_hba1c_1[2])
  5.  forvalues i = 1/2 {
  6.         ci means `x' if high_hba1c_1==`i'
  7.         collect get r(lb) r(ub), tags(var[`x'] high_hba1c_1[`i'])
  8.      summarize `x' if high_hba1c_1==`i', detail
  9.         collect get r(p50), tags(var[`x'] high_hba1c_1[`i'])
 10. } 
 11. }

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |   1,544    5.337487    .0136265    .5354379    5.310759    5.364216
       1 |     273    7.554212    .0791487    1.307751    7.398391    7.710034
---------+--------------------------------------------------------------------
Combined |   1,817    5.670545      .02491    1.061822     5.62169      5.7194
---------+--------------------------------------------------------------------
    diff |           -2.216725    .0464268               -2.307781    -2.12567
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t = -47.7467
H0: diff = 0                                     Degrees of freedom =     1815

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

    Variable |        Obs        Mean    Std. err.       [95% conf. interval]
-------------+---------------------------------------------------------------
       hba1c |        273    7.554212    .0791487        7.398391    7.710034

        Hba1c result [%] from baseline sample In OGTT
-------------------------------------------------------------
      Percentiles      Smallest
 1%          6.5            6.5
 5%          6.5            6.5
10%          6.5            6.5       Obs                 273
25%          6.7            6.5       Sum of wgt.         273

50%          7.1                      Mean           7.554212
                        Largest       Std. dev.      1.307751
75%          7.9           12.3
90%          9.4           12.7       Variance       1.710212
95%         10.3           12.8       Skewness       2.058922
99%         12.7             14       Kurtosis       7.528651

    Variable |        Obs        Mean    Std. err.       [95% conf. interval]
-------------+---------------------------------------------------------------
       hba1c |          0           .           .               .           .

        Hba1c result [%] from baseline sample In OGTT
-------------------------------------------------------------
no observations
(result r(p50) not found)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |   1,554    5.487477    .0747388    2.946264    5.340878    5.634077
       1 |     273    7.565897    .2024263    3.344631    7.167376    7.964419
---------+--------------------------------------------------------------------
Combined |   1,827    5.798046    .0724819    3.098123     5.65589    5.940202
---------+--------------------------------------------------------------------
    diff |            -2.07842    .1974614               -2.465694   -1.691146
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t = -10.5257
H0: diff = 0                                     Degrees of freedom =     1825

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

    Variable |        Obs        Mean    Std. err.       [95% conf. interval]
-------------+---------------------------------------------------------------
   mmol_glu0 |        273    7.565897    .2024263        7.167376    7.964419

                Timepoint 0 Glucose in mmol/L
-------------------------------------------------------------
      Percentiles      Smallest
 1%         4.06           3.44
 5%         4.94           3.83
10%          5.4           4.06       Obs                 273
25%          5.8           4.33       Sum of wgt.         273

50%          6.4                      Mean           7.565897
                        Largest       Std. dev.      3.344631
75%          7.5          21.33
90%        12.33          22.44       Variance       11.18656
95%        14.98          24.51       Skewness       2.539995
99%        22.44           24.7       Kurtosis       10.27378

    Variable |        Obs        Mean    Std. err.       [95% conf. interval]
-------------+---------------------------------------------------------------
   mmol_glu0 |          0           .           .               .           .

                Timepoint 0 Glucose in mmol/L
-------------------------------------------------------------
no observations
(result r(p50) not found)

. 
. collect composite define meanci = lb ub, delimiter(-) trim /* creates a composite ci from lb and ub*/

. 
. collect style cell result, nformat(%6.2f) halign(center) /* formats to 2 decimal places and centers */

. collect style cell result[meanci], sformat("[%s]") /* places ci in brackets */

. 
. /* creates mean sd, delimited and formatted  */
. collect composite define meansd = mymean mysd, delimiter() trim 

. collect style cell result[p50], sformat("(%s)")

. 
. /* creates mean, sd median */
. 
. collect composite define msdmed = meansd p50

. 
. /* hides labels */
. 
. collect style header result, level(hide)

. 
. /* table layout */
. collect layout (var#result[msdmed meanci]) (high_hba1c_1) 

Collection: c6
      Rows: var#result[msdmed meanci]
   Columns: high_hba1c_1
   Table 1: 4 x 2

--------------------------------------------------------------------------
                                              |                1         2
----------------------------------------------+---------------------------
Hba1c result [%] from baseline sample In OGTT | 5.340.54 (7.10) 7.551.31
                                              |    [7.40-7.71]     [.-.]  
Timepoint 0 Glucose in mmol/L                 | 5.492.95 (6.40) 7.573.34
                                              |    [7.17-7.96]     [.-.]  
--------------------------------------------------------------------------

. 
. collect export tab1.xlsx, sheet(11) modify /* this exports to excel */
(collection c6 exported to file tab1.xlsx)

. 
. /*. Note this shoudl show mean (ci) and median [iqr]

end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD51240.000000"

. collect style cell cell_type[column-header], halign(center)

. collect title "Mean, SD, Median CI,"

. collect preview

Mean, SD, Median CI,
--------------------------------------------------------------------------
                                              |         1            2    
----------------------------------------------+---------------------------
Hba1c result [%] from baseline sample In OGTT | 5.340.54 (7.10) 7.551.31
                                              |    [7.40-7.71]     [.-.]  
Timepoint 0 Glucose in mmol/L                 | 5.492.95 (6.40) 7.573.34
                                              |    [7.17-7.96]     [.-.]  
--------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD51240.000000"

. collect title "MeanSD, (Median) [CI],"

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD51240.000000"

. collect title "MeanSD, (Median) [CI] by Hba1c status"

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD51240.000000"

. collect preview

MeanSD, (Median) [CI] by Hba1c status
--------------------------------------------------------------------------
                                              |         1            2    
----------------------------------------------+---------------------------
Hba1c result [%] from baseline sample In OGTT | 5.340.54 (7.10) 7.551.31
                                              |    [7.40-7.71]     [.-.]  
Timepoint 0 Glucose in mmol/L                 | 5.492.95 (6.40) 7.573.34
                                              |    [7.17-7.96]     [.-.]  
--------------------------------------------------------------------------

. 
end of do-file

. search ssc

. help decode

. help label

. help egenmore

. help decode

. help levelsof

. help do

. help log

. help missings

. help replace

. lookfor
nothing to look for
r(198);

. help lookfor

. d

Contains data from All_Crf4a_Blood_Sampling_And_Processing.dta
 Observations:         1,907                  
    Variables:           205                  27 Jan 2023 16:04
                                              (_dta has notes)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
record_id       str6    %9s                   
redcap_data_a~p str10   %10s                  
cohort          byte    %8.0g      cohort     Cohort
sampa_id        long    %12.0g                SAMPA ID
orgid           str18   %18s                  Cohort ID
sex             byte    %8.0g      sex        Sex
dob             str10   %10s                  Date of Birth
age             byte    %8.0g                 Age
agree           byte    %8.0g                 
personnel4      str7    %9s                   REDCap ID of Data Entry Personnel
timestamp4      str19   %19s                  Date of Data Entry
clinic_date_o~t str10   %10s                  Date of First OGTT Test
sample_gp       byte    %81.0g     sample_gp
                                              Which group does the person belong to?
standard_ogtt   byte    %16.0g     standard_ogtt
                                              For adult participants agreeing to do Standard OGTT but are not in the indepth s
fasting         byte    %31.0g     fasting    What has the participant eaten or drunk in the last 8 hours OR since dinner last
ogtt_unit       byte    %8.0g      ogtt_unit
                                              Unit of measurement
ogtt_time0      str8    %9s                   Time 0 minutes
time0_w         str20   %20s                  Sample ID of Time 0: Onsite Serum
time0_x         str20   %20s                  Sample ID of Time 0: Aliquot X (Serum)
time0_y         str20   %20s                  Sample ID of Time 0: Aliquot Y (Serum)
time0_z         byte    %8.0g                 Sample ID of Time 0: Aliquot Z (Serum)
time0_a         str20   %20s                  Sample ID of Time 0: Aliquot A (EDTA)
time0_b         str20   %20s                  Sample ID of Time 0: Aliquot B (EDTA)
time0_c         str20   %20s                  Sample ID of Time 0: Aliquot C (EDTA)
time0_e         str20   %20s                  Sample ID of Time 0: Aliquot E (Cooled EDTA)
time0_f         str20   %20s                  Sample ID of Time 0: Aliquot F (Cooled EDTA)
time0_g         str20   %20s                  Sample ID of Time 0: Aliquot G (Cooled EDTA)
time0_h         str20   %20s                  Sample ID of Time 0: Aliquot H (Aprotinin)
time0_j         str20   %20s                  Sample ID of Time 0: Aliquot J (Aprotinin)
time0_k         str20   %20s                  Sample ID of Time 0: Aliquot K (Aprotinin)
ogtt_sample_s~m byte    %8.0g      ogtt_sample_serum
                                              Fasting serum
ogtt_sample_~a0 byte    %8.0g      ogtt_sample_edta0
                                              Fasting EDTA
ogtt_sample_~o0 byte    %8.0g      ogtt_sample_apro0
                                              Fasting aprotinin
ogtt_sa~a0_cold byte    %8.0g      ogtt_sample_edta0_cold
                                              Fasting cooled EDTA
ogtt_comment~e0 strL    %9s                   Explain any missing samples or problems in sample collection
hba1c           float   %9.0g                 Hba1c result [%] from baseline sample In OGTT
glu0            float   %9.0g                 OGTT result_Time0
mmol_glu0       float   %9.0g                 Timepoint 0 Glucose in mmol/L
out_glu0        byte    %8.0g                 glucose 0 minutes > 24.6
glu0_missing    byte    %24.0g     glu0_missing
                                              Any problems with OGTT Results?
glu0_mis_spec~y str10   %10s                  Others, specify
cpeptide0       float   %9.0g                 C_Peptide_Time0
cpeptide0_pmol  float   %9.0g                 Timepoint 0 C-peptide in pmol/L unit
insulin0        float   %9.0g                 Insulin_Time0
insulin0_pmol   float   %9.0g                 Timepoint 0 Insulin in pmol/L unit
ogtt_time15     str5    %9s                   Time 15 minutes
time15_z        byte    %8.0g                 Sample ID of Time 15: Onsite EDTA
time15_a        str20   %20s                  Sample ID of Time 15: Aliquot A (EDTA)
time15_b        str20   %20s                  Sample ID of Time 15: Aliquot B (EDTA)
time15_c        str21   %21s                  Sample ID of Time 15: Aliquot C (EDTA)
ogtt_sample_~15 byte    %8.0g      ogtt_sample_edta15
                                              15 min EDTA
ogtt_comment~15 strL    %9s                   Explain any missing samples or problems in sample collection
glu15           float   %9.0g                 OGTT result_Time15
mmol_glu15      float   %9.0g                 Timepoint 15 Glucose in mmol/L
out_glu15       byte    %8.0g                 glucose 15 minutes > 24.6
glu15_missing   byte    %24.0g     glu15_missing
                                              Any problems with OGTT Results?
glu15_mis_spe~y strL    %9s                   Others, specify
cpeptide15      byte    %8.0g                 C_Peptide_Time15
insulin15       float   %9.0g                 Insulin_Time15
ogtt_time30     str5    %9s                   Time 30 minutes
time30_z        byte    %8.0g                 Sample ID of Time 30: Onsite EDTA
time30_a        str20   %20s                  Sample ID of Time 30: Aliquot A (EDTA)
time30_b        str20   %20s                  Sample ID of Time 30: Aliquot B (EDTA)
time30_c        str38   %38s                  Sample ID of Time 30: Aliquot C (EDTA)
time30_e        str20   %20s                  Sample ID of Time 30: Aliquot E (Cooled EDTA)
time30_f        str20   %20s                  Sample ID of Time 30: Aliquot F (Cooled EDTA)
time30_g        str20   %20s                  Sample ID of Time 30: Aliquot G (Cooled EDTA)
time30_h        str20   %20s                  Sample ID of Time 30: Aliquot H (Aprotinin)
time30_j        str20   %20s                  Sample ID of Time 30: Aliquot J (Aprotinin)
time30_k        str20   %20s                  Sample ID of Time 30: Aliquot K (Aprotinin)
ogtt_sample~a30 byte    %8.0g      ogtt_sample_edta30
                                              30 min EDTA
ogtt_sample~o30 byte    %8.0g      ogtt_sample_apro30
                                              30 min aprotinin
ogtt_sa~30_cold byte    %8.0g      ogtt_sample_edta30_cold
                                              30 min cooled EDTA
ogtt_comment~30 strL    %9s                   Explain any missing samples or problems in sample collection
glu30           float   %9.0g                 OGTT result_Time30
mmol_glu30      float   %9.0g                 Timepoint 30 Glucose in mmol/L
out_glu30       byte    %8.0g                 glucose 30 minutes > 24.6
glu30_missing   byte    %24.0g     glu30_missing
                                              Any problems with OGTT Results?
glu30_mis_spe~y strL    %9s                   Others, specify
cpeptide30      byte    %8.0g                 C_Peptide_Time30
insulin30       byte    %8.0g                 Insulin_Time30
ogtt_time45     str5    %9s                   Time 45 minutes
time45_z        byte    %8.0g                 Sample ID of Time 45: Onsite EDTA
time45_a        str20   %20s                  Sample ID of Time 45: Aliquot A (EDTA)
time45_b        str20   %20s                  Sample ID of Time 45: Aliquot B (EDTA)
time45_c        str38   %38s                  Sample ID of Time 45: Aliquot C (EDTA)
ogtt_sample_~45 byte    %8.0g      ogtt_sample_edta45
                                              45 min EDTA
ogtt_comment~45 strL    %9s                   Explain any missing samples or problems in sample collection
glu45           float   %9.0g                 OGTT result_Time45
mmol_glu45      float   %9.0g                 Timepoint 45 Glucose in mmol/L
out_glu45       byte    %8.0g                 glucose 45 minutes > 24.6
glu45_missing   byte    %24.0g     glu45_missing
                                              Any problems with OGTT Results?
glu45_mis_spe~y strL    %9s                   Others, specify
cpeptide45      byte    %8.0g                 C_Peptide_Time45
insulin45       byte    %8.0g                 Insulin_Time45
ogtt_time60     str5    %9s                   Time 60 minutes
time60_z        byte    %8.0g                 Sample ID of Time 60: Onsite EDTA
time60_a        str20   %20s                  Sample ID of Time 60: Aliquot A (EDTA)
time60_b        str20   %20s                  Sample ID of Time 60: Aliquot B (EDTA)
time60_c        str20   %20s                  Sample ID of Time 60: Aliquot C (EDTA)
time60_e        str20   %20s                  Sample ID of Time 60: Aliquot E (Cooled EDTA)
time60_f        str20   %20s                  Sample ID of Time 60: Aliquot F (Cooled EDTA)
time60_g        str20   %20s                  Sample ID of Time 60: Aliquot G (Cooled EDTA)
time60_h        str20   %20s                  Sample ID of Time 60: Aliquot H (Aprotinin)
time60_j        str20   %20s                  Sample ID of Time 60: Aliquot J (Aprotinin)
time60_k        str20   %20s                  Sample ID of Time 60: Aliquot K (Aprotinin)
ogtt_sample~a60 byte    %8.0g      ogtt_sample_edta60
                                              60 min EDTA
ogtt_sample~o60 byte    %8.0g      ogtt_sample_apro60
                                              60 min aprotinin
ogtt_sa~60_cold byte    %8.0g      ogtt_sample_edta60_cold
                                              60 min cooled EDTA
ogtt_comment~60 strL    %9s                   Explain any missing samples or problems in sample collection
glu60           float   %9.0g                 OGTT result_Time60
mmol_glu60      float   %9.0g                 Timepoint 60 Glucose in mmol/L
out_glu60       byte    %8.0g                 glucose 60 minutes > 24.6
glu60_missing   byte    %24.0g     glu60_missing
                                              Any problems with OGTT Results?
glu60_mis_spe~y strL    %9s                   Others, specify
cpeptide60      float   %9.0g                 C_Peptide_Time60
cpeptide60_pmol float   %9.0g                 Timepoint 60 C-peptide in pmol/L unit
insulin60       float   %9.0g                 Insulin_Time60
insulin60_pmol  float   %9.0g                 Timepoint 60 Insulin in pmol/L unit
ogtt_time90     str5    %9s                   Time 90 minutes
time90_z        byte    %8.0g                 Sample ID of Time 90: Onsite EDTA
time90_a        str20   %20s                  Sample ID of Time 90: Aliquot A (EDTA)
time90_b        str20   %20s                  Sample ID of Time 90: Aliquot B (EDTA)
time90_c        str20   %20s                  Sample ID of Time 90: Aliquot C (EDTA)
time90_e        str20   %20s                  Sample ID of Time 90: Aliquot E (Cooled EDTA)
time90_f        str20   %20s                  Sample ID of Time 90: Aliquot F (Cooled EDTA)
time90_g        str20   %20s                  Sample ID of Time 90: Aliquot G (Cooled EDTA)
time90_h        str20   %20s                  Sample ID of Time 90: Aliquot H (Aprotinin)
time90_j        str20   %20s                  Sample ID of Time 90: Aliquot J (Aprotinin)
time90_k        str20   %20s                  Sample ID of Time 90: Aliquot K (Aprotinin)
ogtt_sample~a90 byte    %8.0g      ogtt_sample_edta90
                                              90 min EDTA
ogtt_sample~o90 byte    %8.0g      ogtt_sample_apro90
                                              90 min aprotinin
ogtt_sa~90_cold byte    %8.0g      ogtt_sample_edta90_cold
                                              90 min cooled EDTA
ogtt_comment~90 str64   %64s                  Explain any missing samples or problems in sample collection
glu90           float   %9.0g                 OGTT result_Time90
mmol_glu90      float   %9.0g                 Timepoint 90 Glucose in mmol/L
out_glu90       byte    %8.0g                 glucose 90 minutes > 24.6
glu90_missing   byte    %24.0g     glu90_missing
                                              Any problems with OGTT Results?
glu90_mis_spe~y str45   %45s                  Others, specify
cpeptide90      byte    %8.0g                 C_Peptide_Time90
insulin90       byte    %8.0g                 Insulin_Time90
ogtt_time120    str5    %9s                   Time 120 minutes
time120_z       byte    %8.0g                 Sample ID of Time 120: Onsite EDTA
time120_a       str20   %20s                  Sample ID of Time 120: Aliquot A (EDTA)
time120_b       str20   %20s                  Sample ID of Time 120: Aliquot B (EDTA)
time120_c       str20   %20s                  Sample ID of Time 120: Aliquot C (EDTA)
time120_e       str20   %20s                  Sample ID of Time 120: Aliquot E (Cooled EDTA)
time120_f       str20   %20s                  Sample ID of Time 120: Aliquot F (Cooled EDTA)
time120_g       str20   %20s                  Sample ID of Time 120: Aliquot G (Cooled EDTA)
time120_h       str20   %20s                  Sample ID of Time 120: Aliquot H (Aprotinin)
time120_j       str20   %20s                  Sample ID of Time 120: Aliquot J (Aprotinin)
time120_k       str20   %20s                  Sample ID of Time 120: Aliquot K (Aprotinin)
ogtt_sampl~a120 byte    %8.0g      ogtt_sample_edta120
                                              120 min EDTA
ogtt_sampl~o120 byte    %8.0g      ogtt_sample_apro120
                                              120 min aprotinin
ogtt_sa~20_cold byte    %8.0g      ogtt_sample_edta120_cold
                                              120 min cooled EDTA
ogtt_commen~120 strL    %9s                   Explain any missing samples or problems in sample collection
glu120          float   %9.0g                 OGTT result_Time120
mmol_glu120     float   %9.0g                 Timepoint 120 Glucose in mmol/L
out_glu120      byte    %8.0g                 glucose 120 minutes > 24.6
glu120_missing  byte    %24.0g     glu120_missing
                                              Any problems with OGTT Results?
glu120_mis_sp~y strL    %9s                   Others, specify
cpeptide120     float   %9.0g                 C_Peptide_Time120
cpeptide120_p~l float   %9.0g                 Timepoint 120 C-peptide in pmol/L unit
insulin120      float   %9.0g                 Insulin_Time120
insulin120_pmol float   %9.0g                 Timepoint 120 Insulin in pmol/L unit
high_hba1c_1    byte    %8.0g                 hba1c>6.5%
high_glu120_1   byte    %8.0g                 glucose 120 minutes > 11.1 mmol/L
repeat_test_n~d byte    %36.0g     repeat_test_needed
                                              Does this participant in their first clinic visit have high HbA1c or glucose lev
repeat_date     str10   %10s                  Date of second OGTT appointment booked
personnel41     str7    %9s                   REDCap ID of Data Entry Personnel
timestamp41     str19   %19s                  Date of Data Entry
ogttr_confirm   byte    %8.0g                 Does the participant need to repeat OGTT?
rogtt_unit      byte    %8.0g                 
ogttr_time0     str8    %9s                   [4.13] Time 0
ogttr_time0_1   str18   %18s                  Sample ID of Time 0: Onsite EDTA
ogttr_sample_~a byte    %8.0g      ogttr_sample_edta
                                              [4.14] Fasting EDTA
ogttr_commen~e0 str4    %9s                   [4.15] Explain any missing samples or problems in sample collection
rglu0           float   %9.0g                 Repeat OGTT result_Time0
rglu0_missing   byte    %24.0g     rglu0_missing
                                              Any problems?
rglu0_mis_spe~y byte    %8.0g                 Others, specify
rhba1c          byte    %8.0g                 Repeat HbA1c result
ogttr_time30    byte    %8.0g                 [4.13] Time 30
ogttr_time30_1  byte    %8.0g                 Sample ID of Time 30: Onsite EDTA
ogttr_sample~30 byte    %8.0g      ogttr_sample_edta30
                                              [4.14] 30 min EDTA
ogttr_commen~30 byte    %8.0g                 [4.15] Explain any missing samples or problems in sample collection
rglu30          byte    %8.0g                 Repeat OGTT result_Time30
rglu30_missing  byte    %24.0g     rglu30_missing
                                              Any problems?
rglu30_mis_sp~y byte    %8.0g                 Others, specify
ogttr_time120   str8    %9s                   [4.13] Time 120
ogttr_time120_1 str18   %18s                  Sample ID of Time 120: Onsite EDTA
ogttr_sampl~120 byte    %8.0g      ogttr_sample_edta120
                                              [4.14] 120 min EDTA
ogttr_comme~120 str4    %9s                   [4.15] Explain any missing samples or problems in sample collection
rglu120         float   %9.0g                 Repeat OGTT result_Time120
rglu120_missing byte    %24.0g     rglu120_missing
                                              Any problems?
rglu120_mis_s~y byte    %8.0g                 Others, specify
mmol_rglu120    float   %9.0g                 Timepoint 120 Repeat OGTT glucose in mmol
high_glu120_2   byte    %8.0g                 glucose 120 minutes > 11.1
dia_referral    byte    %8.0g      dia_referral
                                              [5.13] Does this person need to be referred to the site physician because their
glu_comment     strL    %9s                   [5.14] Comments on any problems
rec_diab        byte    %23.0g     rec_diab   Does the participant have diabetes as diagnosed by a doctor?
ever_mal        double  %9.0g      ever_mal   Ever experience malnutrition?
degree_mal      float   %20.0g     degree_mal
                                              Degree of malnutrition
site            str7    %9s                   
_merge          byte    %23.0g     _merge     Matching result from merge
missing         float   %33.0g     code_miss
                                              
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. lookfor ogtt

Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
clinic_date_o~t str10   %10s                  Date of First OGTT Test
standard_ogtt   byte    %16.0g     standard_ogtt
                                              For adult participants agreeing to do Standard OGTT but are not in the indepth s
ogtt_unit       byte    %8.0g      ogtt_unit
                                              Unit of measurement
ogtt_time0      str8    %9s                   Time 0 minutes
ogtt_sample_s~m byte    %8.0g      ogtt_sample_serum
                                              Fasting serum
ogtt_sample_~a0 byte    %8.0g      ogtt_sample_edta0
                                              Fasting EDTA
ogtt_sample_~o0 byte    %8.0g      ogtt_sample_apro0
                                              Fasting aprotinin
ogtt_sa~a0_cold byte    %8.0g      ogtt_sample_edta0_cold
                                              Fasting cooled EDTA
ogtt_comment~e0 strL    %9s                   Explain any missing samples or problems in sample collection
hba1c           float   %9.0g                 Hba1c result [%] from baseline sample In OGTT
glu0            float   %9.0g                 OGTT result_Time0
glu0_missing    byte    %24.0g     glu0_missing
                                              Any problems with OGTT Results?
ogtt_time15     str5    %9s                   Time 15 minutes
ogtt_sample_~15 byte    %8.0g      ogtt_sample_edta15
                                              15 min EDTA
ogtt_comment~15 strL    %9s                   Explain any missing samples or problems in sample collection
glu15           float   %9.0g                 OGTT result_Time15
glu15_missing   byte    %24.0g     glu15_missing
                                              Any problems with OGTT Results?
ogtt_time30     str5    %9s                   Time 30 minutes
ogtt_sample~a30 byte    %8.0g      ogtt_sample_edta30
                                              30 min EDTA
ogtt_sample~o30 byte    %8.0g      ogtt_sample_apro30
                                              30 min aprotinin
ogtt_sa~30_cold byte    %8.0g      ogtt_sample_edta30_cold
                                              30 min cooled EDTA
ogtt_comment~30 strL    %9s                   Explain any missing samples or problems in sample collection
glu30           float   %9.0g                 OGTT result_Time30
glu30_missing   byte    %24.0g     glu30_missing
                                              Any problems with OGTT Results?
ogtt_time45     str5    %9s                   Time 45 minutes
ogtt_sample_~45 byte    %8.0g      ogtt_sample_edta45
                                              45 min EDTA
ogtt_comment~45 strL    %9s                   Explain any missing samples or problems in sample collection
glu45           float   %9.0g                 OGTT result_Time45
glu45_missing   byte    %24.0g     glu45_missing
                                              Any problems with OGTT Results?
ogtt_time60     str5    %9s                   Time 60 minutes
ogtt_sample~a60 byte    %8.0g      ogtt_sample_edta60
                                              60 min EDTA
ogtt_sample~o60 byte    %8.0g      ogtt_sample_apro60
                                              60 min aprotinin
ogtt_sa~60_cold byte    %8.0g      ogtt_sample_edta60_cold
                                              60 min cooled EDTA
ogtt_comment~60 strL    %9s                   Explain any missing samples or problems in sample collection
glu60           float   %9.0g                 OGTT result_Time60
glu60_missing   byte    %24.0g     glu60_missing
                                              Any problems with OGTT Results?
ogtt_time90     str5    %9s                   Time 90 minutes
ogtt_sample~a90 byte    %8.0g      ogtt_sample_edta90
                                              90 min EDTA
ogtt_sample~o90 byte    %8.0g      ogtt_sample_apro90
                                              90 min aprotinin
ogtt_sa~90_cold byte    %8.0g      ogtt_sample_edta90_cold
                                              90 min cooled EDTA
ogtt_comment~90 str64   %64s                  Explain any missing samples or problems in sample collection
glu90           float   %9.0g                 OGTT result_Time90
glu90_missing   byte    %24.0g     glu90_missing
                                              Any problems with OGTT Results?
ogtt_time120    str5    %9s                   Time 120 minutes
ogtt_sampl~a120 byte    %8.0g      ogtt_sample_edta120
                                              120 min EDTA
ogtt_sampl~o120 byte    %8.0g      ogtt_sample_apro120
                                              120 min aprotinin
ogtt_sa~20_cold byte    %8.0g      ogtt_sample_edta120_cold
                                              120 min cooled EDTA
ogtt_commen~120 strL    %9s                   Explain any missing samples or problems in sample collection
glu120          float   %9.0g                 OGTT result_Time120
glu120_missing  byte    %24.0g     glu120_missing
                                              Any problems with OGTT Results?
repeat_date     str10   %10s                  Date of second OGTT appointment booked
ogttr_confirm   byte    %8.0g                 Does the participant need to repeat OGTT?
rogtt_unit      byte    %8.0g                 
ogttr_time0     str8    %9s                   [4.13] Time 0
ogttr_time0_1   str18   %18s                  Sample ID of Time 0: Onsite EDTA
ogttr_sample_~a byte    %8.0g      ogttr_sample_edta
                                              [4.14] Fasting EDTA
ogttr_commen~e0 str4    %9s                   [4.15] Explain any missing samples or problems in sample collection
rglu0           float   %9.0g                 Repeat OGTT result_Time0
ogttr_time30    byte    %8.0g                 [4.13] Time 30
ogttr_time30_1  byte    %8.0g                 Sample ID of Time 30: Onsite EDTA
ogttr_sample~30 byte    %8.0g      ogttr_sample_edta30
                                              [4.14] 30 min EDTA
ogttr_commen~30 byte    %8.0g                 [4.15] Explain any missing samples or problems in sample collection
rglu30          byte    %8.0g                 Repeat OGTT result_Time30
ogttr_time120   str8    %9s                   [4.13] Time 120
ogttr_time120_1 str18   %18s                  Sample ID of Time 120: Onsite EDTA
ogttr_sampl~120 byte    %8.0g      ogttr_sample_edta120
                                              [4.14] 120 min EDTA
ogttr_comme~120 str4    %9s                   [4.15] Explain any missing samples or problems in sample collection
rglu120         float   %9.0g                 Repeat OGTT result_Time120
mmol_rglu120    float   %9.0g                 Timepoint 120 Repeat OGTT glucose in mmol

. help temp

. help delimit

. power prop 0.9
power: invalid method prop
    prop is not an officially supported power method.
r(198);

. help power

. power oneprop 0.93
alternative proportion is required to compute sample size
r(198);

. power oneprop 0.93 0.9

Performing iteration ...

Estimated sample size for a one-sample proportion test
Score z test
H0: p = p0  versus  Ha: p != p0

Study parameters:

        alpha =    0.0500
        power =    0.8000
        delta =   -0.0300
           p0 =    0.9300
           pa =    0.9000

Estimated sample size:

            N =       630

. power oneprop 0.07 0.015

Performing iteration ...

Estimated sample size for a one-sample proportion test
Score z test
H0: p = p0  versus  Ha: p != p0

Study parameters:

        alpha =    0.0500
        power =    0.8000
        delta =   -0.0550
           p0 =    0.0700
           pa =    0.0150

Estimated sample size:

            N =       120

. power oneprop 0.07 0.1

Performing iteration ...

Estimated sample size for a one-sample proportion test
Score z test
H0: p = p0  versus  Ha: p != p0

Study parameters:

        alpha =    0.0500
        power =    0.8000
        delta =    0.0300
           p0 =    0.0700
           pa =    0.1000

Estimated sample size:

            N =       630

. power oneprop 0.5 0.55

Performing iteration ...

Estimated sample size for a one-sample proportion test
Score z test
H0: p = p0  versus  Ha: p != p0

Study parameters:

        alpha =    0.0500
        power =    0.8000
        delta =    0.0500
           p0 =    0.5000
           pa =    0.5500

Estimated sample size:

            N =       783

. power oneprop 0.9 0.95

Performing iteration ...

Estimated sample size for a one-sample proportion test
Score z test
H0: p = p0  versus  Ha: p != p0

Study parameters:

        alpha =    0.0500
        power =    0.8000
        delta =    0.0500
           p0 =    0.9000
           pa =    0.9500

Estimated sample size:

            N =       239

. help by

. help webuse

. help tab1

. tab1
varlist required
r(100);

. d

Contains data from All_Crf4a_Blood_Sampling_And_Processing.dta
 Observations:         1,907                  
    Variables:           205                  27 Jan 2023 16:04
                                              (_dta has notes)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
record_id       str6    %9s                   
redcap_data_a~p str10   %10s                  
cohort          byte    %8.0g      cohort     Cohort
sampa_id        long    %12.0g                SAMPA ID
orgid           str18   %18s                  Cohort ID
sex             byte    %8.0g      sex        Sex
dob             str10   %10s                  Date of Birth
age             byte    %8.0g                 Age
agree           byte    %8.0g                 
personnel4      str7    %9s                   REDCap ID of Data Entry Personnel
timestamp4      str19   %19s                  Date of Data Entry
clinic_date_o~t str10   %10s                  Date of First OGTT Test
sample_gp       byte    %81.0g     sample_gp
                                              Which group does the person belong to?
standard_ogtt   byte    %16.0g     standard_ogtt
                                              For adult participants agreeing to do Standard OGTT but are not in the indepth s
fasting         byte    %31.0g     fasting    What has the participant eaten or drunk in the last 8 hours OR since dinner last
ogtt_unit       byte    %8.0g      ogtt_unit
                                              Unit of measurement
ogtt_time0      str8    %9s                   Time 0 minutes
time0_w         str20   %20s                  Sample ID of Time 0: Onsite Serum
time0_x         str20   %20s                  Sample ID of Time 0: Aliquot X (Serum)
time0_y         str20   %20s                  Sample ID of Time 0: Aliquot Y (Serum)
time0_z         byte    %8.0g                 Sample ID of Time 0: Aliquot Z (Serum)
time0_a         str20   %20s                  Sample ID of Time 0: Aliquot A (EDTA)
time0_b         str20   %20s                  Sample ID of Time 0: Aliquot B (EDTA)
time0_c         str20   %20s                  Sample ID of Time 0: Aliquot C (EDTA)
time0_e         str20   %20s                  Sample ID of Time 0: Aliquot E (Cooled EDTA)
time0_f         str20   %20s                  Sample ID of Time 0: Aliquot F (Cooled EDTA)
time0_g         str20   %20s                  Sample ID of Time 0: Aliquot G (Cooled EDTA)
time0_h         str20   %20s                  Sample ID of Time 0: Aliquot H (Aprotinin)
time0_j         str20   %20s                  Sample ID of Time 0: Aliquot J (Aprotinin)
time0_k         str20   %20s                  Sample ID of Time 0: Aliquot K (Aprotinin)
ogtt_sample_s~m byte    %8.0g      ogtt_sample_serum
                                              Fasting serum
ogtt_sample_~a0 byte    %8.0g      ogtt_sample_edta0
                                              Fasting EDTA
ogtt_sample_~o0 byte    %8.0g      ogtt_sample_apro0
                                              Fasting aprotinin
ogtt_sa~a0_cold byte    %8.0g      ogtt_sample_edta0_cold
                                              Fasting cooled EDTA
ogtt_comment~e0 strL    %9s                   Explain any missing samples or problems in sample collection
hba1c           float   %9.0g                 Hba1c result [%] from baseline sample In OGTT
glu0            float   %9.0g                 OGTT result_Time0
mmol_glu0       float   %9.0g                 Timepoint 0 Glucose in mmol/L
out_glu0        byte    %8.0g                 glucose 0 minutes > 24.6
glu0_missing    byte    %24.0g     glu0_missing
                                              Any problems with OGTT Results?
glu0_mis_spec~y str10   %10s                  Others, specify
cpeptide0       float   %9.0g                 C_Peptide_Time0
cpeptide0_pmol  float   %9.0g                 Timepoint 0 C-peptide in pmol/L unit
insulin0        float   %9.0g                 Insulin_Time0
insulin0_pmol   float   %9.0g                 Timepoint 0 Insulin in pmol/L unit
ogtt_time15     str5    %9s                   Time 15 minutes
time15_z        byte    %8.0g                 Sample ID of Time 15: Onsite EDTA
time15_a        str20   %20s                  Sample ID of Time 15: Aliquot A (EDTA)
time15_b        str20   %20s                  Sample ID of Time 15: Aliquot B (EDTA)
time15_c        str21   %21s                  Sample ID of Time 15: Aliquot C (EDTA)
ogtt_sample_~15 byte    %8.0g      ogtt_sample_edta15
                                              15 min EDTA
ogtt_comment~15 strL    %9s                   Explain any missing samples or problems in sample collection
glu15           float   %9.0g                 OGTT result_Time15
mmol_glu15      float   %9.0g                 Timepoint 15 Glucose in mmol/L
out_glu15       byte    %8.0g                 glucose 15 minutes > 24.6
glu15_missing   byte    %24.0g     glu15_missing
                                              Any problems with OGTT Results?
glu15_mis_spe~y strL    %9s                   Others, specify
cpeptide15      byte    %8.0g                 C_Peptide_Time15
insulin15       float   %9.0g                 Insulin_Time15
ogtt_time30     str5    %9s                   Time 30 minutes
time30_z        byte    %8.0g                 Sample ID of Time 30: Onsite EDTA
time30_a        str20   %20s                  Sample ID of Time 30: Aliquot A (EDTA)
time30_b        str20   %20s                  Sample ID of Time 30: Aliquot B (EDTA)
time30_c        str38   %38s                  Sample ID of Time 30: Aliquot C (EDTA)
time30_e        str20   %20s                  Sample ID of Time 30: Aliquot E (Cooled EDTA)
time30_f        str20   %20s                  Sample ID of Time 30: Aliquot F (Cooled EDTA)
time30_g        str20   %20s                  Sample ID of Time 30: Aliquot G (Cooled EDTA)
time30_h        str20   %20s                  Sample ID of Time 30: Aliquot H (Aprotinin)
time30_j        str20   %20s                  Sample ID of Time 30: Aliquot J (Aprotinin)
time30_k        str20   %20s                  Sample ID of Time 30: Aliquot K (Aprotinin)
ogtt_sample~a30 byte    %8.0g      ogtt_sample_edta30
                                              30 min EDTA
ogtt_sample~o30 byte    %8.0g      ogtt_sample_apro30
                                              30 min aprotinin
ogtt_sa~30_cold byte    %8.0g      ogtt_sample_edta30_cold
                                              30 min cooled EDTA
ogtt_comment~30 strL    %9s                   Explain any missing samples or problems in sample collection
glu30           float   %9.0g                 OGTT result_Time30
mmol_glu30      float   %9.0g                 Timepoint 30 Glucose in mmol/L
out_glu30       byte    %8.0g                 glucose 30 minutes > 24.6
glu30_missing   byte    %24.0g     glu30_missing
                                              Any problems with OGTT Results?
glu30_mis_spe~y strL    %9s                   Others, specify
cpeptide30      byte    %8.0g                 C_Peptide_Time30
insulin30       byte    %8.0g                 Insulin_Time30
ogtt_time45     str5    %9s                   Time 45 minutes
time45_z        byte    %8.0g                 Sample ID of Time 45: Onsite EDTA
time45_a        str20   %20s                  Sample ID of Time 45: Aliquot A (EDTA)
time45_b        str20   %20s                  Sample ID of Time 45: Aliquot B (EDTA)
time45_c        str38   %38s                  Sample ID of Time 45: Aliquot C (EDTA)
ogtt_sample_~45 byte    %8.0g      ogtt_sample_edta45
                                              45 min EDTA
ogtt_comment~45 strL    %9s                   Explain any missing samples or problems in sample collection
glu45           float   %9.0g                 OGTT result_Time45
mmol_glu45      float   %9.0g                 Timepoint 45 Glucose in mmol/L
out_glu45       byte    %8.0g                 glucose 45 minutes > 24.6
glu45_missing   byte    %24.0g     glu45_missing
                                              Any problems with OGTT Results?
glu45_mis_spe~y strL    %9s                   Others, specify
cpeptide45      byte    %8.0g                 C_Peptide_Time45
insulin45       byte    %8.0g                 Insulin_Time45
ogtt_time60     str5    %9s                   Time 60 minutes
time60_z        byte    %8.0g                 Sample ID of Time 60: Onsite EDTA
time60_a        str20   %20s                  Sample ID of Time 60: Aliquot A (EDTA)
time60_b        str20   %20s                  Sample ID of Time 60: Aliquot B (EDTA)
time60_c        str20   %20s                  Sample ID of Time 60: Aliquot C (EDTA)
time60_e        str20   %20s                  Sample ID of Time 60: Aliquot E (Cooled EDTA)
time60_f        str20   %20s                  Sample ID of Time 60: Aliquot F (Cooled EDTA)
time60_g        str20   %20s                  Sample ID of Time 60: Aliquot G (Cooled EDTA)
time60_h        str20   %20s                  Sample ID of Time 60: Aliquot H (Aprotinin)
time60_j        str20   %20s                  Sample ID of Time 60: Aliquot J (Aprotinin)
time60_k        str20   %20s                  Sample ID of Time 60: Aliquot K (Aprotinin)
ogtt_sample~a60 byte    %8.0g      ogtt_sample_edta60
                                              60 min EDTA
ogtt_sample~o60 byte    %8.0g      ogtt_sample_apro60
                                              60 min aprotinin
ogtt_sa~60_cold byte    %8.0g      ogtt_sample_edta60_cold
                                              60 min cooled EDTA
ogtt_comment~60 strL    %9s                   Explain any missing samples or problems in sample collection
glu60           float   %9.0g                 OGTT result_Time60
mmol_glu60      float   %9.0g                 Timepoint 60 Glucose in mmol/L
out_glu60       byte    %8.0g                 glucose 60 minutes > 24.6
glu60_missing   byte    %24.0g     glu60_missing
                                              Any problems with OGTT Results?
glu60_mis_spe~y strL    %9s                   Others, specify
cpeptide60      float   %9.0g                 C_Peptide_Time60
cpeptide60_pmol float   %9.0g                 Timepoint 60 C-peptide in pmol/L unit
insulin60       float   %9.0g                 Insulin_Time60
insulin60_pmol  float   %9.0g                 Timepoint 60 Insulin in pmol/L unit
ogtt_time90     str5    %9s                   Time 90 minutes
time90_z        byte    %8.0g                 Sample ID of Time 90: Onsite EDTA
time90_a        str20   %20s                  Sample ID of Time 90: Aliquot A (EDTA)
time90_b        str20   %20s                  Sample ID of Time 90: Aliquot B (EDTA)
time90_c        str20   %20s                  Sample ID of Time 90: Aliquot C (EDTA)
time90_e        str20   %20s                  Sample ID of Time 90: Aliquot E (Cooled EDTA)
time90_f        str20   %20s                  Sample ID of Time 90: Aliquot F (Cooled EDTA)
time90_g        str20   %20s                  Sample ID of Time 90: Aliquot G (Cooled EDTA)
time90_h        str20   %20s                  Sample ID of Time 90: Aliquot H (Aprotinin)
time90_j        str20   %20s                  Sample ID of Time 90: Aliquot J (Aprotinin)
time90_k        str20   %20s                  Sample ID of Time 90: Aliquot K (Aprotinin)
ogtt_sample~a90 byte    %8.0g      ogtt_sample_edta90
                                              90 min EDTA
ogtt_sample~o90 byte    %8.0g      ogtt_sample_apro90
                                              90 min aprotinin
ogtt_sa~90_cold byte    %8.0g      ogtt_sample_edta90_cold
                                              90 min cooled EDTA
ogtt_comment~90 str64   %64s                  Explain any missing samples or problems in sample collection
glu90           float   %9.0g                 OGTT result_Time90
mmol_glu90      float   %9.0g                 Timepoint 90 Glucose in mmol/L
out_glu90       byte    %8.0g                 glucose 90 minutes > 24.6
glu90_missing   byte    %24.0g     glu90_missing
                                              Any problems with OGTT Results?
glu90_mis_spe~y str45   %45s                  Others, specify
cpeptide90      byte    %8.0g                 C_Peptide_Time90
insulin90       byte    %8.0g                 Insulin_Time90
ogtt_time120    str5    %9s                   Time 120 minutes
time120_z       byte    %8.0g                 Sample ID of Time 120: Onsite EDTA
time120_a       str20   %20s                  Sample ID of Time 120: Aliquot A (EDTA)
time120_b       str20   %20s                  Sample ID of Time 120: Aliquot B (EDTA)
time120_c       str20   %20s                  Sample ID of Time 120: Aliquot C (EDTA)
time120_e       str20   %20s                  Sample ID of Time 120: Aliquot E (Cooled EDTA)
time120_f       str20   %20s                  Sample ID of Time 120: Aliquot F (Cooled EDTA)
time120_g       str20   %20s                  Sample ID of Time 120: Aliquot G (Cooled EDTA)
time120_h       str20   %20s                  Sample ID of Time 120: Aliquot H (Aprotinin)
time120_j       str20   %20s                  Sample ID of Time 120: Aliquot J (Aprotinin)
time120_k       str20   %20s                  Sample ID of Time 120: Aliquot K (Aprotinin)
ogtt_sampl~a120 byte    %8.0g      ogtt_sample_edta120
                                              120 min EDTA
ogtt_sampl~o120 byte    %8.0g      ogtt_sample_apro120
                                              120 min aprotinin
ogtt_sa~20_cold byte    %8.0g      ogtt_sample_edta120_cold
                                              120 min cooled EDTA
ogtt_commen~120 strL    %9s                   Explain any missing samples or problems in sample collection
glu120          float   %9.0g                 OGTT result_Time120
mmol_glu120     float   %9.0g                 Timepoint 120 Glucose in mmol/L
out_glu120      byte    %8.0g                 glucose 120 minutes > 24.6
glu120_missing  byte    %24.0g     glu120_missing
                                              Any problems with OGTT Results?
glu120_mis_sp~y strL    %9s                   Others, specify
cpeptide120     float   %9.0g                 C_Peptide_Time120
cpeptide120_p~l float   %9.0g                 Timepoint 120 C-peptide in pmol/L unit
insulin120      float   %9.0g                 Insulin_Time120
insulin120_pmol float   %9.0g                 Timepoint 120 Insulin in pmol/L unit
high_hba1c_1    byte    %8.0g                 hba1c>6.5%
high_glu120_1   byte    %8.0g                 glucose 120 minutes > 11.1 mmol/L
repeat_test_n~d byte    %36.0g     repeat_test_needed
                                              Does this participant in their first clinic visit have high HbA1c or glucose lev
repeat_date     str10   %10s                  Date of second OGTT appointment booked
personnel41     str7    %9s                   REDCap ID of Data Entry Personnel
timestamp41     str19   %19s                  Date of Data Entry
ogttr_confirm   byte    %8.0g                 Does the participant need to repeat OGTT?
rogtt_unit      byte    %8.0g                 
ogttr_time0     str8    %9s                   [4.13] Time 0
ogttr_time0_1   str18   %18s                  Sample ID of Time 0: Onsite EDTA
ogttr_sample_~a byte    %8.0g      ogttr_sample_edta
                                              [4.14] Fasting EDTA
ogttr_commen~e0 str4    %9s                   [4.15] Explain any missing samples or problems in sample collection
rglu0           float   %9.0g                 Repeat OGTT result_Time0
rglu0_missing   byte    %24.0g     rglu0_missing
                                              Any problems?
rglu0_mis_spe~y byte    %8.0g                 Others, specify
rhba1c          byte    %8.0g                 Repeat HbA1c result
ogttr_time30    byte    %8.0g                 [4.13] Time 30
ogttr_time30_1  byte    %8.0g                 Sample ID of Time 30: Onsite EDTA
ogttr_sample~30 byte    %8.0g      ogttr_sample_edta30
                                              [4.14] 30 min EDTA
ogttr_commen~30 byte    %8.0g                 [4.15] Explain any missing samples or problems in sample collection
rglu30          byte    %8.0g                 Repeat OGTT result_Time30
rglu30_missing  byte    %24.0g     rglu30_missing
                                              Any problems?
rglu30_mis_sp~y byte    %8.0g                 Others, specify
ogttr_time120   str8    %9s                   [4.13] Time 120
ogttr_time120_1 str18   %18s                  Sample ID of Time 120: Onsite EDTA
ogttr_sampl~120 byte    %8.0g      ogttr_sample_edta120
                                              [4.14] 120 min EDTA
ogttr_comme~120 str4    %9s                   [4.15] Explain any missing samples or problems in sample collection
rglu120         float   %9.0g                 Repeat OGTT result_Time120
rglu120_missing byte    %24.0g     rglu120_missing
                                              Any problems?
rglu120_mis_s~y byte    %8.0g                 Others, specify
mmol_rglu120    float   %9.0g                 Timepoint 120 Repeat OGTT glucose in mmol
high_glu120_2   byte    %8.0g                 glucose 120 minutes > 11.1
dia_referral    byte    %8.0g      dia_referral
                                              [5.13] Does this person need to be referred to the site physician because their
glu_comment     strL    %9s                   [5.14] Comments on any problems
rec_diab        byte    %23.0g     rec_diab   Does the participant have diabetes as diagnosed by a doctor?
ever_mal        double  %9.0g      ever_mal   Ever experience malnutrition?
degree_mal      float   %20.0g     degree_mal
                                              Degree of malnutrition
site            str7    %9s                   
_merge          byte    %23.0g     _merge     Matching result from merge
missing         float   %33.0g     code_miss
                                              
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. tab regino
variable regino not found
r(111);

. tab region
variable region not found
r(111);

. tab cohort

     Cohort |      Freq.     Percent        Cum.
------------+-----------------------------------
     DIVIDS |        342       17.93       17.93
        SAM |         57        2.99       20.92
     CICADA |        757       39.70       60.62
    NUSTART |        239       12.53       73.15
      STATT |        272       14.26       87.41
      CLHNS |        240       12.59      100.00
------------+-----------------------------------
      Total |      1,907      100.00

. tab1 cohort

-> tabulation of cohort  

     Cohort |      Freq.     Percent        Cum.
------------+-----------------------------------
     DIVIDS |        342       17.93       17.93
        SAM |         57        2.99       20.92
     CICADA |        757       39.70       60.62
    NUSTART |        239       12.53       73.15
      STATT |        272       14.26       87.41
      CLHNS |        240       12.59      100.00
------------+-----------------------------------
      Total |      1,907      100.00

. ret list

scalars:
                  r(N) =  1907
                  r(r) =  6

. help return 

. ret loc
non r-class program may not set r()
r(151);

. return local
non r-class program may not set r()
r(151);

. tabulate cohort, summarize(hba1c)

            |  Summary of Hba1c result [%] from
            |       baseline sample In OGTT
     Cohort |        Mean   Std. dev.       Freq.
------------+------------------------------------
     DIVIDS |    5.260367   .32002662         327
        SAM |   5.3163265    .6520311          49
     CICADA |   5.9241656   .91700556         749
    NUSTART |   5.5486364   1.1839674         220
      STATT |    5.453625   1.6311799         240
      CLHNS |   5.8446983   1.1220733         232
------------+------------------------------------
      Total |   5.6705449   1.0618219       1,817

. ret list

. return list

. tabulate cohort ` high_hba1c_1, summarize(hba1c)
` invalid name
r(198);

. tabulate cohort high_hba1c_1, summarize(hba1c)

                Means, Standard Deviations and Frequencies
             of Hba1c result [%] from baseline sample In OGTT

           |     hba1c>6.5%
    Cohort |         0          1 |     Total
-----------+----------------------+----------
    DIVIDS |  5.260367          . |  5.260367
           | .32002662          . | .32002662
           |       327          0 |       327
-----------+----------------------+----------
       SAM | 5.2319149        7.3 | 5.3163265
           | .49961132  .84852834 |  .6520311
           |        47          2 |        49
-----------+----------------------+----------
    CICADA |  5.538676  7.1885714 | 5.9241656
           | .50584956  .82104902 | .91700556
           |       574        175 |       749
-----------+----------------------+----------
   NUSTART |  5.257868  8.0391304 | 5.5486364
           | .52245643  2.0689785 | 1.1839674
           |       197         23 |       220
-----------+----------------------+----------
     STATT |  4.856439  8.9514285 |  5.453625
           | .50628356  1.5558942 | 1.6311799
           |       205         35 |       240
-----------+----------------------+----------
     CLHNS | 5.4869588  7.6710526 | 5.8446983
           | .58638572  1.4036454 | 1.1220733
           |       194         38 |       232
-----------+----------------------+----------
     Total | 5.3374871  7.5542124 | 5.6705449
           | .53543791  1.3077507 | 1.0618219
           |      1544        273 |      1817

. tabulate cohort high_hba1c_1

           |      hba1c>6.5%
    Cohort |         0          1 |     Total
-----------+----------------------+----------
    DIVIDS |       331          0 |       331 
       SAM |        49          2 |        51 
    CICADA |       579        175 |       754 
   NUSTART |       197         23 |       220 
     STATT |       220         35 |       255 
     CLHNS |       199         38 |       237 
-----------+----------------------+----------
     Total |     1,575        273 |     1,848 

. ret list

scalars:
                  r(N) =  1848
                  r(r) =  6
                  r(c) =  2

. help summarize

. summarize hba1c

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |      1,817    5.670545    1.061822        3.7         14

. sum hba1c, detail

        Hba1c result [%] from baseline sample In OGTT
-------------------------------------------------------------
      Percentiles      Smallest
 1%          4.1            3.7
 5%          4.5           3.74
10%          4.7           3.95       Obs               1,817
25%          5.1              4       Sum of wgt.       1,817

50%          5.5                      Mean           5.670545
                        Largest       Std. dev.      1.061822
75%            6           12.3
90%          6.8           12.7       Variance       1.127466
95%          7.5           12.8       Skewness       2.372051
99%         10.1             14       Kurtosis       12.75621

. ret list

scalars:
                  r(N) =  1817
              r(sum_w) =  1817
               r(mean) =  5.670544858023434
                r(Var) =  1.127465716359807
                 r(sd) =  1.061821885421377
           r(skewness) =  2.37205094790342
           r(kurtosis) =  12.75620856876594
                r(sum) =  10303.38000702858
                r(min) =  3.700000047683716
                r(max) =  14
                 r(p1) =  4.099999904632568
                 r(p5) =  4.5
                r(p10) =  4.699999809265137
                r(p25) =  5.099999904632568
                r(p50) =  5.5
                r(p75) =  6
                r(p90) =  6.800000190734863
                r(p95) =  7.5
                r(p99) =  10.10000038146973

. help summarize

. help ci

. help table

. table cohort

----------------------
          |  Frequency
----------+-----------
Cohort    |           
  DIVIDS  |        342
  SAM     |         57
  CICADA  |        757
  NUSTART |        239
  STATT   |        272
  CLHNS   |        240
  Total   |      1,907
----------------------

. ret list

scalars:
                  r(N) =  1907

. table cohort high_hba1c_1

--------------------------------
          |       hba1c>6.5%    
          |      0     1   Total
----------+---------------------
Cohort    |                     
  DIVIDS  |    331           331
  SAM     |     49     2      51
  CICADA  |    579   175     754
  NUSTART |    197    23     220
  STATT   |    220    35     255
  CLHNS   |    199    38     237
  Total   |  1,575   273   1,848
--------------------------------

. collect dims

Collection dimensions
Collection: Table
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
                      cmdset   1         
                      cohort   7         
                     command   1         
                high_hba1c_1   3         
                      result   1         
                     statcmd   1         

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. table cohort 

----------------------
          |  Frequency
----------+-----------
Cohort    |           
  DIVIDS  |        342
  SAM     |         57
  CICADA  |        757
  NUSTART |        239
  STATT   |        272
  CLHNS   |        240
  Total   |      1,907
----------------------

. collect dims

Collection dimensions
Collection: Table
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
                      cmdset   1         
                      cohort   7         
                     command   1         
                      result   1         
                     statcmd   1         

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. tabulate cohort

     Cohort |      Freq.     Percent        Cum.
------------+-----------------------------------
     DIVIDS |        342       17.93       17.93
        SAM |         57        2.99       20.92
     CICADA |        757       39.70       60.62
    NUSTART |        239       12.53       73.15
      STATT |        272       14.26       87.41
      CLHNS |        240       12.59      100.00
------------+-----------------------------------
      Total |      1,907      100.00

. collect clear

. tabulate cohort

     Cohort |      Freq.     Percent        Cum.
------------+-----------------------------------
     DIVIDS |        342       17.93       17.93
        SAM |         57        2.99       20.92
     CICADA |        757       39.70       60.62
    NUSTART |        239       12.53       73.15
      STATT |        272       14.26       87.41
      CLHNS |        240       12.59      100.00
------------+-----------------------------------
      Total |      1,907      100.00

. collect dims

. help cii

. cii hba1c
you must specify one of means, proportions, or variances following cii
r(198);

. cii means hba1c
variable found where a number expected; perhaps you meant to use ci
r(198);

. ci means hba1c

    Variable |        Obs        Mean    Std. err.       [95% conf. interval]
-------------+---------------------------------------------------------------
       hba1c |      1,817    5.670545      .02491         5.62169      5.7194

. ret list

scalars:
                  r(N) =  1817
               r(mean) =  5.670544858023434
                 r(se) =  .0249100276024886
                 r(lb) =  5.621689539352092
                 r(ub) =  5.719400176694776
              r(level) =  95

macros:
             r(citype) : "normal"

. table hba1c, command (ci means)

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                              |  Number of observations or, if poisson is specified, exposure   Lower bound of CI   Confidence level of CI   Mean   Std. error   Upper bound of CI
----------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------
Hba1c result [%] from baseline sample In OGTT |                                                                                                                                                   
  3.7                                         |                                                             1                   .                       95      1            .                   .
  3.74                                        |                                                             1                   .                       95      1            .                   .
  3.95                                        |                                                             1                   .                       95      1            .                   .
  4                                           |                                                             8                   1                       95      1            0                   1
  4.07                                        |                                                             1                   .                       95      1            .                   .
  4.1                                         |                                                            12                   1                       95      1            0                   1
  4.2                                         |                                                            12                   1                       95      1            0                   1
  4.26                                        |                                                             1                   .                       95      1            .                   .
  4.3                                         |                                                            27                   1                       95      1            0                   1
  4.38                                        |                                                             1                   .                       95      1            .                   .
  4.4                                         |                                                            22                   1                       95      1            0                   1
  4.44                                        |                                                             1                   .                       95      1            .                   .
  4.5                                         |                                                            50                   1                       95      1            0                   1
  4.6                                         |                                                            37                   1                       95      1            0                   1
  4.7                                         |                                                            50                   1                       95      1            0                   1
  4.8                                         |                                                            71                   1                       95      1            0                   1
  4.9                                         |                                                            69                   1                       95      1            0                   1
  5                                           |                                                            82                   1                       95      1            0                   1
  5.1                                         |                                                            96                   1                       95      1            0                   1
  5.2                                         |                                                           112                   1                       95      1            0                   1
  5.3                                         |                                                           110                   1                       95      1            0                   1
  5.34                                        |                                                             1                   .                       95      1            .                   .
  5.4                                         |                                                           112                   1                       95      1            0                   1
  5.5                                         |                                                           102                   1                       95      1            0                   1
  5.6                                         |                                                            96                   1                       95      1            0                   1
  5.7                                         |                                                            96                   1                       95      1            0                   1
  5.8                                         |                                                            90                   1                       95      1            0                   1
  5.9                                         |                                                            91                   1                       95      1            0                   1
  6                                           |                                                            57                   1                       95      1            0                   1
  6.1                                         |                                                            32                   1                       95      1            0                   1
  6.2                                         |                                                            37                   1                       95      1            0                   1
  6.3                                         |                                                            35                   1                       95      1            0                   1
  6.4                                         |                                                            30                   1                       95      1            0                   1
  6.5                                         |                                                            36                   1                       95      1            0                   1
  6.6                                         |                                                            22                   1                       95      1            0                   1
  6.7                                         |                                                            23                   1                       95      1            0                   1
  6.8                                         |                                                            20                   1                       95      1            0                   1
  6.9                                         |                                                            14                   1                       95      1            0                   1
  7                                           |                                                            16                   1                       95      1            0                   1
  7.1                                         |                                                            17                   1                       95      1            0                   1
  7.2                                         |                                                            10                   1                       95      1            0                   1
  7.3                                         |                                                            12                   1                       95      1            0                   1
  7.4                                         |                                                            12                   1                       95      1            0                   1
  7.5                                         |                                                             7                   1                       95      1            0                   1
  7.6                                         |                                                             5                   1                       95      1            0                   1
  7.7                                         |                                                             5                   1                       95      1            0                   1
  7.8                                         |                                                             5                   1                       95      1            0                   1
  7.9                                         |                                                             4                   1                       95      1            0                   1
  8                                           |                                                             2                   1                       95      1            0                   1
  8.1                                         |                                                             4                   1                       95      1            0                   1
  8.2                                         |                                                             8                   1                       95      1            0                   1
  8.3                                         |                                                             2                   1                       95      1            0                   1
  8.4                                         |                                                             1                   .                       95      1            .                   .
  8.5                                         |                                                             4                   1                       95      1            0                   1
  8.6                                         |                                                             3                   1                       95      1            0                   1
  8.7                                         |                                                             2                   1                       95      1            0                   1
  8.8                                         |                                                             3                   1                       95      1            0                   1
  8.9                                         |                                                             1                   .                       95      1            .                   .
  9                                           |                                                             5                   1                       95      1            0                   1
  9.2                                         |                                                             2                   1                       95      1            0                   1
  9.4                                         |                                                             2                   1                       95      1            0                   1
  9.5                                         |                                                             2                   1                       95      1            0                   1
  9.7                                         |                                                             1                   .                       95      1            .                   .
  9.9                                         |                                                             2                   1                       95      1            0                   1
  10                                          |                                                             2                   1                       95      1            0                   1
  10.1                                        |                                                             1                   .                       95      1            .                   .
  10.2                                        |                                                             4                   1                       95      1            0                   1
  10.3                                        |                                                             1                   .                       95      1            .                   .
  10.5                                        |                                                             1                   .                       95      1            .                   .
  10.7                                        |                                                             1                   .                       95      1            .                   .
  10.9                                        |                                                             1                   .                       95      1            .                   .
  11.1                                        |                                                             1                   .                       95      1            .                   .
  11.3                                        |                                                             1                   .                       95      1            .                   .
  11.4                                        |                                                             2                   1                       95      1            0                   1
  11.5                                        |                                                             1                   .                       95      1            .                   .
  11.7                                        |                                                             1                   .                       95      1            .                   .
  12.3                                        |                                                             1                   .                       95      1            .                   .
  12.7                                        |                                                             1                   .                       95      1            .                   .
  12.8                                        |                                                             1                   .                       95      1            .                   .
  14                                          |                                                             1                   .                       95      1            .                   .
  Total                                       |                                                          1817                   1                       95      1            0                   1
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. table cohort, command (ci means hba1c)

------------------------------------------------------------------------------------------------------------------------------------------------------------------
          |  Number of observations or, if poisson is specified, exposure   Lower bound of CI   Confidence level of CI       Mean   Std. error   Upper bound of CI
----------+-------------------------------------------------------------------------------------------------------------------------------------------------------
Cohort    |                                                                                                                                                       
  DIVIDS  |                                                           327            5.225551                       95   5.260367     .0176975            5.295183
  SAM     |                                                            49            5.129041                       95   5.316327     .0931473            5.503612
  CICADA  |                                                           749            5.858387                       95   5.924166     .0335067            5.989944
  NUSTART |                                                           220            5.391317                       95   5.548636     .0798231            5.705956
  STATT   |                                                           240            5.246206                       95   5.453625     .1052922            5.661044
  CLHNS   |                                                           232            5.699552                       95   5.844698     .0736677            5.989845
  Total   |                                                          1817             5.62169                       95   5.670545       .02491              5.7194
------------------------------------------------------------------------------------------------------------------------------------------------------------------

. table cohort

----------------------
          |  Frequency
----------+-----------
Cohort    |           
  DIVIDS  |        342
  SAM     |         57
  CICADA  |        757
  NUSTART |        239
  STATT   |        272
  CLHNS   |        240
  Total   |      1,907
----------------------

. table cohort sex high high_hba1c_1
high ambiguous abbreviation
r(111);

. table cohort sex high_hba1c_1

-----------------------------------
             |       hba1c>6.5%    
             |      0     1   Total
-------------+---------------------
Cohort       |                     
  DIVIDS     |                     
    Sex      |                     
      Male   |    164           164
      Female |    167           167
      Total  |    331           331
  SAM        |                     
    Sex      |                     
      Male   |     29     1      30
      Female |     20     1      21
      Total  |     49     2      51
  CICADA     |                     
    Sex      |                     
      Male   |    256    60     316
      Female |    323   115     438
      Total  |    579   175     754
  NUSTART    |                     
    Sex      |                     
      Male   |     65     2      67
      Female |    132    21     153
      Total  |    197    23     220
  STATT      |                     
    Sex      |                     
      Male   |    153    20     173
      Female |     67    15      82
      Total  |    220    35     255
  CLHNS      |                     
    Sex      |                     
      Male   |    127    27     154
      Female |     72    11      83
      Total  |    199    38     237
  Total      |                     
    Sex      |                     
      Male   |    794   110     904
      Female |    781   163     944
      Total  |  1,575   273   1,848
-----------------------------------

. table cohort, stat(percent)

--------------------
          |  Percent
----------+---------
Cohort    |         
  DIVIDS  |    17.93
  SAM     |     2.99
  CICADA  |    39.70
  NUSTART |    12.53
  STATT   |    14.26
  CLHNS   |    12.59
  Total   |   100.00
--------------------

. table cohort

----------------------
          |  Frequency
----------+-----------
Cohort    |           
  DIVIDS  |        342
  SAM     |         57
  CICADA  |        757
  NUSTART |        239
  STATT   |        272
  CLHNS   |        240
  Total   |      1,907
----------------------

. table cohort, stat(percent freq)
variable freq not found
(error in option statistic())
r(111);

. table cohort, stat(percent) stat(freq)

--------------------------------
          |  Percent   Frequency
----------+---------------------
Cohort    |                     
  DIVIDS  |    17.93         342
  SAM     |     2.99          57
  CICADA  |    39.70         757
  NUSTART |    12.53         239
  STATT   |    14.26         272
  CLHNS   |    12.59         240
  Total   |   100.00       1,907
--------------------------------

. help recode

. help dataex

. pwd
/Users/juansolon/Downloads

. dataex hba1c

----------------------- copy starting from the next line -----------------------
[CODE]
* Example generated by -dataex-. For more info, type help dataex
clear
input float hba1c
 5.7
 4.9
 5.7
 4.8
 4.8
 5.6
   .
 5.9
 5.4
 5.1
 5.5
 4.5
 5.3
 5.7
   .
 5.5
 4.5
 5.5
 5.5
   5
 5.6
 5.2
 5.4
 5.3
 5.3
 5.2
 4.9
 5.4
 5.2
 5.1
 5.8
 5.2
 5.6
 5.1
 5.9
 4.8
   .
 5.3
 5.2
   .
 5.3
 5.1
 4.5
 4.8
 5.6
 5.4
   5
 5.7
 6.2
 4.9
   .
 5.1
 5.4
   .
 5.3
   5
 5.1
 4.9
 5.1
 5.3
 4.6
 5.2
 5.1
 5.6
 4.9
   5
 4.6
5.34
 5.5
 5.3
 4.8
 4.9
 5.2
 5.3
 5.5
 5.2
 5.5
 5.1
 6.2
 5.9
 5.3
 5.1
 5.3
 4.9
   5
 5.6
 5.1
 4.7
 4.8
 5.4
 5.2
 5.2
 5.2
   .
 5.6
 5.2
 5.8
 4.8
 4.9
 5.6
end
[/CODE]
------------------ copy up to and including the previous line ------------------

Listed 100 out of 1907 observations
Use the count() option to list more

. dataex hba1c cohort in 1/5

----------------------- copy starting from the next line -----------------------
[CODE]
* Example generated by -dataex-. For more info, type help dataex
clear
input float hba1c byte cohort
5.7 3
4.9 1
5.7 1
4.8 1
4.8 1
end
label values cohort cohort
label def cohort 1 "DIVIDS", modify
label def cohort 3 "CICADA", modify
[/CODE]
------------------ copy up to and including the previous line ------------------

Listed 5 out of 1907 observations

. by region: sum hba1c
variable region not found
r(111);

. by cohort: sum hba1c
not sorted
r(5);

. bysort cohort: sum hba1c

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = DIVIDS

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        327    5.260367    .3200266        4.1        6.2

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = SAM

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |         49    5.316327    .6520311          4        7.9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = CICADA

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        749    5.924166    .9170056          4       10.9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = NUSTART

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        220    5.548636    1.183967          4         14

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = STATT

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        240    5.453625     1.63118        3.7       12.8

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = CLHNS

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        232    5.844698    1.122073       3.74       12.7


. ret list

scalars:
                  r(N) =  232
              r(sum_w) =  232
               r(mean) =  5.844698279068388
                r(Var) =  1.259048387640699
                 r(sd) =  1.122073254133035
                r(min) =  3.740000009536743
                r(max) =  12.69999980926514
                r(sum) =  1355.970000743866

. collect bysort cohort: sum hba1c

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |      1,817    5.670545    1.061822        3.7         14
bysort not found
r(111);

. help collect

. collect get bysort cohort: sum hba1c

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |      1,817    5.670545    1.061822        3.7         14
bysort not found
r(111);

. collect get cohort: sum hba1c

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |      1,817    5.670545    1.061822        3.7         14
cohort not found
r(111);

. collect get: sum hba1c

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |      1,817    5.670545    1.061822        3.7         14

. collect clear

. collect dims

. collect get: sum hba1c

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |      1,817    5.670545    1.061822        3.7         14

. collect dims

Collection dimensions
Collection: default
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
                      cmdset   1         
               program_class   2         
                      result   8         
                 result_type   1         

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. collect levelsof result

Collection: default
 Dimension: result
    Levels: N Var max mean min sd sum sum_w

. collect levelsof result_

. collect levelsof result_type

Collection: default
 Dimension: result_type
    Levels: scalar

. collect levelsof program_class

Collection: default
 Dimension: program_class
    Levels: eclass rclass

. collect clear

. bysort cohort: collect get sum hba1c
request may not be combined with by
r(190);

. by cohort: collect get sum hba1c
request may not be combined with by
r(190);

. by cohort: collect get: sum hba1c

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = DIVIDS

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        327    5.260367    .3200266        4.1        6.2

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = SAM

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |         49    5.316327    .6520311          4        7.9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = CICADA

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        749    5.924166    .9170056          4       10.9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = NUSTART

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        220    5.548636    1.183967          4         14

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = STATT

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        240    5.453625     1.63118        3.7       12.8

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = CLHNS

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        232    5.844698    1.122073       3.74       12.7

. collect dims

Collection dimensions
Collection: default
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
                      cmdset   6         
                      cohort   6         
               program_class   2         
                      result   8         
                 result_type   1         

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. collect levelsof cohort

Collection: default
 Dimension: cohort
    Levels: 1 2 3 4 5 6

. collect levelsof result

Collection: default
 Dimension: result
    Levels: N Var max mean min sd sum sum_w

. collect clear

. collect get: sum hba1c, detail

        Hba1c result [%] from baseline sample In OGTT
-------------------------------------------------------------
      Percentiles      Smallest
 1%          4.1            3.7
 5%          4.5           3.74
10%          4.7           3.95       Obs               1,817
25%          5.1              4       Sum of wgt.       1,817

50%          5.5                      Mean           5.670545
                        Largest       Std. dev.      1.061822
75%            6           12.3
90%          6.8           12.7       Variance       1.127466
95%          7.5           12.8       Skewness       2.372051
99%         10.1             14       Kurtosis       12.75621

. collect dims

Collection dimensions
Collection: default
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
                      cmdset   1         
               program_class   2         
                      result   19        
                 result_type   1         

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. collect levelsof result

Collection: default
 Dimension: result
    Levels: N Var kurtosis max mean min p1 p10 p25 p5 p50 p75 p90 p95 p99 sd skewness sum sum_w

. collect layout resul
invalid row dimensions specification; resul found where parentheses bound row dimensions expected
r(198);

. collect layout cohort result
invalid row dimensions specification; cohort found where parentheses bound row dimensions expected
r(198);

. collect layout (cohort) (result)
(dimension cohort not found)

Collection: default
      Rows: cohort
   Columns: result
   Table 1: 1 x 19

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
> -------------------------------------------------------------
Number of observations Variance Kurtosis Maximum     Mean Minimum 1st percentile 10th percentile 25th percentile 5th percentile 50th percentile 75th percentile 90th percentile 95th percentile 99th per
> centile Std. dev. Skewness Sum of variable Sum of the weights
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
> -------------------------------------------------------------
                  1817 1.127466 12.75621      14 5.670545     3.7            4.1             4.7             5.1            4.5             5.5               6             6.8             7.5         
>    10.1  1.061822 2.372051        10303.38               1817
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
> -------------------------------------------------------------

. collect layout (result) (cohort)

Collection: default
      Rows: result
   Columns: cohort
   Table 1: 19 x 1

---------------------------------
Number of observations |     1817
Variance               | 1.127466
Kurtosis               | 12.75621
Maximum                |       14
Mean                   | 5.670545
Minimum                |      3.7
1st percentile         |      4.1
10th percentile        |      4.7
25th percentile        |      5.1
5th percentile         |      4.5
50th percentile        |      5.5
75th percentile        |        6
90th percentile        |      6.8
95th percentile        |      7.5
99th percentile        |     10.1
Std. dev.              | 1.061822
Skewness               | 2.372051
Sum of variable        | 10303.38
Sum of the weights     |     1817
---------------------------------

. cii prop hba1c
variable found where a number expected; perhaps you meant to use ci
r(198);

. ci prop hba1c
no binary (0/1) variables found; nothing to compute

. ci means hba1c

    Variable |        Obs        Mean    Std. err.       [95% conf. interval]
-------------+---------------------------------------------------------------
       hba1c |      1,817    5.670545      .02491         5.62169      5.7194

. ret list

scalars:
                  r(N) =  1817
               r(mean) =  5.670544858023434
                 r(se) =  .0249100276024886
                 r(lb) =  5.621689539352092
                 r(ub) =  5.719400176694776
              r(level) =  95

macros:
             r(citype) : "normal"

. help frame

. help table

. table cohort high_hba1c_1

--------------------------------
          |       hba1c>6.5%    
          |      0     1   Total
----------+---------------------
Cohort    |                     
  DIVIDS  |    331           331
  SAM     |     49     2      51
  CICADA  |    579   175     754
  NUSTART |    197    23     220
  STATT   |    220    35     255
  CLHNS   |    199    38     237
  Total   |  1,575   273   1,848
--------------------------------

. table cohort high_hba1c_1, stat(freq) stat(percent)

---------------------------------------
              |        hba1c>6.5%      
              |      0       1    Total
--------------+------------------------
Cohort        |                        
  DIVIDS      |                        
    Frequency |    331              331
    Percent   |  17.91            17.91
  SAM         |                        
    Frequency |     49       2       51
    Percent   |   2.65    0.11     2.76
  CICADA      |                        
    Frequency |    579     175      754
    Percent   |  31.33    9.47    40.80
  NUSTART     |                        
    Frequency |    197      23      220
    Percent   |  10.66    1.24    11.90
  STATT       |                        
    Frequency |    220      35      255
    Percent   |  11.90    1.89    13.80
  CLHNS       |                        
    Frequency |    199      38      237
    Percent   |  10.77    2.06    12.82
  Total       |                        
    Frequency |  1,575     273    1,848
    Percent   |  85.23   14.77   100.00
---------------------------------------

. table cohort high_hba1c_1, stat(freq) stat(percent) stat(fvpercent)
statistic fvpercent incorrectly specified; varlist required
r(101);

. table cohort high_hba1c_1, stat(freq) stat(percent) nototals

-----------------------------
              |   hba1c>6.5% 
              |      0      1
--------------+--------------
Cohort        |              
  DIVIDS      |              
    Frequency |    331       
    Percent   |  17.91       
  SAM         |              
    Frequency |     49      2
    Percent   |   2.65   0.11
  CICADA      |              
    Frequency |    579    175
    Percent   |  31.33   9.47
  NUSTART     |              
    Frequency |    197     23
    Percent   |  10.66   1.24
  STATT       |              
    Frequency |    220     35
    Percent   |  11.90   1.89
  CLHNS       |              
    Frequency |    199     38
    Percent   |  10.77   2.06
-----------------------------

. collect clear

. collet get: summarize hba1c
command collet is unrecognized
r(199);

. collect get: summarize hba1c

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |      1,817    5.670545    1.061822        3.7         14

. ret list

scalars:
                  r(N) =  1817
              r(sum_w) =  1817
               r(mean) =  5.670544858023434
                r(Var) =  1.127465716359807
                 r(sd) =  1.061821885421377
                r(min) =  3.700000047683716
                r(max) =  14
                r(sum) =  10303.38000702858

. collect dims

Collection dimensions
Collection: default
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
                      cmdset   1         
               program_class   2         
                      result   8         
                 result_type   1         

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. collect levelsof result

Collection: default
 Dimension: result
    Levels: N Var max mean min sd sum sum_w

. collect clear

. bysort cohort: sum hba1c

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = DIVIDS

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        327    5.260367    .3200266        4.1        6.2

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = SAM

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |         49    5.316327    .6520311          4        7.9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = CICADA

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        749    5.924166    .9170056          4       10.9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = NUSTART

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        220    5.548636    1.183967          4         14

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = STATT

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        240    5.453625     1.63118        3.7       12.8

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = CLHNS

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        232    5.844698    1.122073       3.74       12.7


. ret list

scalars:
                  r(N) =  232
              r(sum_w) =  232
               r(mean) =  5.844698279068388
                r(Var) =  1.259048387640699
                 r(sd) =  1.122073254133035
                r(min) =  3.740000009536743
                r(max) =  12.69999980926514
                r(sum) =  1355.970000743866

. collect dims

. bysort cohort: collect get: sum hba1c

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = DIVIDS

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        327    5.260367    .3200266        4.1        6.2

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = SAM

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |         49    5.316327    .6520311          4        7.9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = CICADA

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        749    5.924166    .9170056          4       10.9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = NUSTART

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        220    5.548636    1.183967          4         14

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = STATT

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        240    5.453625     1.63118        3.7       12.8

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> cohort = CLHNS

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |        232    5.844698    1.122073       3.74       12.7

. collect dims

Collection dimensions
Collection: default
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
                      cmdset   6         
                      cohort   6         
               program_class   2         
                      result   8         
                 result_type   1         

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. collect layout (cohort) (result)

Collection: default
      Rows: cohort
   Columns: result
   Table 1: 6 x 8

---------------------------------------------------------------------------------------------------------------
        | Number of observations Variance Maximum     Mean Minimum Std. dev. Sum of variable Sum of the weights
--------+------------------------------------------------------------------------------------------------------
DIVIDS  |                    327  .102417     6.2 5.260367     4.1  .3200266         1720.14                327
SAM     |                     49 .4251446     7.9 5.316327       4  .6520311           260.5                 49
CICADA  |                    749 .8408992    10.9 5.924166       4  .9170056          4437.2                749
NUSTART |                    220 1.401779      14 5.548636       4  1.183967          1220.7                220
STATT   |                    240 2.660748    12.8 5.453625     3.7   1.63118         1308.87                240
CLHNS   |                    232 1.259048    12.7 5.844698    3.74  1.122073         1355.97                232
---------------------------------------------------------------------------------------------------------------

. table cohort, stat(mean hba1c) stat(sd hba1c) stat(min hba1c) stat(max hba1c)

--------------------------------------------------------------------------
          |      Mean   Standard deviation   Minimum value   Maximum value
----------+---------------------------------------------------------------
Cohort    |                                                               
  DIVIDS  |  5.260367             .3200266             4.1             6.2
  SAM     |  5.316327             .6520311               4             7.9
  CICADA  |  5.924166             .9170056               4            10.9
  NUSTART |  5.548636             1.183967               4              14
  STATT   |  5.453625              1.63118             3.7            12.8
  CLHNS   |  5.844698             1.122073            3.74            12.7
  Total   |  5.670545             1.061822             3.7              14
--------------------------------------------------------------------------

. table cohort, stat(mean hba1c) stat(sd hba1c) stat(min hba1c) stat(max hba1c) stat(semean hba1c)

-------------------------------------------------------------------------------------------------------
          |      Mean   Standard deviation   Minimum value   Maximum value   Standard error of the mean
----------+--------------------------------------------------------------------------------------------
Cohort    |                                                                                            
  DIVIDS  |  5.260367             .3200266             4.1             6.2                     .0176975
  SAM     |  5.316327             .6520311               4             7.9                     .0931473
  CICADA  |  5.924166             .9170056               4            10.9                     .0335067
  NUSTART |  5.548636             1.183967               4              14                     .0798231
  STATT   |  5.453625              1.63118             3.7            12.8                     .1052922
  CLHNS   |  5.844698             1.122073            3.74            12.7                     .0736677
  Total   |  5.670545             1.061822             3.7              14                       .02491
-------------------------------------------------------------------------------------------------------

. table cohort, stat(mean hba1c) stat(sd hba1c) stat(min hba1c) stat(max hba1c) stat(semean hba1c) totals
option totals not allowed
r(198);

. collect clear

. sum hba1c

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |      1,817    5.670545    1.061822        3.7         14

. results list
command results is unrecognized
r(199);

. result list
command result is unrecognized
r(199);

. sum hba1c

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       hba1c |      1,817    5.670545    1.061822        3.7         14

. return list

scalars:
                  r(N) =  1817
              r(sum_w) =  1817
               r(mean) =  5.670544858023434
                r(Var) =  1.127465716359807
                 r(sd) =  1.061821885421377
                r(min) =  3.700000047683716
                r(max) =  14
                r(sum) =  10303.38000702858

. sum hba1c, detail

        Hba1c result [%] from baseline sample In OGTT
-------------------------------------------------------------
      Percentiles      Smallest
 1%          4.1            3.7
 5%          4.5           3.74
10%          4.7           3.95       Obs               1,817
25%          5.1              4       Sum of wgt.       1,817

50%          5.5                      Mean           5.670545
                        Largest       Std. dev.      1.061822
75%            6           12.3
90%          6.8           12.7       Variance       1.127466
95%          7.5           12.8       Skewness       2.372051
99%         10.1             14       Kurtosis       12.75621

. exit, clear
