
. capture cmdlog using "/Users/juansolon/Documents/GitHub/sampa-analysis/jscmd
> .txt", replace

. 
. * Set up directory global macros
. global github = "~/Documents/GitHub"

. *global gshared = "~/Google Drive/Shared drives/"
. *global gmydrive = "~/Google Drive/My Drive/"
. global sampaanalysis = "$github/sampa-analysis/"

. * global dropboxsampa = "~/Cox working group Dropbox/TB Nutrition working gr
> oup/SAMPA"
. 
end of do-file

. pwd
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DA
> TA monitoring/Data/SAMPA

. ls

total 38704
-rw-r--r--@ 1 juansolon  staff      182 Oct 18  2022 00 READ ME.txt
-rw-r--r--@ 1 juansolon  staff    11829 Jul  7 07:33 01 FILE VERSION HISTORY.d
> ocx
-rw-r--r--@ 1 juansolon  staff  1580715 Jul  7 07:43 All_CRF14_Computed_tomogr
> aphy_CT_scans.dta
-rw-r--r--@ 1 juansolon  staff  1096328 Jul  7 07:43 All_Crf10_Referral.dta
-rw-r--r--@ 1 juansolon  staff   531534 Jul  7 07:43 All_Crf11a_Urine_And_Fece
> s_Collection.dta
-rw-r--r--@ 1 juansolon  staff   549458 Jul  7 07:43 All_Crf11b_Urine_And_Fece
> s_Results.dta
-rw-r--r--@ 1 juansolon  staff   588384 Jul  7 07:43 All_Crf12_Diet.dta
-rw-r--r--@ 1 juansolon  staff   922332 Jul  7 07:43 All_Crf2_demography_and_s
> es.dta
-rw-r--r--@ 1 juansolon  staff  2705959 Jul  7 07:43 All_Crf3_Clinical_History
> _And_Exam.dta
-rw-r--r--@ 1 juansolon  staff  3971173 Jul  7 07:43 All_Crf4a_Blood_Sampling_
> And_Processing.dta
-rw-r--r--@ 1 juansolon  staff   563675 Jul  7 07:43 All_Crf4b_Repeat_Ogtt.dta
-rw-r--r--@ 1 juansolon  staff   376858 Jul  7 07:43 All_Crf5_More_Blood_Test_
> Results.dta
-rw-r--r--@ 1 juansolon  staff   962700 Jul  7 07:43 All_Crf6_Anthropometry.dt
> a
-rw-r--r--@ 1 juansolon  staff   484537 Jul  7 07:43 All_Crf7_Body_Composition
> .dta
-rw-r--r--@ 1 juansolon  staff  1002018 Jul  7 07:43 All_cohort_tracing.dta
-rw-r--r--@ 1 juansolon  staff  1703744 Jul  7 07:43 All_crf13_Abdomen_Uss.dta
-rw-r--r--@ 1 juansolon  staff   306168 Jul  7 07:43 All_crf1_eligibility_cons
> ent.dta
-rw-r--r--@ 1 juansolon  staff  1125555 Jul  7 07:43 All_ivgtt.dta
-rw-r--r--@ 4 juansolon  staff        0 Jul 11 20:24 Icon

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. 
. 
. /* local macros for filenames */
. local crf0 "All_cohort_tracing.dta"

. local crf1 "All_crf1_eligibility_consent.dta"

. local crf2 "All_Crf2_demography_and_ses.dta"

. local crf3 "All_Crf3_Clinical_History_And_Exam.dta"

. local crf4a "All_Crf4a_Blood_Sampling_And_Processing.dta"

. local crf4b "All_Crf4b_Repeat_Ogtt.dta"

. local crf5 "All_Crf5_More_Blood_Test_Results.dta"

. local crf6 "All_Crf6_Anthropometry.dta"

. local crf7 "All_Crf7_Body_Composition.dta"

. local crf8 "x"

. local crf9 "y"

. local crf10 "All_Crf10_Referral.dta"

. local crf11a "All_Crf11a_Urine_And_Feces_Collection.dta"

. local crf11b "All_Crf11b_Urine_And_Feces_Results.dta"

. local crf12 "All_Crf12_Diet.dta"

. local crf13 "All_crf13_Abdomen_Uss.dta"

. local crf14 "All_CRF14_Computed_tomography_CT_scans.dta"

. local crfivgtt"All_ivgtt.dta"

. 
. /* Merge Datasets */
. use `crf0'

. 
.         merge 1:1 sampa_id using `crf1'
(label sex already defined)
(label cohort already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           577
        from master                       577  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             2,302  (_merge==3)
    -----------------------------------------

.                 drop _merge

.         merge 1:1 sampa_id using `crf2'
(label cohort already defined)
(label sex already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           577
        from master                       577  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             2,302  (_merge==3)
    -----------------------------------------

.                 drop _merge

.         merge 1:1 sampa_id using `crf6'
(label sex already defined)
(label cohort already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           577
        from master                       577  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             2,302  (_merge==3)
    -----------------------------------------

.                 drop _merge

.         merge 1:1 sampa_id using `crf13'
(label cohort already defined)
(label sex already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           577
        from master                       577  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             2,302  (_merge==3)
    -----------------------------------------

.                 drop _merge

.         merge 1:1 sampa_id using `crf14'
(label cohort already defined)
(label sex already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           577
        from master                       577  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             2,302  (_merge==3)
    -----------------------------------------

.                 drop _merge

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. cd $github
/Users/juansolon/Documents/GitHub

. 
end of do-file

. pwd
/Users/juansolon/Documents/GitHub

. ls

total 0
drwxr-xr-x@  7 juansolon  staff   224 May 19  2021 Best-README-Template/
drwxr-xr-x@  7 juansolon  staff   224 Apr 30  2021 HR-Policies-and-Procedures/
drwxr-xr-x   3 juansolon  staff    96 May 21  2021 Nutri-Pan/
drwxr-xr-x@ 13 juansolon  staff   416 Dec 18  2021 SAMPA/
drwxr-xr-x   4 juansolon  staff   128 Apr 27  2021 UNICEF-KOICA/
drwxr-xr-x@  5 juansolon  staff   160 May 19  2021 UNICEF-Ow-Ob/
drwxr-xr-x   4 juansolon  staff   128 Dec  8  2021 data-opt/
drwxr-xr-x   4 juansolon  staff   128 Mar  8  2021 desktop-tutorial/
drwxr-xr-x@ 13 juansolon  staff   416 Apr 29  2021 document-mgmt-1/
drwxr-xr-x   4 juansolon  staff   128 Nov 30  2021 elabftw/
drwxr-xr-x   3 juansolon  staff    96 Nov  9  2021 gcloud/
drwxr-xr-x@ 29 juansolon  staff   928 Jul 14  2021 igrowup_update/
drwxr-xr-x   5 juansolon  staff   160 Dec 14  2021 my-project/
drwxr-xr-x   8 juansolon  staff   256 Mar 30  2021 ncp/
drwxr-xr-x@  7 juansolon  staff   224 Mar  8  2021 ncp-annual-reports/
drwxr-xr-x  10 juansolon  staff   320 Mar  9  2021 ncp-company-policies/
drwxr-xr-x@  5 juansolon  staff   160 Apr 27  2021 ncp-github/
drwxr-xr-x  11 juansolon  staff   352 Dec 16  2022 nsip/
drwxr-xr-x   6 juansolon  staff   192 Dec 21  2021 odk-central-do/
drwxr-xr-x@  6 juansolon  staff   192 Dec  2  2021 opendata/
drwxr-xr-x@  6 juansolon  staff   192 May 21  2021 pnfc_analytics-main/
drwxr-xr-x   3 juansolon  staff    96 Nov  5  2021 py-covid19/
drwxr-xr-x   9 juansolon  staff   288 Nov 23  2021 r-covid/
drwxr-xr-x   8 juansolon  staff   256 Mar 14 14:27 r-notes/
drwxr-xr-x@  9 juansolon  staff   288 May 19  2021 random-notes/
drwxr-xr-x  40 juansolon  staff  1280 Jul 25 13:16 sampa-analysis/
drwxr-xr-x@  9 juansolon  staff   288 Apr 29  2021 sampa-dmplan/
drwxr-xr-x@ 39 juansolon  staff  1248 Feb  1 07:53 sampa-mwanza/
drwxr-xr-x@  5 juansolon  staff   160 Apr 29  2021 sampa-public/
drwxr-xr-x  10 juansolon  staff   320 May  2  2021 sampa-redcap/
drwxr-xr-x@ 10 juansolon  staff   320 Dec 15  2021 senaite/
drwxr-xr-x   8 juansolon  staff   256 Dec 15  2021 st-att change manuscript/
drwxr-xr-x@ 10 juansolon  staff   320 Dec  5  2022 st-att-lab/
drwxr-xr-x   7 juansolon  staff   224 Jul 25 13:05 stata-templates/
drwxr-xr-x@ 11 juansolon  staff   352 Mar 16  2021 statt-ffups/
drwxr-xr-x@  8 juansolon  staff   256 Mar 19  2021 statt-ffups2/
drwxr-xr-x@ 12 juansolon  staff   384 Jul  4 07:09 support/
drwxr-xr-x   3 juansolon  staff    96 May  1  2021 terminal/
drwxr-xr-x   4 juansolon  staff   128 Nov 27  2021 using-Terminal/
drwxr-xr-x@  5 juansolon  staff   160 May 22  2021 using-github-ncp/

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. cd sampa-analysis
/Users/juansolon/Documents/GitHub/sampa-analysis

. 
end of do-file

. ls

total 18088
drwxr-xr-x  3 juansolon  staff       96 Jul 25 13:03 01-data-delivered/
drwxr-xr-x  8 juansolon  staff      256 Jul 25 13:03 02-data-temp/
drwxr-xr-x  4 juansolon  staff      128 Jul 25 13:03 03-tables/
-rw-r--r--  1 juansolon  staff       77 Jul 25 13:03 README.md
-rw-r--r--  1 juansolon  staff  2453320 Jul 25 13:03 adverse.dta
-rw-r--r--  1 juansolon  staff     7865 Jul 25 13:03 childhoodBPpercentiles_fi
> nal.do
-rw-r--r--  1 juansolon  staff      381 Jul 25 13:03 cr-pdf.do
-rw-r--r--  1 juansolon  staff     5418 Jul 25 13:03 cr-sampa-radio.do
-rw-r--r--  1 juansolon  staff     1837 Jul 25 13:03 cr-sampa-radio2.do
-rw-r--r--  1 juansolon  staff     3804 Jul 25 13:03 cr-sampa-radio3.do
-rw-r--r--  1 juansolon  staff     1726 Jul 25 13:03 cr_adverse.do
-rw-r--r--  1 juansolon  staff     5284 Jul 25 13:03 cr_alldata.do
-rw-r--r--  1 juansolon  staff     3813 Jul 25 13:03 cr_phsamples.do
-rw-r--r--  1 juansolon  staff     3813 Jul 25 13:03 cr_sampa_crf_13_14_recode
> .do
-rw-r--r--  1 juansolon  staff     1105 Jul 25 13:03 example3.html
-rw-r--r--  1 juansolon  staff      525 Jul 25 13:03 example3.txt
-rw-r--r--  1 juansolon  staff    18710 Jul 25 13:03 graph.svg
-rw-r--r--  1 juansolon  staff      271 Jul 25 13:03 hpn-child
-rw-r--r--  1 juansolon  staff      227 Jul 25 13:18 jscmd.txt
-rw-r--r--  1 juansolon  staff     8579 Jul 25 13:18 jslog.txt
-rw-r--r--  1 juansolon  staff     5402 Jul 25 13:03 radio1.doc
drwxr-xr-x  6 juansolon  staff      192 Jul 25 13:03 references/
-rw-r--r--  1 juansolon  staff     3641 Jul 25 13:03 report-adverse.html
-rw-r--r--  1 juansolon  staff     5205 Jul 25 13:03 report-adverse.txt
drwxr-xr-x  8 juansolon  staff      256 Jul 25 13:03 sampa notes/
-rw-r--r--  1 juansolon  staff  5680710 Jul 25 13:03 sampa-all.dta
-rw-r--r--  1 juansolon  staff   354069 Jul 25 13:03 sampa_data_dictionary_par
> t1.csv
-rw-r--r--  1 juansolon  staff     5359 Jul 25 13:03 samparadio1-b.pdf
-rw-r--r--  1 juansolon  staff     8794 Jul 25 13:03 samparadio1.docx
-rw-r--r--  1 juansolon  staff    34932 Jul 25 13:03 samparadio1.html
-rw-r--r--  1 juansolon  staff     2820 Jul 25 13:03 samparadio1.pdf
-rw-r--r--  1 juansolon  staff     8601 Jul 25 13:03 samparadio2.docx
-rw-r--r--  1 juansolon  staff     4192 Jul 25 13:03 samparadio2.pdf
-rw-r--r--  1 juansolon  staff      118 Jul 25 13:03 statt-sampa.md
-rwxr-xr-x  1 juansolon  staff   559027 Jul 25 13:03 statt-site.key*

. pwd
/Users/juansolon/Documents/GitHub/sampa-analysis

. ls

total 18088
drwxr-xr-x  3 juansolon  staff       96 Jul 25 13:03 01-data-delivered/
drwxr-xr-x  8 juansolon  staff      256 Jul 25 13:03 02-data-temp/
drwxr-xr-x  4 juansolon  staff      128 Jul 25 13:03 03-tables/
-rw-r--r--  1 juansolon  staff       77 Jul 25 13:03 README.md
-rw-r--r--  1 juansolon  staff  2453320 Jul 25 13:03 adverse.dta
-rw-r--r--  1 juansolon  staff     7865 Jul 25 13:03 childhoodBPpercentiles_fi
> nal.do
-rw-r--r--  1 juansolon  staff      381 Jul 25 13:03 cr-pdf.do
-rw-r--r--  1 juansolon  staff     5418 Jul 25 13:03 cr-sampa-radio.do
-rw-r--r--  1 juansolon  staff     1837 Jul 25 13:03 cr-sampa-radio2.do
-rw-r--r--  1 juansolon  staff     3804 Jul 25 13:03 cr-sampa-radio3.do
-rw-r--r--  1 juansolon  staff     1726 Jul 25 13:03 cr_adverse.do
-rw-r--r--  1 juansolon  staff     5284 Jul 25 13:03 cr_alldata.do
-rw-r--r--  1 juansolon  staff     3813 Jul 25 13:03 cr_phsamples.do
-rw-r--r--  1 juansolon  staff     3813 Jul 25 13:03 cr_sampa_crf_13_14_recode
> .do
-rw-r--r--  1 juansolon  staff     1105 Jul 25 13:03 example3.html
-rw-r--r--  1 juansolon  staff      525 Jul 25 13:03 example3.txt
-rw-r--r--  1 juansolon  staff    18710 Jul 25 13:03 graph.svg
-rw-r--r--  1 juansolon  staff      271 Jul 25 13:03 hpn-child
-rw-r--r--  1 juansolon  staff      234 Jul 25 13:42 jscmd.txt
-rw-r--r--  1 juansolon  staff    11075 Jul 25 13:42 jslog.txt
-rw-r--r--  1 juansolon  staff     5402 Jul 25 13:03 radio1.doc
drwxr-xr-x  6 juansolon  staff      192 Jul 25 13:03 references/
-rw-r--r--  1 juansolon  staff     3641 Jul 25 13:03 report-adverse.html
-rw-r--r--  1 juansolon  staff     5205 Jul 25 13:03 report-adverse.txt
drwxr-xr-x  8 juansolon  staff      256 Jul 25 13:03 sampa notes/
-rw-r--r--  1 juansolon  staff  5680710 Jul 25 13:03 sampa-all.dta
-rw-r--r--  1 juansolon  staff   354069 Jul 25 13:03 sampa_data_dictionary_par
> t1.csv
-rw-r--r--  1 juansolon  staff     5359 Jul 25 13:03 samparadio1-b.pdf
-rw-r--r--  1 juansolon  staff     8794 Jul 25 13:03 samparadio1.docx
-rw-r--r--  1 juansolon  staff    34932 Jul 25 13:03 samparadio1.html
-rw-r--r--  1 juansolon  staff     2820 Jul 25 13:03 samparadio1.pdf
-rw-r--r--  1 juansolon  staff     8601 Jul 25 13:03 samparadio2.docx
-rw-r--r--  1 juansolon  staff     4192 Jul 25 13:03 samparadio2.pdf
-rw-r--r--  1 juansolon  staff      118 Jul 25 13:03 statt-sampa.md
-rwxr-xr-x  1 juansolon  staff   559027 Jul 25 13:03 statt-site.key*

. pwd
/Users/juansolon/Documents/GitHub/sampa-analysis

. ls

total 17896
drwxr-xr-x   3 juansolon  staff       96 Jul 25 13:03 01-data-delivered/
drwxr-xr-x   8 juansolon  staff      256 Jul 25 13:03 02-data-temp/
drwxr-xr-x   4 juansolon  staff      128 Jul 25 13:03 03-tables/
drwxr-xr-x  11 juansolon  staff      352 Jul 25 13:43 04-do/
drwxr-xr-x   2 juansolon  staff       64 Jul 25 13:45 05-figures/
drwxr-xr-x   4 juansolon  staff      128 Jul 25 13:47 06-results/
-rw-r--r--   1 juansolon  staff       77 Jul 25 13:03 README.md
-rw-r--r--   1 juansolon  staff  2453320 Jul 25 13:03 adverse.dta
-rw-r--r--   1 juansolon  staff      241 Jul 25 13:48 jscmd.txt
-rw-r--r--   1 juansolon  staff    13571 Jul 25 13:48 jslog.txt
drwxr-xr-x   6 juansolon  staff      192 Jul 25 13:03 references/
drwxr-xr-x   8 juansolon  staff      256 Jul 25 13:03 sampa notes/
-rw-r--r--   1 juansolon  staff  5680710 Jul 25 13:03 sampa-all.dta
-rw-r--r--   1 juansolon  staff   354069 Jul 25 13:03 sampa_data_dictionary_pa
> rt1.csv
-rw-r--r--@  1 juansolon  staff     5359 Jul 25 13:03 samparadio1-b.pdf
-rw-r--r--   1 juansolon  staff     8794 Jul 25 13:03 samparadio1.docx
-rw-r--r--   1 juansolon  staff    34932 Jul 25 13:03 samparadio1.html
-rw-r--r--@  1 juansolon  staff     2820 Jul 25 13:03 samparadio1.pdf
-rw-r--r--   1 juansolon  staff     8601 Jul 25 13:03 samparadio2.docx
-rw-r--r--   1 juansolon  staff     4192 Jul 25 13:03 samparadio2.pdf
-rw-r--r--   1 juansolon  staff      118 Jul 25 13:03 statt-sampa.md
-rwxr-xr-x@  1 juansolon  staff   559027 Jul 25 13:03 statt-site.key*

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable age i.sex i.agree , by(cohort)

--------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                   Study cohort                                               
                                                       DIVIDS       SAM Lusaka        CICADA     NUSTART Lusaka      St-ATT          CLHNS          Total     
--------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                     342 (11.9%)      98 (3.4%)     978 (34.0%)    302 (10.5%)     685 (23.8%)    474 (16.5%)  2,879 (100.0%)
Age (years)                                        14.292 (1.257) 12.990 (1.615) 48.165 (11.186) 44.278 (9.734) 49.470 (16.752) 39.431 (0.560) 41.404 (16.334)
[2.2] Participant's sex                                                                                                                                       
  Male                                                169 (49.4%)     49 (50.0%)     407 (41.6%)    105 (34.8%)     492 (71.8%)    304 (64.1%)   1,526 (53.0%)
  Female                                              173 (50.6%)     49 (50.0%)     571 (58.4%)    197 (65.2%)     193 (28.2%)    170 (35.9%)   1,353 (47.0%)
Did the participant agree to join the SAMPA study?                                                                                                            
  No, they do not agree                                  0 (0.0%)       0 (0.0%)        1 (0.1%)       0 (0.0%)     167 (24.4%)    122 (28.0%)     290 (10.2%)
  Yes, they agree                                    342 (100.0%)    98 (100.0%)     977 (99.9%)   302 (100.0%)     275 (40.1%)    308 (70.8%)   2,302 (81.1%)
  Unable to contact participant                          0 (0.0%)       0 (0.0%)        0 (0.0%)       0 (0.0%)     195 (28.5%)       5 (1.1%)      200 (7.0%)
  4                                                      0 (0.0%)       0 (0.0%)        0 (0.0%)       0 (0.0%)       48 (7.0%)       0 (0.0%)       48 (1.7%)
--------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. tab sex agree if cohort > 4

     [2.2] | Did the participant agree to join the SAMPA
Participan |                   study?
   t's sex | No, they   Yes, they  Unable to          4 |     Total
-----------+--------------------------------------------+----------
      Male |       195        387        150         38 |       770 
    Female |        94        196         50         10 |       350 
-----------+--------------------------------------------+----------
     Total |       289        583        200         48 |     1,120 

. label list agree
agree:
           0 No, they do not agree
           1 Yes, they agree
           2 Unable to contact participant
           3 Undecided

. pwd
/Users/juansolon/Documents/GitHub/sampa-analysis

. ls

total 17904
drwxr-xr-x   3 juansolon  staff       96 Jul 25 13:03 01-data-delivered/
drwxr-xr-x   8 juansolon  staff      256 Jul 25 13:03 02-data-temp/
drwxr-xr-x   4 juansolon  staff      128 Jul 25 13:03 03-tables/
drwxr-xr-x  13 juansolon  staff      416 Jul 25 13:49 04-do/
drwxr-xr-x   2 juansolon  staff       64 Jul 25 13:45 05-figures/
drwxr-xr-x   4 juansolon  staff      128 Jul 25 13:47 06-results/
-rw-r--r--   1 juansolon  staff       77 Jul 25 13:03 README.md
-rw-r--r--   1 juansolon  staff  2453320 Jul 25 13:03 adverse.dta
-rw-r--r--   1 juansolon  staff      363 Jul 25 13:58 jscmd.txt
-rw-r--r--   1 juansolon  staff    18371 Jul 25 13:58 jslog.txt
drwxr-xr-x   6 juansolon  staff      192 Jul 25 13:03 references/
drwxr-xr-x   8 juansolon  staff      256 Jul 25 13:03 sampa notes/
-rw-r--r--   1 juansolon  staff  5680710 Jul 25 13:03 sampa-all.dta
-rw-r--r--   1 juansolon  staff   354069 Jul 25 13:03 sampa_data_dictionary_part1.csv
-rw-r--r--@  1 juansolon  staff     5359 Jul 25 13:03 samparadio1-b.pdf
-rw-r--r--   1 juansolon  staff     8794 Jul 25 13:03 samparadio1.docx
-rw-r--r--   1 juansolon  staff    34932 Jul 25 13:03 samparadio1.html
-rw-r--r--@  1 juansolon  staff     2820 Jul 25 13:03 samparadio1.pdf
-rw-r--r--   1 juansolon  staff     8601 Jul 25 13:03 samparadio2.docx
-rw-r--r--   1 juansolon  staff     4192 Jul 25 13:03 samparadio2.pdf
-rw-r--r--   1 juansolon  staff      118 Jul 25 13:03 statt-sampa.md
-rwxr-xr-x@  1 juansolon  staff   559027 Jul 25 13:03 statt-site.key*

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. cd 03-tables
/Users/juansolon/Documents/GitHub/sampa-analysis/03-tables

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable age i.sex i.agree , by(cohort) ///
> title("Consent, by cohort") ///
> export(agree)

Consent, by cohort
--------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                   Study cohort                                               
                                                       DIVIDS       SAM Lusaka        CICADA     NUSTART Lusaka      St-ATT          CLHNS          Total     
--------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                     342 (11.9%)      98 (3.4%)     978 (34.0%)    302 (10.5%)     685 (23.8%)    474 (16.5%)  2,879 (100.0%)
Age (years)                                        14.292 (1.257) 12.990 (1.615) 48.165 (11.186) 44.278 (9.734) 49.470 (16.752) 39.431 (0.560) 41.404 (16.334)
[2.2] Participant's sex                                                                                                                                       
  Male                                                169 (49.4%)     49 (50.0%)     407 (41.6%)    105 (34.8%)     492 (71.8%)    304 (64.1%)   1,526 (53.0%)
  Female                                              173 (50.6%)     49 (50.0%)     571 (58.4%)    197 (65.2%)     193 (28.2%)    170 (35.9%)   1,353 (47.0%)
Did the participant agree to join the SAMPA study?                                                                                                            
  No, they do not agree                                  0 (0.0%)       0 (0.0%)        1 (0.1%)       0 (0.0%)     167 (24.4%)    122 (28.0%)     290 (10.2%)
  Yes, they agree                                    342 (100.0%)    98 (100.0%)     977 (99.9%)   302 (100.0%)     275 (40.1%)    308 (70.8%)   2,302 (81.1%)
  Unable to contact participant                          0 (0.0%)       0 (0.0%)        0 (0.0%)       0 (0.0%)     195 (28.5%)       5 (1.1%)      200 (7.0%)
  4                                                      0 (0.0%)       0 (0.0%)        0 (0.0%)       0 (0.0%)       48 (7.0%)       0 (0.0%)       48 (1.7%)
--------------------------------------------------------------------------------------------------------------------------------------------------------------
option as() required; could not determine filetype from filename
r(198);

end of do-file

r(198);

. help dtable

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable age i.sex i.agree , by(cohort) ///
> title("Consent, by cohort") ///
> export(agree.pdf ,as(pdf))

Consent, by cohort
--------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                   Study cohort                                               
                                                       DIVIDS       SAM Lusaka        CICADA     NUSTART Lusaka      St-ATT          CLHNS          Total     
--------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                     342 (11.9%)      98 (3.4%)     978 (34.0%)    302 (10.5%)     685 (23.8%)    474 (16.5%)  2,879 (100.0%)
Age (years)                                        14.292 (1.257) 12.990 (1.615) 48.165 (11.186) 44.278 (9.734) 49.470 (16.752) 39.431 (0.560) 41.404 (16.334)
[2.2] Participant's sex                                                                                                                                       
  Male                                                169 (49.4%)     49 (50.0%)     407 (41.6%)    105 (34.8%)     492 (71.8%)    304 (64.1%)   1,526 (53.0%)
  Female                                              173 (50.6%)     49 (50.0%)     571 (58.4%)    197 (65.2%)     193 (28.2%)    170 (35.9%)   1,353 (47.0%)
Did the participant agree to join the SAMPA study?                                                                                                            
  No, they do not agree                                  0 (0.0%)       0 (0.0%)        1 (0.1%)       0 (0.0%)     167 (24.4%)    122 (28.0%)     290 (10.2%)
  Yes, they agree                                    342 (100.0%)    98 (100.0%)     977 (99.9%)   302 (100.0%)     275 (40.1%)    308 (70.8%)   2,302 (81.1%)
  Unable to contact participant                          0 (0.0%)       0 (0.0%)        0 (0.0%)       0 (0.0%)     195 (28.5%)       5 (1.1%)      200 (7.0%)
  4                                                      0 (0.0%)       0 (0.0%)        0 (0.0%)       0 (0.0%)       48 (7.0%)       0 (0.0%)       48 (1.7%)
--------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. pwd
/Users/juansolon/Documents/GitHub/sampa-analysis/03-tables

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. cd 03-tables
unable to change to 03-tables
r(170);

end of do-file

r(170);

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable age i.sex i.agree , by(cohort) ///
> title("Consent, by cohort") ///
> export(agree.pdf ,as(pdf) replace)

Consent, by cohort
--------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                   Study cohort                                               
                                                       DIVIDS       SAM Lusaka        CICADA     NUSTART Lusaka      St-ATT          CLHNS          Total     
--------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                     342 (11.9%)      98 (3.4%)     978 (34.0%)    302 (10.5%)     685 (23.8%)    474 (16.5%)  2,879 (100.0%)
Age (years)                                        14.292 (1.257) 12.990 (1.615) 48.165 (11.186) 44.278 (9.734) 49.470 (16.752) 39.431 (0.560) 41.404 (16.334)
[2.2] Participant's sex                                                                                                                                       
  Male                                                169 (49.4%)     49 (50.0%)     407 (41.6%)    105 (34.8%)     492 (71.8%)    304 (64.1%)   1,526 (53.0%)
  Female                                              173 (50.6%)     49 (50.0%)     571 (58.4%)    197 (65.2%)     193 (28.2%)    170 (35.9%)   1,353 (47.0%)
Did the participant agree to join the SAMPA study?                                                                                                            
  No, they do not agree                                  0 (0.0%)       0 (0.0%)        1 (0.1%)       0 (0.0%)     167 (24.4%)    122 (28.0%)     290 (10.2%)
  Yes, they agree                                    342 (100.0%)    98 (100.0%)     977 (99.9%)   302 (100.0%)     275 (40.1%)    308 (70.8%)   2,302 (81.1%)
  Unable to contact participant                          0 (0.0%)       0 (0.0%)        0 (0.0%)       0 (0.0%)     195 (28.5%)       5 (1.1%)      200 (7.0%)
  4                                                      0 (0.0%)       0 (0.0%)        0 (0.0%)       0 (0.0%)       48 (7.0%)       0 (0.0%)       48 (1.7%)
--------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. d preg*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
preg_test       byte    %48.0g     preg_test
                                              [1.12] Is the person willing to have a pregnancy test in order to determine elig
preg_result     byte    %57.0g     preg_result
                                              Pregnancy test results

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable age i.sex i.agree i.preg_test i.preg_result , by(cohort) ///
> title("Consent, by cohort") ///
> export(agree.pdf ,as(pdf) replace)

Consent, by cohort
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                                 Study cohort                                               
                                                                                     DIVIDS       SAM Lusaka        CICADA     NUSTART Lusaka      St-ATT          CLHNS          Total     
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                                                   342 (11.9%)      98 (3.4%)     978 (34.0%)    302 (10.5%)     685 (23.8%)    474 (16.5%)  2,879 (100.0%)
Age (years)                                                                      14.292 (1.257) 12.990 (1.615) 48.165 (11.186) 44.278 (9.734) 49.470 (16.752) 39.431 (0.560) 41.404 (16.334)
[2.2] Participant's sex                                                                                                                                                                     
  Male                                                                              169 (49.4%)     49 (50.0%)     407 (41.6%)    105 (34.8%)     492 (71.8%)    304 (64.1%)   1,526 (53.0%)
  Female                                                                            173 (50.6%)     49 (50.0%)     571 (58.4%)    197 (65.2%)     193 (28.2%)    170 (35.9%)   1,353 (47.0%)
Did the participant agree to join the SAMPA study?                                                                                                                                          
  No, they do not agree                                                                0 (0.0%)       0 (0.0%)        1 (0.1%)       0 (0.0%)     167 (24.4%)    122 (28.0%)     290 (10.2%)
  Yes, they agree                                                                  342 (100.0%)    98 (100.0%)     977 (99.9%)   302 (100.0%)     275 (40.1%)    308 (70.8%)   2,302 (81.1%)
  Unable to contact participant                                                        0 (0.0%)       0 (0.0%)        0 (0.0%)       0 (0.0%)     195 (28.5%)       5 (1.1%)      200 (7.0%)
  4                                                                                    0 (0.0%)       0 (0.0%)        0 (0.0%)       0 (0.0%)       48 (7.0%)       0 (0.0%)       48 (1.7%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                                            
  No, is male                                                                            0 (.%)         0 (.%)     403 (41.2%)    105 (34.8%)     190 (69.1%)    197 (64.0%)     895 (48.1%)
  No, is female, and says they are post-menopausal                                       0 (.%)         0 (.%)     215 (22.0%)     39 (12.9%)      39 (14.2%)       0 (0.0%)     293 (15.7%)
  No, since they already know they are pregnant                                          0 (.%)         0 (.%)        4 (0.4%)       1 (0.3%)        1 (0.4%)       1 (0.3%)        7 (0.4%)
  Yes, will agree to test                                                                0 (.%)         0 (.%)     351 (35.9%)    157 (52.0%)      45 (16.4%)    110 (35.7%)     663 (35.6%)
  5                                                                                      0 (.%)         0 (.%)        4 (0.4%)       0 (0.0%)        0 (0.0%)       0 (0.0%)        4 (0.2%)
Pregnancy test results                                                                                                                                                                      
  has documented negative pregnancy test performed by SAMPA                              0 (.%)         0 (.%)     340 (96.9%)    155 (98.1%)      44 (97.8%)    109 (99.1%)     648 (97.6%)
  has documented positive pregnancy test                                                 0 (.%)         0 (.%)       11 (3.1%)       3 (1.9%)        1 (2.2%)       1 (0.9%)       16 (2.4%)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable age i.sex i.agree i.preg_test i.preg_result , by(cohort) ///
> title("Consent, by cohort") ///
> export(agree.html ,as(html) replace)

Consent, by cohort
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                                 Study cohort                                               
                                                                                     DIVIDS       SAM Lusaka        CICADA     NUSTART Lusaka      St-ATT          CLHNS          Total     
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                                                   342 (11.9%)      98 (3.4%)     978 (34.0%)    302 (10.5%)     685 (23.8%)    474 (16.5%)  2,879 (100.0%)
Age (years)                                                                      14.292 (1.257) 12.990 (1.615) 48.165 (11.186) 44.278 (9.734) 49.470 (16.752) 39.431 (0.560) 41.404 (16.334)
[2.2] Participant's sex                                                                                                                                                                     
  Male                                                                              169 (49.4%)     49 (50.0%)     407 (41.6%)    105 (34.8%)     492 (71.8%)    304 (64.1%)   1,526 (53.0%)
  Female                                                                            173 (50.6%)     49 (50.0%)     571 (58.4%)    197 (65.2%)     193 (28.2%)    170 (35.9%)   1,353 (47.0%)
Did the participant agree to join the SAMPA study?                                                                                                                                          
  No, they do not agree                                                                0 (0.0%)       0 (0.0%)        1 (0.1%)       0 (0.0%)     167 (24.4%)    122 (28.0%)     290 (10.2%)
  Yes, they agree                                                                  342 (100.0%)    98 (100.0%)     977 (99.9%)   302 (100.0%)     275 (40.1%)    308 (70.8%)   2,302 (81.1%)
  Unable to contact participant                                                        0 (0.0%)       0 (0.0%)        0 (0.0%)       0 (0.0%)     195 (28.5%)       5 (1.1%)      200 (7.0%)
  4                                                                                    0 (0.0%)       0 (0.0%)        0 (0.0%)       0 (0.0%)       48 (7.0%)       0 (0.0%)       48 (1.7%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                                            
  No, is male                                                                            0 (.%)         0 (.%)     403 (41.2%)    105 (34.8%)     190 (69.1%)    197 (64.0%)     895 (48.1%)
  No, is female, and says they are post-menopausal                                       0 (.%)         0 (.%)     215 (22.0%)     39 (12.9%)      39 (14.2%)       0 (0.0%)     293 (15.7%)
  No, since they already know they are pregnant                                          0 (.%)         0 (.%)        4 (0.4%)       1 (0.3%)        1 (0.4%)       1 (0.3%)        7 (0.4%)
  Yes, will agree to test                                                                0 (.%)         0 (.%)     351 (35.9%)    157 (52.0%)      45 (16.4%)    110 (35.7%)     663 (35.6%)
  5                                                                                      0 (.%)         0 (.%)        4 (0.4%)       0 (0.0%)        0 (0.0%)       0 (0.0%)        4 (0.2%)
Pregnancy test results                                                                                                                                                                      
  has documented negative pregnancy test performed by SAMPA                              0 (.%)         0 (.%)     340 (96.9%)    155 (98.1%)      44 (97.8%)    109 (99.1%)     648 (97.6%)
  has documented positive pregnancy test                                                 0 (.%)         0 (.%)       11 (3.1%)       3 (1.9%)        1 (2.2%)       1 (0.9%)       16 (2.4%)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.html)

. 
end of do-file

. graph use "/Users/juansolon/Downloads/recruitment over time.gph"

. graph use "/Users/juansolon/Downloads/recruitment over time.gph"

. help wordcb

. table cohort agree

--------------------------------------------------------------------------------------------------------
                 |                   Did the participant agree to join the SAMPA study?                 
                 |  No, they do not agree   Yes, they agree   Unable to contact participant    4   Total
-----------------+--------------------------------------------------------------------------------------
Study cohort     |                                                                                      
  DIVIDS         |                                      342                                          342
  SAM Lusaka     |                                       98                                           98
  CICADA         |                      1               977                                          978
  NUSTART Lusaka |                                      302                                          302
  St-ATT         |                    167               275                             195   48     685
  CLHNS          |                    122               308                               5          435
  Total          |                    290             2,302                             200   48   2,840
--------------------------------------------------------------------------------------------------------

. table agree cohort, statistic(frequency sex)
statistic frequency incorrectly specified; varlist not allowed
r(100);

. table agree cohort, statistic(freq sex)
statistic freq incorrectly specified; varlist not allowed
r(100);

. table agree cohort, statistic(freq)

----------------------------------------------------------------------------------------------------------------------------
                                                   |                               Study cohort                             
                                                   |  DIVIDS   SAM Lusaka   CICADA   NUSTART Lusaka   St-ATT   CLHNS   Total
---------------------------------------------------+------------------------------------------------------------------------
Did the participant agree to join the SAMPA study? |                                                                        
  No, they do not agree                            |                             1                       167     122     290
  Yes, they agree                                  |     342           98      977              302      275     308   2,302
  Unable to contact participant                    |                                                     195       5     200
  4                                                |                                                      48              48
  Total                                            |     342           98      978              302      685     435   2,840
----------------------------------------------------------------------------------------------------------------------------

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable i.agree i.sex i.preg_test, by(cohort) ///
> title("Consent, by cohort") ///
> export(agree.pdf ,as(pdf) replace)

Consent, by cohort
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                        Study cohort                                       
                                                                                    DIVIDS     SAM Lusaka    CICADA   NUSTART Lusaka    St-ATT      CLHNS         Total    
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                                                 342 (11.9%)   98 (3.4%) 978 (34.0%)    302 (10.5%) 685 (23.8%) 474 (16.5%) 2,879 (100.0%)
Did the participant agree to join the SAMPA study?                                                                                                                         
  No, they do not agree                                                              0 (0.0%)    0 (0.0%)    1 (0.1%)       0 (0.0%) 167 (24.4%) 122 (28.0%)    290 (10.2%)
  Yes, they agree                                                                342 (100.0%) 98 (100.0%) 977 (99.9%)   302 (100.0%) 275 (40.1%) 308 (70.8%)  2,302 (81.1%)
  Unable to contact participant                                                      0 (0.0%)    0 (0.0%)    0 (0.0%)       0 (0.0%) 195 (28.5%)    5 (1.1%)     200 (7.0%)
  4                                                                                  0 (0.0%)    0 (0.0%)    0 (0.0%)       0 (0.0%)   48 (7.0%)    0 (0.0%)      48 (1.7%)
[2.2] Participant's sex                                                                                                                                                    
  Male                                                                            169 (49.4%)  49 (50.0%) 407 (41.6%)    105 (34.8%) 492 (71.8%) 304 (64.1%)  1,526 (53.0%)
  Female                                                                          173 (50.6%)  49 (50.0%) 571 (58.4%)    197 (65.2%) 193 (28.2%) 170 (35.9%)  1,353 (47.0%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                           
  No, is male                                                                          0 (.%)      0 (.%) 403 (41.2%)    105 (34.8%) 190 (69.1%) 197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                     0 (.%)      0 (.%) 215 (22.0%)     39 (12.9%)  39 (14.2%)    0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                        0 (.%)      0 (.%)    4 (0.4%)       1 (0.3%)    1 (0.4%)    1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                              0 (.%)      0 (.%) 351 (35.9%)    157 (52.0%)  45 (16.4%) 110 (35.7%)    663 (35.6%)
  5                                                                                    0 (.%)      0 (.%)    4 (0.4%)       0 (0.0%)    0 (0.0%)    0 (0.0%)       4 (0.2%)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. collect dims

Collection dimensions
Collection: DTable
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
                      across   2         
                       agree   4         
                      cmdset   1         
                      cohort   7         
                     colname   11        
           colname_remainder   1         
                     command   1         
                   preg_test   5         
                      result   10        
                         sex   2         
                     statcmd   4         
                         var   13        

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. collect label list agree

  Collection: DTable
   Dimension: agree
       Label: Did the participant agree to join the SAMPA study?
Level labels:
           0  No, they do not agree
           1  Yes, they agree
           2  Unable to contact participant

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable i.agree i.sex i.preg_test if agree ==1, by(cohort) ///
> title("Consent, by cohort") ///
> export(agree.pdf ,as(pdf) replace)

Consent, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                          Study cohort                                        
                                                                                    DIVIDS     SAM Lusaka    CICADA    NUSTART Lusaka    St-ATT        CLHNS         Total    
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                                                 342 (14.9%)   98 (4.3%)  977 (42.4%)    302 (13.1%)  275 (11.9%)  308 (13.4%) 2,302 (100.0%)
Did the participant agree to join the SAMPA study?                                                                                                                            
  Yes, they agree                                                                342 (100.0%) 98 (100.0%) 977 (100.0%)   302 (100.0%) 275 (100.0%) 308 (100.0%) 2,302 (100.0%)
[2.2] Participant's sex                                                                                                                                                       
  Male                                                                            169 (49.4%)  49 (50.0%)  407 (41.7%)    105 (34.8%)  190 (69.1%)  197 (64.0%)  1,117 (48.5%)
  Female                                                                          173 (50.6%)  49 (50.0%)  570 (58.3%)    197 (65.2%)   85 (30.9%)  111 (36.0%)  1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                              
  No, is male                                                                          0 (.%)      0 (.%)  403 (41.2%)    105 (34.8%)  190 (69.1%)  197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                     0 (.%)      0 (.%)  215 (22.0%)     39 (12.9%)   39 (14.2%)     0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                        0 (.%)      0 (.%)     4 (0.4%)       1 (0.3%)     1 (0.4%)     1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                              0 (.%)      0 (.%)  351 (35.9%)    157 (52.0%)   45 (16.4%)  110 (35.7%)    663 (35.6%)
  5                                                                                    0 (.%)      0 (.%)     4 (0.4%)       0 (0.0%)     0 (0.0%)     0 (0.0%)       4 (0.2%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable i.agree i.sex i.preg_test i.preg_result i.pregnancy if agree ==1, by(cohort) ///
> title("Consent, by cohort") ///
> export(agree.pdf ,as(pdf) replace)
variable pregnancy not found
r(111);

end of do-file

r(111);

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable i.agree i.sex i.preg_test i.preg_result if agree ==1, by(cohort) ///
> title("Consent, by cohort") ///
> export(agree.pdf ,as(pdf) replace)

Consent, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                          Study cohort                                        
                                                                                    DIVIDS     SAM Lusaka    CICADA    NUSTART Lusaka    St-ATT        CLHNS         Total    
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                                                 342 (14.9%)   98 (4.3%)  977 (42.4%)    302 (13.1%)  275 (11.9%)  308 (13.4%) 2,302 (100.0%)
Did the participant agree to join the SAMPA study?                                                                                                                            
  Yes, they agree                                                                342 (100.0%) 98 (100.0%) 977 (100.0%)   302 (100.0%) 275 (100.0%) 308 (100.0%) 2,302 (100.0%)
[2.2] Participant's sex                                                                                                                                                       
  Male                                                                            169 (49.4%)  49 (50.0%)  407 (41.7%)    105 (34.8%)  190 (69.1%)  197 (64.0%)  1,117 (48.5%)
  Female                                                                          173 (50.6%)  49 (50.0%)  570 (58.3%)    197 (65.2%)   85 (30.9%)  111 (36.0%)  1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                              
  No, is male                                                                          0 (.%)      0 (.%)  403 (41.2%)    105 (34.8%)  190 (69.1%)  197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                     0 (.%)      0 (.%)  215 (22.0%)     39 (12.9%)   39 (14.2%)     0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                        0 (.%)      0 (.%)     4 (0.4%)       1 (0.3%)     1 (0.4%)     1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                              0 (.%)      0 (.%)  351 (35.9%)    157 (52.0%)   45 (16.4%)  110 (35.7%)    663 (35.6%)
  5                                                                                    0 (.%)      0 (.%)     4 (0.4%)       0 (0.0%)     0 (0.0%)     0 (0.0%)       4 (0.2%)
Pregnancy test results                                                                                                                                                        
  has documented negative pregnancy test performed by SAMPA                            0 (.%)      0 (.%)  340 (96.9%)    155 (98.1%)   44 (97.8%)  109 (99.1%)    648 (97.6%)
  has documented positive pregnancy test                                               0 (.%)      0 (.%)    11 (3.1%)       3 (1.9%)     1 (2.2%)     1 (0.9%)      16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable i.agree 1.sex i.preg_test i.preg_result if agree ==1, by(cohort) ///
> title("Consent, by cohort") ///
> export(agree.pdf ,as(pdf) replace)

Consent, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                          Study cohort                                        
                                                                                    DIVIDS     SAM Lusaka    CICADA    NUSTART Lusaka    St-ATT        CLHNS         Total    
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                                                 342 (14.9%)   98 (4.3%)  977 (42.4%)    302 (13.1%)  275 (11.9%)  308 (13.4%) 2,302 (100.0%)
Did the participant agree to join the SAMPA study?                                                                                                                            
  Yes, they agree                                                                342 (100.0%) 98 (100.0%) 977 (100.0%)   302 (100.0%) 275 (100.0%) 308 (100.0%) 2,302 (100.0%)
[2.2] Participant's sex                                                                                                                                                       
  Male                                                                            169 (49.4%)  49 (50.0%)  407 (41.7%)    105 (34.8%)  190 (69.1%)  197 (64.0%)  1,117 (48.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                              
  No, is male                                                                          0 (.%)      0 (.%)  403 (41.2%)    105 (34.8%)  190 (69.1%)  197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                     0 (.%)      0 (.%)  215 (22.0%)     39 (12.9%)   39 (14.2%)     0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                        0 (.%)      0 (.%)     4 (0.4%)       1 (0.3%)     1 (0.4%)     1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                              0 (.%)      0 (.%)  351 (35.9%)    157 (52.0%)   45 (16.4%)  110 (35.7%)    663 (35.6%)
  5                                                                                    0 (.%)      0 (.%)     4 (0.4%)       0 (0.0%)     0 (0.0%)     0 (0.0%)       4 (0.2%)
Pregnancy test results                                                                                                                                                        
  has documented negative pregnancy test performed by SAMPA                            0 (.%)      0 (.%)  340 (96.9%)    155 (98.1%)   44 (97.8%)  109 (99.1%)    648 (97.6%)
  has documented positive pregnancy test                                               0 (.%)      0 (.%)    11 (3.1%)       3 (1.9%)     1 (2.2%)     1 (0.9%)      16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. collect style header ht, level(hide)
(dimension ht not found)

. collect preview

Consent, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                          Study cohort                                        
                                                                                    DIVIDS     SAM Lusaka    CICADA    NUSTART Lusaka    St-ATT        CLHNS         Total    
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                                                 342 (14.9%)   98 (4.3%)  977 (42.4%)    302 (13.1%)  275 (11.9%)  308 (13.4%) 2,302 (100.0%)
Did the participant agree to join the SAMPA study?                                                                                                                            
  Yes, they agree                                                                342 (100.0%) 98 (100.0%) 977 (100.0%)   302 (100.0%) 275 (100.0%) 308 (100.0%) 2,302 (100.0%)
[2.2] Participant's sex                                                                                                                                                       
  Male                                                                            169 (49.4%)  49 (50.0%)  407 (41.7%)    105 (34.8%)  190 (69.1%)  197 (64.0%)  1,117 (48.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                              
  No, is male                                                                          0 (.%)      0 (.%)  403 (41.2%)    105 (34.8%)  190 (69.1%)  197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                     0 (.%)      0 (.%)  215 (22.0%)     39 (12.9%)   39 (14.2%)     0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                        0 (.%)      0 (.%)     4 (0.4%)       1 (0.3%)     1 (0.4%)     1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                              0 (.%)      0 (.%)  351 (35.9%)    157 (52.0%)   45 (16.4%)  110 (35.7%)    663 (35.6%)
  5                                                                                    0 (.%)      0 (.%)     4 (0.4%)       0 (0.0%)     0 (0.0%)     0 (0.0%)       4 (0.2%)
Pregnancy test results                                                                                                                                                        
  has documented negative pregnancy test performed by SAMPA                            0 (.%)      0 (.%)  340 (96.9%)    155 (98.1%)   44 (97.8%)  109 (99.1%)    648 (97.6%)
  has documented positive pregnancy test                                               0 (.%)      0 (.%)    11 (3.1%)       3 (1.9%)     1 (2.2%)     1 (0.9%)      16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. collect style header sex, level(hide)

. collect preview

Consent, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                          Study cohort                                        
                                                                                    DIVIDS     SAM Lusaka    CICADA    NUSTART Lusaka    St-ATT        CLHNS         Total    
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                                                 342 (14.9%)   98 (4.3%)  977 (42.4%)    302 (13.1%)  275 (11.9%)  308 (13.4%) 2,302 (100.0%)
Did the participant agree to join the SAMPA study?                                                                                                                            
  Yes, they agree                                                                342 (100.0%) 98 (100.0%) 977 (100.0%)   302 (100.0%) 275 (100.0%) 308 (100.0%) 2,302 (100.0%)
[2.2] Participant's sex                                                           169 (49.4%)  49 (50.0%)  407 (41.7%)    105 (34.8%)  190 (69.1%)  197 (64.0%)  1,117 (48.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                              
  No, is male                                                                          0 (.%)      0 (.%)  403 (41.2%)    105 (34.8%)  190 (69.1%)  197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                     0 (.%)      0 (.%)  215 (22.0%)     39 (12.9%)   39 (14.2%)     0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                        0 (.%)      0 (.%)     4 (0.4%)       1 (0.3%)     1 (0.4%)     1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                              0 (.%)      0 (.%)  351 (35.9%)    157 (52.0%)   45 (16.4%)  110 (35.7%)    663 (35.6%)
  5                                                                                    0 (.%)      0 (.%)     4 (0.4%)       0 (0.0%)     0 (0.0%)     0 (0.0%)       4 (0.2%)
Pregnancy test results                                                                                                                                                        
  has documented negative pregnancy test performed by SAMPA                            0 (.%)      0 (.%)  340 (96.9%)    155 (98.1%)   44 (97.8%)  109 (99.1%)    648 (97.6%)
  has documented positive pregnancy test                                               0 (.%)      0 (.%)    11 (3.1%)       3 (1.9%)     1 (2.2%)     1 (0.9%)      16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable i.agree 2.sex i.preg_test i.preg_result if agree ==1, by(cohort) ///
> title("Consent, by cohort") ///
> export(agree.pdf ,as(pdf) replace)

Consent, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                          Study cohort                                        
                                                                                    DIVIDS     SAM Lusaka    CICADA    NUSTART Lusaka    St-ATT        CLHNS         Total    
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                                                                                 342 (14.9%)   98 (4.3%)  977 (42.4%)    302 (13.1%)  275 (11.9%)  308 (13.4%) 2,302 (100.0%)
Did the participant agree to join the SAMPA study?                                                                                                                            
  Yes, they agree                                                                342 (100.0%) 98 (100.0%) 977 (100.0%)   302 (100.0%) 275 (100.0%) 308 (100.0%) 2,302 (100.0%)
[2.2] Participant's sex                                                                                                                                                       
  Female                                                                          173 (50.6%)  49 (50.0%)  570 (58.3%)    197 (65.2%)   85 (30.9%)  111 (36.0%)  1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                              
  No, is male                                                                          0 (.%)      0 (.%)  403 (41.2%)    105 (34.8%)  190 (69.1%)  197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                     0 (.%)      0 (.%)  215 (22.0%)     39 (12.9%)   39 (14.2%)     0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                        0 (.%)      0 (.%)     4 (0.4%)       1 (0.3%)     1 (0.4%)     1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                              0 (.%)      0 (.%)  351 (35.9%)    157 (52.0%)   45 (16.4%)  110 (35.7%)    663 (35.6%)
  5                                                                                    0 (.%)      0 (.%)     4 (0.4%)       0 (0.0%)     0 (0.0%)     0 (0.0%)       4 (0.2%)
Pregnancy test results                                                                                                                                                        
  has documented negative pregnancy test performed by SAMPA                            0 (.%)      0 (.%)  340 (96.9%)    155 (98.1%)   44 (97.8%)  109 (99.1%)    648 (97.6%)
  has documented positive pregnancy test                                               0 (.%)      0 (.%)    11 (3.1%)       3 (1.9%)     1 (2.2%)     1 (0.9%)      16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable i.agree 2.sex i.preg_test i.preg_result if agree ==1, by(cohort) ///
> title("Consent, by cohort") ///
> sample(, place(seplabels)) ///
> export(agree.pdf ,as(pdf) replace)

Consent, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                          Study cohort                                        
                                                                                    DIVIDS     SAM Lusaka    CICADA    NUSTART Lusaka    St-ATT        CLHNS         Total    
                                                                                  342 (14.9%)  98 (4.3%)   977 (42.4%)   302 (13.1%)   275 (11.9%)  308 (13.4%) 2,302 (100.0%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Did the participant agree to join the SAMPA study?                                                                                                                            
  Yes, they agree                                                                342 (100.0%) 98 (100.0%) 977 (100.0%)   302 (100.0%) 275 (100.0%) 308 (100.0%) 2,302 (100.0%)
[2.2] Participant's sex                                                                                                                                                       
  Female                                                                          173 (50.6%)  49 (50.0%)  570 (58.3%)    197 (65.2%)   85 (30.9%)  111 (36.0%)  1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                              
  No, is male                                                                          0 (.%)      0 (.%)  403 (41.2%)    105 (34.8%)  190 (69.1%)  197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                     0 (.%)      0 (.%)  215 (22.0%)     39 (12.9%)   39 (14.2%)     0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                        0 (.%)      0 (.%)     4 (0.4%)       1 (0.3%)     1 (0.4%)     1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                              0 (.%)      0 (.%)  351 (35.9%)    157 (52.0%)   45 (16.4%)  110 (35.7%)    663 (35.6%)
  5                                                                                    0 (.%)      0 (.%)     4 (0.4%)       0 (0.0%)     0 (0.0%)     0 (0.0%)       4 (0.2%)
Pregnancy test results                                                                                                                                                        
  has documented negative pregnancy test performed by SAMPA                            0 (.%)      0 (.%)  340 (96.9%)    155 (98.1%)   44 (97.8%)  109 (99.1%)    648 (97.6%)
  has documented positive pregnancy test                                               0 (.%)      0 (.%)    11 (3.1%)       3 (1.9%)     1 (2.2%)     1 (0.9%)      16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. help predefined styles

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable 2.sex i.preg_test i.preg_result if agree ==1, by(cohort) ///
> title("Consent, by cohort") ///
> sample(, place(seplabels)) ///
> export(agree.pdf ,as(pdf) replace)

Consent, by cohort
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                       Study cohort                                      
                                                                                    DIVIDS   SAM Lusaka    CICADA   NUSTART Lusaka    St-ATT      CLHNS         Total    
                                                                                 342 (14.9%)  98 (4.3%) 977 (42.4%)   302 (13.1%)  275 (11.9%) 308 (13.4%) 2,302 (100.0%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
[2.2] Participant's sex                                                                                                                                                  
  Female                                                                         173 (50.6%) 49 (50.0%) 570 (58.3%)    197 (65.2%)  85 (30.9%) 111 (36.0%)  1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                         
  No, is male                                                                         0 (.%)     0 (.%) 403 (41.2%)    105 (34.8%) 190 (69.1%) 197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                    0 (.%)     0 (.%) 215 (22.0%)     39 (12.9%)  39 (14.2%)    0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                       0 (.%)     0 (.%)    4 (0.4%)       1 (0.3%)    1 (0.4%)    1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                             0 (.%)     0 (.%) 351 (35.9%)    157 (52.0%)  45 (16.4%) 110 (35.7%)    663 (35.6%)
  5                                                                                   0 (.%)     0 (.%)    4 (0.4%)       0 (0.0%)    0 (0.0%)    0 (0.0%)       4 (0.2%)
Pregnancy test results                                                                                                                                                   
  has documented negative pregnancy test performed by SAMPA                           0 (.%)     0 (.%) 340 (96.9%)    155 (98.1%)  44 (97.8%) 109 (99.1%)    648 (97.6%)
  has documented positive pregnancy test                                              0 (.%)     0 (.%)   11 (3.1%)       3 (1.9%)    1 (2.2%)    1 (0.9%)      16 (2.4%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable 2.sex i.preg_test i.preg_result if agree ==1, by(cohort) ///
> title("Participants, by cohort") ///
> sample(, place(seplabels)) ///
> export(agree.pdf ,as(pdf) replace)

Participants, by cohort
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                       Study cohort                                      
                                                                                    DIVIDS   SAM Lusaka    CICADA   NUSTART Lusaka    St-ATT      CLHNS         Total    
                                                                                 342 (14.9%)  98 (4.3%) 977 (42.4%)   302 (13.1%)  275 (11.9%) 308 (13.4%) 2,302 (100.0%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
[2.2] Participant's sex                                                                                                                                                  
  Female                                                                         173 (50.6%) 49 (50.0%) 570 (58.3%)    197 (65.2%)  85 (30.9%) 111 (36.0%)  1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                         
  No, is male                                                                         0 (.%)     0 (.%) 403 (41.2%)    105 (34.8%) 190 (69.1%) 197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                    0 (.%)     0 (.%) 215 (22.0%)     39 (12.9%)  39 (14.2%)    0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                       0 (.%)     0 (.%)    4 (0.4%)       1 (0.3%)    1 (0.4%)    1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                             0 (.%)     0 (.%) 351 (35.9%)    157 (52.0%)  45 (16.4%) 110 (35.7%)    663 (35.6%)
  5                                                                                   0 (.%)     0 (.%)    4 (0.4%)       0 (0.0%)    0 (0.0%)    0 (0.0%)       4 (0.2%)
Pregnancy test results                                                                                                                                                   
  has documented negative pregnancy test performed by SAMPA                           0 (.%)     0 (.%) 340 (96.9%)    155 (98.1%)  44 (97.8%) 109 (99.1%)    648 (97.6%)
  has documented positive pregnancy test                                              0 (.%)     0 (.%)   11 (3.1%)       3 (1.9%)    1 (2.2%)    1 (0.9%)      16 (2.4%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. collect style header sex, level(hide)

. collect preview

Participants, by cohort
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                       Study cohort                                      
                                                                                    DIVIDS   SAM Lusaka    CICADA   NUSTART Lusaka    St-ATT      CLHNS         Total    
                                                                                 342 (14.9%)  98 (4.3%) 977 (42.4%)   302 (13.1%)  275 (11.9%) 308 (13.4%) 2,302 (100.0%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
[2.2] Participant's sex                                                          173 (50.6%) 49 (50.0%) 570 (58.3%)    197 (65.2%)  85 (30.9%) 111 (36.0%)  1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                         
  No, is male                                                                         0 (.%)     0 (.%) 403 (41.2%)    105 (34.8%) 190 (69.1%) 197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                    0 (.%)     0 (.%) 215 (22.0%)     39 (12.9%)  39 (14.2%)    0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                       0 (.%)     0 (.%)    4 (0.4%)       1 (0.3%)    1 (0.4%)    1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                             0 (.%)     0 (.%) 351 (35.9%)    157 (52.0%)  45 (16.4%) 110 (35.7%)    663 (35.6%)
  5                                                                                   0 (.%)     0 (.%)    4 (0.4%)       0 (0.0%)    0 (0.0%)    0 (0.0%)       4 (0.2%)
Pregnancy test results                                                                                                                                                   
  has documented negative pregnancy test performed by SAMPA                           0 (.%)     0 (.%) 340 (96.9%)    155 (98.1%)  44 (97.8%) 109 (99.1%)    648 (97.6%)
  has documented positive pregnancy test                                              0 (.%)     0 (.%)   11 (3.1%)       3 (1.9%)    1 (2.2%)    1 (0.9%)      16 (2.4%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable 2.sex i.preg_test i.preg_result if agree ==1, by(cohort) ///
> title("Participants, by cohort") ///
> sample(, place(seplabels)) ///
> nformat("%9.2f" percent rawpercent fvpercent fvrawpercent) ///
> export(agree.pdf ,as(pdf) replace)

Participants, by cohort
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                          Study cohort                                         
                                                                                    DIVIDS     SAM Lusaka    CICADA    NUSTART Lusaka    St-ATT        CLHNS         Total     
                                                                                 342 (14.86%)  98 (4.26%) 977 (42.44%)  302 (13.12%)  275 (11.95%) 308 (13.38%) 2,302 (100.00%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
[2.2] Participant's sex                                                                                                                                                        
  Female                                                                         173 (50.58%) 49 (50.00%) 570 (58.34%)   197 (65.23%)  85 (30.91%) 111 (36.04%)  1,185 (51.48%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                               
  No, is male                                                                          0 (.%)      0 (.%) 403 (41.25%)   105 (34.77%) 190 (69.09%) 197 (63.96%)    895 (48.07%)
  No, is female, and says they are post-menopausal                                     0 (.%)      0 (.%) 215 (22.01%)    39 (12.91%)  39 (14.18%)    0 (0.00%)    293 (15.74%)
  No, since they already know they are pregnant                                        0 (.%)      0 (.%)    4 (0.41%)      1 (0.33%)    1 (0.36%)    1 (0.32%)       7 (0.38%)
  Yes, will agree to test                                                              0 (.%)      0 (.%) 351 (35.93%)   157 (51.99%)  45 (16.36%) 110 (35.71%)    663 (35.61%)
  5                                                                                    0 (.%)      0 (.%)    4 (0.41%)      0 (0.00%)    0 (0.00%)    0 (0.00%)       4 (0.21%)
Pregnancy test results                                                                                                                                                         
  has documented negative pregnancy test performed by SAMPA                            0 (.%)      0 (.%) 340 (96.87%)   155 (98.10%)  44 (97.78%) 109 (99.09%)    648 (97.59%)
  has documented positive pregnancy test                                               0 (.%)      0 (.%)   11 (3.13%)      3 (1.90%)    1 (2.22%)    1 (0.91%)      16 (2.41%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. collect style header sex, level(hide)

. collect preview

Participants, by cohort
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                          Study cohort                                         
                                                                                    DIVIDS     SAM Lusaka    CICADA    NUSTART Lusaka    St-ATT        CLHNS         Total     
                                                                                 342 (14.86%)  98 (4.26%) 977 (42.44%)  302 (13.12%)  275 (11.95%) 308 (13.38%) 2,302 (100.00%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
[2.2] Participant's sex                                                          173 (50.58%) 49 (50.00%) 570 (58.34%)   197 (65.23%)  85 (30.91%) 111 (36.04%)  1,185 (51.48%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                               
  No, is male                                                                          0 (.%)      0 (.%) 403 (41.25%)   105 (34.77%) 190 (69.09%) 197 (63.96%)    895 (48.07%)
  No, is female, and says they are post-menopausal                                     0 (.%)      0 (.%) 215 (22.01%)    39 (12.91%)  39 (14.18%)    0 (0.00%)    293 (15.74%)
  No, since they already know they are pregnant                                        0 (.%)      0 (.%)    4 (0.41%)      1 (0.33%)    1 (0.36%)    1 (0.32%)       7 (0.38%)
  Yes, will agree to test                                                              0 (.%)      0 (.%) 351 (35.93%)   157 (51.99%)  45 (16.36%) 110 (35.71%)    663 (35.61%)
  5                                                                                    0 (.%)      0 (.%)    4 (0.41%)      0 (0.00%)    0 (0.00%)    0 (0.00%)       4 (0.21%)
Pregnancy test results                                                                                                                                                         
  has documented negative pregnancy test performed by SAMPA                            0 (.%)      0 (.%) 340 (96.87%)   155 (98.10%)  44 (97.78%) 109 (99.09%)    648 (97.59%)
  has documented positive pregnancy test                                               0 (.%)      0 (.%)   11 (3.13%)      3 (1.90%)    1 (2.22%)    1 (0.91%)      16 (2.41%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable 2.sex i.preg_test i.preg_result if agree ==1, by(cohort) ///
> title("Participants, by cohort") ///
> sample(, place(seplabels)) ///
> nformat("%9.1f" percent rawpercent fvpercent fvrawpercent) ///
> export(agree.pdf ,as(pdf) replace)

Participants, by cohort
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                       Study cohort                                      
                                                                                    DIVIDS   SAM Lusaka    CICADA   NUSTART Lusaka    St-ATT      CLHNS         Total    
                                                                                 342 (14.9%)  98 (4.3%) 977 (42.4%)   302 (13.1%)  275 (11.9%) 308 (13.4%) 2,302 (100.0%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
[2.2] Participant's sex                                                                                                                                                  
  Female                                                                         173 (50.6%) 49 (50.0%) 570 (58.3%)    197 (65.2%)  85 (30.9%) 111 (36.0%)  1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                         
  No, is male                                                                         0 (.%)     0 (.%) 403 (41.2%)    105 (34.8%) 190 (69.1%) 197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                    0 (.%)     0 (.%) 215 (22.0%)     39 (12.9%)  39 (14.2%)    0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                       0 (.%)     0 (.%)    4 (0.4%)       1 (0.3%)    1 (0.4%)    1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                             0 (.%)     0 (.%) 351 (35.9%)    157 (52.0%)  45 (16.4%) 110 (35.7%)    663 (35.6%)
  5                                                                                   0 (.%)     0 (.%)    4 (0.4%)       0 (0.0%)    0 (0.0%)    0 (0.0%)       4 (0.2%)
Pregnancy test results                                                                                                                                                   
  has documented negative pregnancy test performed by SAMPA                           0 (.%)     0 (.%) 340 (96.9%)    155 (98.1%)  44 (97.8%) 109 (99.1%)    648 (97.6%)
  has documented positive pregnancy test                                              0 (.%)     0 (.%)   11 (3.1%)       3 (1.9%)    1 (2.2%)    1 (0.9%)      16 (2.4%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. collect style header sex, level(hide)

. collect preview

Participants, by cohort
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                       Study cohort                                      
                                                                                    DIVIDS   SAM Lusaka    CICADA   NUSTART Lusaka    St-ATT      CLHNS         Total    
                                                                                 342 (14.9%)  98 (4.3%) 977 (42.4%)   302 (13.1%)  275 (11.9%) 308 (13.4%) 2,302 (100.0%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
[2.2] Participant's sex                                                          173 (50.6%) 49 (50.0%) 570 (58.3%)    197 (65.2%)  85 (30.9%) 111 (36.0%)  1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                         
  No, is male                                                                         0 (.%)     0 (.%) 403 (41.2%)    105 (34.8%) 190 (69.1%) 197 (64.0%)    895 (48.1%)
  No, is female, and says they are post-menopausal                                    0 (.%)     0 (.%) 215 (22.0%)     39 (12.9%)  39 (14.2%)    0 (0.0%)    293 (15.7%)
  No, since they already know they are pregnant                                       0 (.%)     0 (.%)    4 (0.4%)       1 (0.3%)    1 (0.4%)    1 (0.3%)       7 (0.4%)
  Yes, will agree to test                                                             0 (.%)     0 (.%) 351 (35.9%)    157 (52.0%)  45 (16.4%) 110 (35.7%)    663 (35.6%)
  5                                                                                   0 (.%)     0 (.%)    4 (0.4%)       0 (0.0%)    0 (0.0%)    0 (0.0%)       4 (0.2%)
Pregnancy test results                                                                                                                                                   
  has documented negative pregnancy test performed by SAMPA                           0 (.%)     0 (.%) 340 (96.9%)    155 (98.1%)  44 (97.8%) 109 (99.1%)    648 (97.6%)
  has documented positive pregnancy test                                              0 (.%)     0 (.%)   11 (3.1%)       3 (1.9%)    1 (2.2%)    1 (0.9%)      16 (2.4%)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable 2.sex i.preg_test i.preg_result if agree ==1, by(cohort) ///
>         title("Participants, by cohort") ///
>         sample(, place(seplabels)) ///
>         nformat("%9.1f" percent rawpercent fvpercent fvrawpercent) ///
>         sformat("N=%s" frequency) ///
>         export(agree.pdf ,as(pdf) replace)

Participants, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                             Study cohort                                           
                                                                                     DIVIDS     SAM Lusaka     CICADA    NUSTART Lusaka     St-ATT        CLHNS           Total     
                                                                                 N=342 (14.9%) N=98 (4.3%) N=977 (42.4%)  N=302 (13.1%) N=275 (11.9%) N=308 (13.4%) N=2,302 (100.0%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
[2.2] Participant's sex                                                                                                                                                             
  Female                                                                           173 (50.6%)  49 (50.0%)   570 (58.3%)    197 (65.2%)    85 (30.9%)   111 (36.0%)    1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                                    
  No, is male                                                                           0 (.%)      0 (.%)   403 (41.2%)    105 (34.8%)   190 (69.1%)   197 (64.0%)      895 (48.1%)
  No, is female, and says they are post-menopausal                                      0 (.%)      0 (.%)   215 (22.0%)     39 (12.9%)    39 (14.2%)      0 (0.0%)      293 (15.7%)
  No, since they already know they are pregnant                                         0 (.%)      0 (.%)      4 (0.4%)       1 (0.3%)      1 (0.4%)      1 (0.3%)         7 (0.4%)
  Yes, will agree to test                                                               0 (.%)      0 (.%)   351 (35.9%)    157 (52.0%)    45 (16.4%)   110 (35.7%)      663 (35.6%)
  5                                                                                     0 (.%)      0 (.%)      4 (0.4%)       0 (0.0%)      0 (0.0%)      0 (0.0%)         4 (0.2%)
Pregnancy test results                                                                                                                                                              
  has documented negative pregnancy test performed by SAMPA                             0 (.%)      0 (.%)   340 (96.9%)    155 (98.1%)    44 (97.8%)   109 (99.1%)      648 (97.6%)
  has documented positive pregnancy test                                                0 (.%)      0 (.%)     11 (3.1%)       3 (1.9%)      1 (2.2%)      1 (0.9%)        16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. label list preg_test
preg_test:
           1 No, is male
           2 No, is female, and says they are post-menopausal
           3 No, since they already know they are pregnant
           4 Yes, will agree to test

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable 2.sex 4.preg_test i.preg_result if agree ==1, by(cohort) ///
>         title("Participants, by cohort") ///
>         sample(, place(seplabels)) ///
>         nformat("%9.1f" percent rawpercent fvpercent fvrawpercent) ///
>         sformat("N=%s" frequency) ///
>         export(agree.pdf ,as(pdf) replace)

Participants, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                             Study cohort                                           
                                                                                     DIVIDS     SAM Lusaka     CICADA    NUSTART Lusaka     St-ATT        CLHNS           Total     
                                                                                 N=342 (14.9%) N=98 (4.3%) N=977 (42.4%)  N=302 (13.1%) N=275 (11.9%) N=308 (13.4%) N=2,302 (100.0%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
[2.2] Participant's sex                                                                                                                                                             
  Female                                                                           173 (50.6%)  49 (50.0%)   570 (58.3%)    197 (65.2%)    85 (30.9%)   111 (36.0%)    1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                                    
  Yes, will agree to test                                                               0 (.%)      0 (.%)   351 (35.9%)    157 (52.0%)    45 (16.4%)   110 (35.7%)      663 (35.6%)
Pregnancy test results                                                                                                                                                              
  has documented negative pregnancy test performed by SAMPA                             0 (.%)      0 (.%)   340 (96.9%)    155 (98.1%)    44 (97.8%)   109 (99.1%)      648 (97.6%)
  has documented positive pregnancy test                                                0 (.%)      0 (.%)     11 (3.1%)       3 (1.9%)      1 (2.2%)      1 (0.9%)        16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. label list preg_res
value label preg_res not found
r(111);

. label list preg_result
preg_result:
           1 has documented negative pregnancy test performed by SAMPA
           2 has documented positive pregnancy test

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable 2.sex 4.preg_test 2.preg_result if agree ==1, by(cohort) ///
>         title("Participants, by cohort") ///
>         sample(, place(seplabels)) ///
>         nformat("%9.1f" percent rawpercent fvpercent fvrawpercent) ///
>         sformat("N=%s" frequency) ///
>         export(agree.pdf ,as(pdf) replace)

Participants, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                             Study cohort                                           
                                                                                     DIVIDS     SAM Lusaka     CICADA    NUSTART Lusaka     St-ATT        CLHNS           Total     
                                                                                 N=342 (14.9%) N=98 (4.3%) N=977 (42.4%)  N=302 (13.1%) N=275 (11.9%) N=308 (13.4%) N=2,302 (100.0%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
[2.2] Participant's sex                                                                                                                                                             
  Female                                                                           173 (50.6%)  49 (50.0%)   570 (58.3%)    197 (65.2%)    85 (30.9%)   111 (36.0%)    1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                                    
  Yes, will agree to test                                                               0 (.%)      0 (.%)   351 (35.9%)    157 (52.0%)    45 (16.4%)   110 (35.7%)      663 (35.6%)
Pregnancy test results                                                                                                                                                              
  has documented positive pregnancy test                                                0 (.%)      0 (.%)     11 (3.1%)       3 (1.9%)      1 (2.2%)      1 (0.9%)        16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable age 2.sex 4.preg_test 2.preg_result if agree ==1, by(cohort) ///
>         title("Participants, by cohort") ///
>         sample(, place(seplabels)) ///
>         nformat("%9.1f" percent rawpercent fvpercent fvrawpercent) ///
>         sformat("N=%s" frequency) ///
>         export(agree.pdf ,as(pdf) replace)

Participants, by cohort
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                                 Study cohort                                                
                                                                                     DIVIDS       SAM Lusaka        CICADA     NUSTART Lusaka      St-ATT          CLHNS           Total     
                                                                                  N=342 (14.9%)   N=98 (4.3%)   N=977 (42.4%)   N=302 (13.1%)  N=275 (11.9%)   N=308 (13.4%) N=2,302 (100.0%)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Age (years)                                                                      14.292 (1.257) 12.990 (1.615) 48.179 (11.183) 44.278 (9.734) 51.225 (15.312) 39.597 (0.504)  40.351 (16.395)
[2.2] Participant's sex                                                                                                                                                                      
  Female                                                                            173 (50.6%)     49 (50.0%)     570 (58.3%)    197 (65.2%)      85 (30.9%)    111 (36.0%)    1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                                             
  Yes, will agree to test                                                                0 (.%)         0 (.%)     351 (35.9%)    157 (52.0%)      45 (16.4%)    110 (35.7%)      663 (35.6%)
Pregnancy test results                                                                                                                                                                       
  has documented positive pregnancy test                                                 0 (.%)         0 (.%)       11 (3.1%)       3 (1.9%)        1 (2.2%)       1 (0.9%)        16 (2.4%)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable age 2.sex 4.preg_test 2.preg_result if agree ==1, by(cohort) ///
>         title("Participants, by cohort") ///
>         sample(, place(seplabels)) ///
>         nformat("%9.1f" mean sd percent rawpercent fvpercent fvrawpercent) ///
>         sformat("N=%s" frequency) ///
>         export(agree.pdf ,as(pdf) replace)

Participants, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                             Study cohort                                           
                                                                                     DIVIDS     SAM Lusaka     CICADA    NUSTART Lusaka     St-ATT        CLHNS           Total     
                                                                                 N=342 (14.9%) N=98 (4.3%) N=977 (42.4%)  N=302 (13.1%) N=275 (11.9%) N=308 (13.4%) N=2,302 (100.0%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Age (years)                                                                         14.3 (1.3)  13.0 (1.6)   48.2 (11.2)     44.3 (9.7)   51.2 (15.3)    39.6 (0.5)      40.4 (16.4)
[2.2] Participant's sex                                                                                                                                                             
  Female                                                                           173 (50.6%)  49 (50.0%)   570 (58.3%)    197 (65.2%)    85 (30.9%)   111 (36.0%)    1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                                    
  Yes, will agree to test                                                               0 (.%)      0 (.%)   351 (35.9%)    157 (52.0%)    45 (16.4%)   110 (35.7%)      663 (35.6%)
Pregnancy test results                                                                                                                                                              
  has documented positive pregnancy test                                                0 (.%)      0 (.%)     11 (3.1%)       3 (1.9%)      1 (2.2%)      1 (0.9%)        16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. collect style header sex, level(hide)

. collect preview

Participants, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                             Study cohort                                           
                                                                                     DIVIDS     SAM Lusaka     CICADA    NUSTART Lusaka     St-ATT        CLHNS           Total     
                                                                                 N=342 (14.9%) N=98 (4.3%) N=977 (42.4%)  N=302 (13.1%) N=275 (11.9%) N=308 (13.4%) N=2,302 (100.0%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Age (years)                                                                         14.3 (1.3)  13.0 (1.6)   48.2 (11.2)     44.3 (9.7)   51.2 (15.3)    39.6 (0.5)      40.4 (16.4)
[2.2] Participant's sex                                                            173 (50.6%)  49 (50.0%)   570 (58.3%)    197 (65.2%)    85 (30.9%)   111 (36.0%)    1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                                    
  Yes, will agree to test                                                               0 (.%)      0 (.%)   351 (35.9%)    157 (52.0%)    45 (16.4%)   110 (35.7%)      663 (35.6%)
Pregnancy test results                                                                                                                                                              
  has documented positive pregnancy test                                                0 (.%)      0 (.%)     11 (3.1%)       3 (1.9%)      1 (2.2%)      1 (0.9%)        16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. collect style header sex preg_test preg_result, level(hide)

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. collect preview 

Participants, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                             Study cohort                                           
                                                                                     DIVIDS     SAM Lusaka     CICADA    NUSTART Lusaka     St-ATT        CLHNS           Total     
                                                                                 N=342 (14.9%) N=98 (4.3%) N=977 (42.4%)  N=302 (13.1%) N=275 (11.9%) N=308 (13.4%) N=2,302 (100.0%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Age (years)                                                                         14.3 (1.3)  13.0 (1.6)   48.2 (11.2)     44.3 (9.7)   51.2 (15.3)    39.6 (0.5)      40.4 (16.4)
[2.2] Participant's sex                                                            173 (50.6%)  49 (50.0%)   570 (58.3%)    197 (65.2%)    85 (30.9%)   111 (36.0%)    1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig        0 (.%)      0 (.%)   351 (35.9%)    157 (52.0%)    45 (16.4%)   110 (35.7%)      663 (35.6%)
Pregnancy test results                                                                  0 (.%)      0 (.%)     11 (3.1%)       3 (1.9%)      1 (2.2%)      1 (0.9%)        16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. collect dims

Collection dimensions
Collection: DTable
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
          _dtable_sample_dim   7         
                      across   2         
                      cmdset   1         
                      cohort   7         
                     colname   4         
           colname_remainder   1         
                     command   1         
                 preg_result   1         
                   preg_test   1         
                      result   10        
                         sex   1         
                     statcmd   6         
                         var   6         

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. collect label list result

  Collection: DTable
   Dimension: result
       Label: Result
Level labels:
   frequency  Frequency
 fvfrequency  Factor-variable frequency
   fvpercent  Factor-variable percent
        mean  Mean
     percent  Percent
          sd  Standard deviation

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable age 2.sex 4.preg_test 2.preg_result if agree ==1, by(cohort) ///
>         title("Participants, by cohort") ///
>         sample(, place(seplabels)) ///
>         nformat("%9.1f" mean sd percent rawpercent fvpercent fvrawpercent) ///
>         sformat("N=%s" frequency) ///
>         export(agree.pdf ,as(pdf) replace)

Participants, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                             Study cohort                                           
                                                                                     DIVIDS     SAM Lusaka     CICADA    NUSTART Lusaka     St-ATT        CLHNS           Total     
                                                                                 N=342 (14.9%) N=98 (4.3%) N=977 (42.4%)  N=302 (13.1%) N=275 (11.9%) N=308 (13.4%) N=2,302 (100.0%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Age (years)                                                                         14.3 (1.3)  13.0 (1.6)   48.2 (11.2)     44.3 (9.7)   51.2 (15.3)    39.6 (0.5)      40.4 (16.4)
[2.2] Participant's sex                                                                                                                                                             
  Female                                                                           173 (50.6%)  49 (50.0%)   570 (58.3%)    197 (65.2%)    85 (30.9%)   111 (36.0%)    1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                                    
  Yes, will agree to test                                                               0 (.%)      0 (.%)   351 (35.9%)    157 (52.0%)    45 (16.4%)   110 (35.7%)      663 (35.6%)
Pregnancy test results                                                                                                                                                              
  has documented positive pregnancy test                                                0 (.%)      0 (.%)     11 (3.1%)       3 (1.9%)      1 (2.2%)      1 (0.9%)        16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. collect label levels var sex "Sex: Female", modify

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. collect preview 

Participants, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                             Study cohort                                           
                                                                                     DIVIDS     SAM Lusaka     CICADA    NUSTART Lusaka     St-ATT        CLHNS           Total     
                                                                                 N=342 (14.9%) N=98 (4.3%) N=977 (42.4%)  N=302 (13.1%) N=275 (11.9%) N=308 (13.4%) N=2,302 (100.0%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Age (years)                                                                         14.3 (1.3)  13.0 (1.6)   48.2 (11.2)     44.3 (9.7)   51.2 (15.3)    39.6 (0.5)      40.4 (16.4)
Sex: Female                                                                                                                                                                         
  Female                                                                           173 (50.6%)  49 (50.0%)   570 (58.3%)    197 (65.2%)    85 (30.9%)   111 (36.0%)    1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                                    
  Yes, will agree to test                                                               0 (.%)      0 (.%)   351 (35.9%)    157 (52.0%)    45 (16.4%)   110 (35.7%)      663 (35.6%)
Pregnancy test results                                                                                                                                                              
  has documented positive pregnancy test                                                0 (.%)      0 (.%)     11 (3.1%)       3 (1.9%)      1 (2.2%)      1 (0.9%)        16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. collect style header sex preg_test preg_result, level(hide)

. collect label levels var sex "Sex: Female", modify

. collect preview 

Participants, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                             Study cohort                                           
                                                                                     DIVIDS     SAM Lusaka     CICADA    NUSTART Lusaka     St-ATT        CLHNS           Total     
                                                                                 N=342 (14.9%) N=98 (4.3%) N=977 (42.4%)  N=302 (13.1%) N=275 (11.9%) N=308 (13.4%) N=2,302 (100.0%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Age (years)                                                                         14.3 (1.3)  13.0 (1.6)   48.2 (11.2)     44.3 (9.7)   51.2 (15.3)    39.6 (0.5)      40.4 (16.4)
Sex: Female                                                                        173 (50.6%)  49 (50.0%)   570 (58.3%)    197 (65.2%)    85 (30.9%)   111 (36.0%)    1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig        0 (.%)      0 (.%)   351 (35.9%)    157 (52.0%)    45 (16.4%)   110 (35.7%)      663 (35.6%)
Pregnancy test results                                                                  0 (.%)      0 (.%)     11 (3.1%)       3 (1.9%)      1 (2.2%)      1 (0.9%)        16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. collect style header sex preg_test preg_result, level(hide)

. collect label levels var sex "Sex: Female", modify

. collect label levels var preg_test "Agreed to Pregancy Test", modify

. collect label levels var preg_result "Pregnancy Test Positive", modify

. collect preview 

Participants, by cohort
---------------------------------------------------------------------------------------------------------------------------
                                                                    Study cohort                                           
                            DIVIDS     SAM Lusaka     CICADA    NUSTART Lusaka     St-ATT        CLHNS           Total     
                        N=342 (14.9%) N=98 (4.3%) N=977 (42.4%)  N=302 (13.1%) N=275 (11.9%) N=308 (13.4%) N=2,302 (100.0%)
---------------------------------------------------------------------------------------------------------------------------
Age (years)                14.3 (1.3)  13.0 (1.6)   48.2 (11.2)     44.3 (9.7)   51.2 (15.3)    39.6 (0.5)      40.4 (16.4)
Sex: Female               173 (50.6%)  49 (50.0%)   570 (58.3%)    197 (65.2%)    85 (30.9%)   111 (36.0%)    1,185 (51.5%)
Agreed to Pregancy Test        0 (.%)      0 (.%)   351 (35.9%)    157 (52.0%)    45 (16.4%)   110 (35.7%)      663 (35.6%)
Pregnancy Test Positive        0 (.%)      0 (.%)     11 (3.1%)       3 (1.9%)      1 (2.2%)      1 (0.9%)        16 (2.4%)
---------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable age 2.sex 4.preg_test 2.preg_result if agree ==1, by(cohort) ///
>         title("Participants, by cohort") ///
>         sample(, place(seplabels)) ///
>         nformat("%9.1f" mean sd percent rawpercent fvpercent fvrawpercent) ///
>         sformat("N=%s" frequency) ///
>         export(agree.pdf ,as(pdf) replace)

Participants, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                             Study cohort                                           
                                                                                     DIVIDS     SAM Lusaka     CICADA    NUSTART Lusaka     St-ATT        CLHNS           Total     
                                                                                 N=342 (14.9%) N=98 (4.3%) N=977 (42.4%)  N=302 (13.1%) N=275 (11.9%) N=308 (13.4%) N=2,302 (100.0%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Age (years)                                                                         14.3 (1.3)  13.0 (1.6)   48.2 (11.2)     44.3 (9.7)   51.2 (15.3)    39.6 (0.5)      40.4 (16.4)
[2.2] Participant's sex                                                                                                                                                             
  Female                                                                           173 (50.6%)  49 (50.0%)   570 (58.3%)    197 (65.2%)    85 (30.9%)   111 (36.0%)    1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                                    
  Yes, will agree to test                                                               0 (.%)      0 (.%)   351 (35.9%)    157 (52.0%)    45 (16.4%)   110 (35.7%)      663 (35.6%)
Pregnancy test results                                                                                                                                                              
  has documented positive pregnancy test                                                0 (.%)      0 (.%)     11 (3.1%)       3 (1.9%)      1 (2.2%)      1 (0.9%)        16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. help datasignature

. help dyndoc

. help markdown

. do "/var/folders/kc/czh6lr110kj_15njdnljmx8w0000gn/T//SD43926.000000"

. dtable age ///
>         2.sex 4.preg_test 2.preg_result if agree ==1, by(cohort) ///
>         title("Participants, by cohort") ///
>         sample(, place(seplabels)) ///
>         nformat("%9.1f" mean sd percent rawpercent fvpercent fvrawpercent) ///
>         sformat("N=%s" frequency) ///
>         export(agree.pdf ,as(pdf) replace)

Participants, by cohort
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                                             Study cohort                                           
                                                                                     DIVIDS     SAM Lusaka     CICADA    NUSTART Lusaka     St-ATT        CLHNS           Total     
                                                                                 N=342 (14.9%) N=98 (4.3%) N=977 (42.4%)  N=302 (13.1%) N=275 (11.9%) N=308 (13.4%) N=2,302 (100.0%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Age (years)                                                                         14.3 (1.3)  13.0 (1.6)   48.2 (11.2)     44.3 (9.7)   51.2 (15.3)    39.6 (0.5)      40.4 (16.4)
[2.2] Participant's sex                                                                                                                                                             
  Female                                                                           173 (50.6%)  49 (50.0%)   570 (58.3%)    197 (65.2%)    85 (30.9%)   111 (36.0%)    1,185 (51.5%)
[1.12] Is the person willing to have a pregnancy test in order to determine elig                                                                                                    
  Yes, will agree to test                                                               0 (.%)      0 (.%)   351 (35.9%)    157 (52.0%)    45 (16.4%)   110 (35.7%)      663 (35.6%)
Pregnancy test results                                                                                                                                                              
  has documented positive pregnancy test                                                0 (.%)      0 (.%)     11 (3.1%)       3 (1.9%)      1 (2.2%)      1 (0.9%)        16 (2.4%)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(collection DTable exported to file agree.pdf)

. 
end of do-file

. scatter age ct_pan_cc_head

. sum ct_pan_cc_head, detail

            Diameter of Pancreas head measured in
                       Cranial-Caudal
-------------------------------------------------------------
      Percentiles      Smallest
 1%         1.84           1.55
 5%         2.06           1.71
10%          2.3           1.84       Obs                 242
25%         2.62           1.87       Sum of wgt.         242

50%        3.025                      Mean           3.473347
                        Largest       Std. dev.      6.647697
75%         3.43           4.92
90%         3.82           5.25       Variance       44.19187
95%         4.05           5.77       Skewness       15.25238
99%         5.25            106       Kurtosis       235.7461

. scatter age ct_pan_cc_head if ct_pan_cc_head !=.

. scatter age ct_pan_cc_head if ct_pan_cc_head < 100

. scatter age ct_pan_cc_head if ct_pan_cc_head < 100, colorvar(cohort)

. scatter age ct_pan_cc_head if ct_pan_cc_head < 100 if cohort==6, colorvar(cohort)
invalid syntax
r(198);

. scatter age ct_pan_cc_head if ct_pan_cc_head < 100 & cohort==6, colorvar(cohort)

. scatter age ct_pan_cc_head if ct_pan_cc_head < 100 & cohort==5, colorvar(cohort)

. scatter age ct_pan_cc_head if ct_pan_cc_head < 100, colorvar(cohort)

. net search ridgeplot
(contacting http://www.stata.com)

1 package found (Stata Journal listed first)
--------------------------------------------

joy_plot from http://fmwww.bc.edu/RePEc/bocode/j
    'JOY_PLOT': module to produce joy plots / joy_plot is a command that can
    be used to create joyplots, also / known as ridgeplots.  / KW: graphics /
    KW: joy plot / KW: ridgeplot / Requires: Stata version 14.2 and palettes,
    colrspace from SSC (q.v.) / Distribution-Date: 20220610 / Author: Fernando


. joyplot ct_pan_cc_head < 100, over(cohort)
command joyplot is unrecognized
r(199);

. joy_plot ct_pan_cc_head < 100, over(cohort)
< invalid name
r(198);

. joy_plot ct_pan_cc_head < 100, over(cohort)
< invalid name
r(198);

. help joyplot

. help joyplot

. joyplot ct_pan_cc_head < 100, over(cohort)
< invalid name
r(198);

. joyplot ct_pan_cc_head if ct_pan_cc_head < 100, over(cohort)
option by() required
r(198);

. joyplot ct_pan_cc_head if ct_pan_cc_head < 100, by(cohort)

. ssc install palettes, replace
checking palettes consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install colrspace, replace
checking colrspace consistency and verifying not already installed...
all files already exist and are up to date.

. joyplot ct_pan_cc_head if ct_pan_cc_head < 100, by(cohort)
variable y5 not found
r(111);

. ado update, update
note: ado update updates community-contributed files; type update to check for updates to official Stata.

Checking status of installed packages:

    [1] graph3d at http://fmwww.bc.edu/repec/bocode/g:
        installed package is up to date

    [2] surface at http://fmwww.bc.edu/repec/bocode/s:
        installed package is up to date

    [3] heatplot at http://fmwww.bc.edu/RePEc/bocode/h:
        installed package is up to date

    [4] palettes at http://fmwww.bc.edu/repec/bocode/p:
        installed package is up to date

    [5] colrspace at http://fmwww.bc.edu/repec/bocode/c:
        installed package is up to date

    [6] grstyle at http://fmwww.bc.edu/RePEc/bocode/g:
        installed package is up to date

    [7] fitstat at http://fmwww.bc.edu/RePEc/bocode/f:
        installed package is up to date

    [8] stripplot at http://fmwww.bc.edu/RePEc/bocode/s:
        installed package is up to date

    [9] egenmore at http://fmwww.bc.edu/RePEc/bocode/e:
        installed package is up to date

   [10] autorename at http://fmwww.bc.edu/RePEc/bocode/a:
        installed package is up to date

   [11] gtools at http://fmwww.bc.edu/RePEc/bocode/g:
        package has been updated on server

   [12] fastreshape at http://fmwww.bc.edu/repec/bocode/f:
        installed package is up to date

   [13] reghdfe at http://fmwww.bc.edu/repec/bocode/r:
        installed package is up to date

   [14] ftools at http://fmwww.bc.edu/repec/bocode/f:
        installed package is up to date

   [15] st0678 at http://www.stata-journal.com/software/sj22-2:
        installed package is up to date

   [16] powerlog at https://stats.oarc.ucla.edu/stat/stata/ado/analysis:
        installed package is up to date

   [17] dm0085_2 at http://www.stata-journal.com/software/sj20-4:
        package has been updated on server

   [18] csvconvert at http://fmwww.bc.edu/RePEc/bocode/c:
        installed package is up to date

   [19] fre at http://fmwww.bc.edu/RePEc/bocode/f:
        installed package is up to date

   [20] hmap at http://fmwww.bc.edu/repec/bocode/h:
        installed package is up to date

   [21] asdoc at http://fintechprofessor.com:
        cannot tell because distribution dates not provided by source

   [22] tabout at http://fmwww.bc.edu/RePEc/bocode/t:
        installed package is up to date

   [23] nwcommands-ado at http://www.nwcommands.org:
        installed package is up to date

   [24] nwcommands-hlp at http://www.nwcommands.org:
        installed package is up to date

   [25] netplot at http://fmwww.bc.edu/repec/bocode/n:
        installed package is up to date

   [26] kaputil at http://fmwww.bc.edu/RePEc/bocode/k:
        installed package is up to date

   [27] sxd3_1 at http://www.stata-journal.com/software/sj2-4:
        installed package is up to date

   [28] sskapp at http://fmwww.bc.edu/repec/bocode/s:
        installed package is up to date

   [29] dm0042_3 at http://www.stata-journal.com/software/sj20-4:
        package has been updated on server

   [30] mvfiles at http://fmwww.bc.edu/RePEc/bocode/m:
        installed package is up to date

   [31] rmfiles at http://fmwww.bc.edu/RePEc/bocode/r:
        installed package is up to date

   [32] table1_mc at http://fmwww.bc.edu/RePEc/bocode/t:
        installed package is up to date

   [33] wordcb at http://fmwww.bc.edu/repec/bocode/w:
        installed package is up to date

   [34] joy_plot at http://fmwww.bc.edu/RePEc/bocode/j:
        installed package is up to date

   [35] joyplot at http://fmwww.bc.edu/RePEc/bocode/j:
        installed package is up to date

   [36] labutil at http://fmwww.bc.edu/repec/bocode/l:
        installed package is up to date

Packages to be updated are

   [11] gtools       -- 'GTOOLS': module to provide a fast implementation of common group commands
   [17] dm0085_2     -- SJ20-4 dm0085_2. Update: A set of utilities for ...
   [29] dm0042_3     -- SJ20-4 dm0042_3. Update: Report number(s) of distinct ...

Installing updates ...

   [11] gtools
   [17] dm0085_2 using dm0085_3
   [29] dm0042_3 using dm0042_4

Cleaning up ... Done

. joyplot ct_pan_cc_head if ct_pan_cc_head < 100, by(cohort)
variable y5 not found
r(111);

. pwd
/Users/juansolon/Downloads

. help missings

. help missingsplot

. help missingplot

. missingplot age

. missingplot 
note: only first 20 variables plotted

. help missings

. sum ct_pan_shape

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
ct_pan_shape |        330    1.030303    .2184288          1          3

. tab ct_pan_shape

       [14.19] Pancreas shape |      Freq.     Percent        Cum.
------------------------------+-----------------------------------
                       Normal |        323       97.88       97.88
                        Small |          4        1.21       99.09
                     Enlarged |          3        0.91      100.00
------------------------------+-----------------------------------
                        Total |        330      100.00

. tab ct_pan_shape cohort, chi

     [14.19] Pancreas |                Study cohort
                shape |    CICADA  NUSTART L     St-ATT      CLHNS |     Total
----------------------+--------------------------------------------+----------
               Normal |        53         72         98        100 |       323 
                Small |         1          2          1          0 |         4 
             Enlarged |         2          0          1          0 |         3 
----------------------+--------------------------------------------+----------
                Total |        56         74        100        100 |       330 

          Pearson chi2(6) =   8.8234   Pr = 0.184

. label list
ct_problem:
           1 Bowel gas
           2 Obese participant
           3 Participant uncooperative
           4 Others, specify
ct_image_qual:
           1 Optimal
           2 Non-optimal
ct_pan_oth_abnormal:
           0 No
           1 Yes, specify
ct_pan_calci_place:
           1 Parenchymal
           2 Per-pancreas
ct_pan_calci:
           0 Absent
           1 Present
           3 Can't see well enough to tell
ct_pan_duct_mass:
           0 No
           1 Yes
ct_pan_duct_stones:
           0 No
           1 Yes
ct_pan_duct:
           1 Normal
           2 Abnormal
           3 Can't see well enough to tell
ct_pan_paren_steatosis:
           0 No
           1 Yes
ct_pan_paren_fibrosis:
           0 No
           1 Yes
ct_pan_paren_inflam:
           0 No
           1 Yes
ct_pan_parenchyma:
           1 Normal
           2 Abnormal
           3 Can't see well enough to tell
ct_pan_contour_problem:
           1  Irregular border
           2  Lobulated
           3 Other contour problem, specify
ct_pan_contour:
           1 Normal/Smooth
           2 Abnormal
           3 Can't see well enough to tell
ct_pan_shape_problem:
           1 Imbalance in size of head compared to tail
           2 Other shape abnormality, specify
ct_pan_shape:
           1 Normal
           2 Small
           3  Enlarged
           4 Can't see well enough to tell
ct_pan_size_qual:
           1 Normal
           2 Small
           3  Enlarged
           4 Can't see well enough to tell
ct_scan:
        -103 Equipment NA
        -102 Absconded
        -100 Pending
         -98 Refused
           0 No
           1 Yes
grip_dominanthand:
           1 Right
           2 Left
           3 Ambidextrous
grip_unit_r:
           1 kg
           2 N
grip_unit_l:
           1 kg
           2 N
menstruate:
         -98 Refused
         -97 Don't know
           0 No
           1 Yes
tanner:
         -98 Refused
         -97 Don't know
           1 1
           2 2
           3 3
           4 4
           5 5
           9 9
tanner_method:
           1 ,Direct observation by study staff
           2 Boy pointed to the diagram which represents his stage
bmi_cat:
           1 Underweight
           2 Normal Weight
           3 Overweight
           4 Obese
chair:
           0 No
           1 Yes
table:
           0 No
           1 Yes
tractor:
           0 No
           1 Yes
boat:
           0 No
           1 Yes
car:
           0 No
           1 Yes
motorcycle:
           0 No
           1 Yes
bike:
           0 No
           1 Yes
poultry_own:
           0 No
           1 Yes
goat:
           0 No
           1 Yes
pig:
           0 No
           1 Yes
cow:
           0 No
           1 Yes
sewing:
           0 No
           1 Yes
ac:
           0 No
           1 Yes
efan:
           0 No
           1 Yes
cellphone:
           0 No
           1 Yes
phone:
           0 No
           1 Yes
radio:
           0 No
           1 Yes
stove:
           0 No
           1 Yes
computer:
           0 No
           1 Yes
wmachine:
           0 No
           1 Yes
ref:
           0 No
           1 Yes
tv:
           0 No
           1 Yes
vcd:
           0 No
           1 Yes
toilet:
           1 Own Flush toilet
           2 Own Ventilated pit latrine
           3 Own Pit latrine
           4 Shared/ public Flush toilet
           5 Shared/ public Ventilated pit latrine
           6 Shared/ public Pit latrine
           7 None-we defecate in the bush/field
           8 Others, Specify
water:
           1 Piped private source
           2 Private tube well or borehole
           3 Piped public or communal source
           4 Public tube well or borehole
           5 Unprotected well
           6 Tanker or other water delivery
           7 Surface water
           8 Others, Specify
electric:
           1 Yes, own source
           2 Yes, tap from neighbor or other joint sources
           3 No
           4 Others, specify
fuel:
           1 Electricity
           2 Liquefied petroleum Gas (LPG)
           3 Natural gas
           4 Kerosene
           5 Charcoal
           6  Wood
           7 Biomass/Agricultural Crop
           8 Animal Dung
           9 Others, Specify
cook:
           1 In separate room/kitchen in the house
           2 In the main room of the house
           3 Indoor corridor
           4 In a separate building
           5 Outdoors
           6 Others
house:
           1 High quality material throughout including roof, walls and floor
           2 Partly low quality and partly high quality
           3 Made from mud, thatch or other low quality materials
           4 Others, specify
tenurhws:
           1 Own
           2 Rent
           3 Free (caretaker, owned by parents/relatives)
           4 Squat (settle in public/private dwelling units
           5 Others, Specify:{tenurhws_o:icons}
dwelltype:
           1 Single house
           2 Apartment /Condo/Tenement
           3 Makeshift/Barong-barong
           4 Others, Specify
employ_mother:
         -97 Don't know
           1 Professional (eg. teacher/doctor/engineer)
           2 Salaried office other than professional
           3 Self-employed or owns small business
           4 Salaried manual work
           5 Casual labour
           6 Household work
           7 Retired
           8 Unemployed [looking for a job]
employ_father:
         -97 Don't know
           1 Professional (eg. teacher/doctor/engineer)
           2 Salaried office other than professional
           3 Self-employed or owns small business
           4 Salaried manual work
           5 Casual labour
           6 Household work
           7 Retired
           8 Unemployed [looking for a job]
employ:
           1 Professional (eg. teacher/doctor/engineer)
           2 Salaried office other than professional
           3 Self-employed or owns small business
           4 Salaried manual work
           5 Casual labour
           6 Household work
           7 Retired
           8 Unemployed [looking for a job]
edu_child:
           1 Government school
           2 Fee-paying school
           3 Not in school
edu_mother:
         -97 Don't know
           1 No education/kindergarten
           2 Some primary
           3 Completed primary (with or without some secondary)
           4 Completed (ordinary) secondary
           5 Completed advance secondary (Tanzania only)
           6 Post-secondary vocational or other non-university education
           7 Completed university
edu_father:
         -97 Don't know
           1 No education/kindergarten
           2 Some primary
           3 Completed primary (with or without some secondary)
           4 Completed (ordinary) secondary
           5 Completed advance secondary (Tanzania only)
           6 Post-secondary vocational or other non-university education
           7 Completed university
education:
           1 No education/kindergarten
           2 Some primary
           3 Completed primary (with or without some secondary)
           4 Completed (ordinary) secondary
           5 Completed advance secondary (Tanzania only)
           6 Post-secondary vocational or other non-university education
           7 Completed university
marital:
           1 Married/cohabiting
           2 Single/Never married
           3 Divorced/Annulled/Separated
           4 Widow/widower
re_dwelltype:
           1 Single house
           2 Apartment /Condo/Tenement
           3 Makeshift/Barong-barong
           4 Others, Specify
re_tenurhws:
           1 Own
           2 Rent
           3 Free (caretaker, owned by parents/relatives)
           4 Squat (settle in public/private dwelling units
           5 Others, Specify
re_fuel:
           1 Electricity
           2 Liquefied petroleum Gas (LPG)
           3 Natural gas
           4 Kerosene
           5 Charcoal
           6  Wood
           7 Biomass/Agricultural Crop
           8 Animal Dung
           9 Others, Specify
re_electric:
           1 Yes, own source
           2 Yes, tap from neighbor or other joint sources
           3 No
           4 Others, specify
re_water:
           1 Piped private source
           2 Private tube well or borehole
           3 Piped public or communal source
           4 Public tube well or borehole
           5 Unprotected well
           6 Tanker or other water delivery
           7 Surface water
           8 Others, Specify
re_toilet:
           1 Own Flush toilet
           2 Own Ventilated pit latrine
           3 Own Pit latrine
           4 Shared/ public Flush toilet
           5 Shared/ public Ventilated pit latrine
           6 Shared/ public Pit latrine
           7 None-we defecate in the bush/field
           8 Others, Specify
solar:
           0 No
           1 Yes
agree:
           0 No, they do not agree
           1 Yes, they agree
           2 Unable to contact participant
           3 Undecided
tr_reas_noc_phone3:
           1 wrong phone number
           2 incorrect email
           3 address changed
           4 Others {tr_reas_other1}
tr_method3:
           1 cellphone
           2 telephone
           3 email
           4 home visit
tr_contact3:
           0  No
           1 Yes
tr_reas_noc_phone2:
           1 wrong phone number
           2 incorrect email
           3 address changed
           4 Others {tr_reas_other1}
tr_method2:
           1 cellphone
           2 telephone
           3 email
           4 home visit
tr_contact2:
           0  No
           1 Yes
tr_reas_noc_phone1:
           1 wrong phone number
           2 incorrect email
           3 address changed
           4 Others {tr_reas_other1}
tr_method1:
           1 cellphone
           2 telephone
           3 email
           4 home visit
tr_contact1:
           0  No
           1 Yes
confirm___1:
           0  No
           1 Yes
sex:
           1 Male
           2 Female
cohort:
           1  DIVIDS
           2 SAM Lusaka
           3 CICADA
           4 NUSTART Lusaka
           5 St-ATT
           6 CLHNS
languages:
           1 English
           2 Swahili
           3 Cebuano
           4 Hiligaynon
uss:
           0  No
           1 Yes
           2 Not randomized to Ultrasound
uss_sample:
           0  No
           1 Yes
ct:
           0  No
           1 Yes
           2 Not randomized to CT scan
ct_sample:
           0  No
           1 Yes
indepth_exp:
           0  No
           1 Yes
indepth_sample:
           0  No
           1 Yes
flag_preg:
           0 children cohort
           1 pregnant or has a positive pregnancy test result
           2 male or if female, in post-menopausal or has negative pregnancy test result
           3 did not agree to do pregnancy test
preg_result:
           1 has documented negative pregnancy test performed by SAMPA
           2 has documented positive pregnancy test
preg_test:
           1 No, is male
           2 No, is female, and says they are post-menopausal
           3 No, since they already know they are pregnant
           4 Yes, will agree to test
assent:
           0  No
           1 Yes
consent_basic:
           1 Consents to standard OGTT¬
           2 Consents to basic OGTT¬
           3 Does not consent to either of the above
insulin_dep:
           0  No
           1 Yes
rec_diab:
           0  No
           1 Yes, uncomplicated
           2  Yes with complications
explain___1:
           0  No
           1 Yes
cont_art:
           1 Not HIV-infected
           2 Yes
           3 HIV-infected but not on ART
cont_hiv_test:
           1  Known HIV-infected from ART clinic
           2  Willing to test for HIV and is positive
           3 Willing to test for HIV and is negative
           4 Refuses HIV test
cont_mald:
           0  No
           1 Yes
cont_site:
           1 From a local ART clinic
           2 Neighbour
           3 Sibling
           4 Other
cont_age:
           0  No
           1 Yes
control:
           0  No
           1 Yes
_merge:
           1 Master only (1)
           2 Using only (2)
           3 Matched (3)
           4 Missing updated (4)
           5 Nonmissing conflict (5)
radio_exam:
        -103 Equipment NA
        -102 Absconded
        -100 Pending
         -99 Refused
           0  No
           1 Yes
pan_size_normal:
           1 Normal
           2 Abnormal
pan_size_qual:
           1 Normal
           2 Small
           3 Enlarged
           4 Can't see well enough to tell
pan_shape:
           1 Normal
           2 Abnormal
           3 Can't see well enough to tell
pan_shape_problem:
           1  Imbalance in size of head compared to tail
           2 Other shape abnormality, specify
pan_contour:
           1 Normal/Smooth
           2 Abnormal
           3 Can't see well enough to tell
pan_contour_problem:
           1 Irregular border
           2 Lobulated
           3 Other contour problem, specify
pan_parenchyma:
           1 Normal
           2 Abnormal
           3 Can't see well enough to tell
pan_paren_inflam:
           0  No
           1 Yes
pan_paren_fibrosis:
           0  No
           1 Yes
pan_paren_steatosis:
           0  No
           1 Yes
pan_duct_normal:
           1 Normal
           2 Abnormal
pan_duct:
           1 Normal
           2 Abnormal
           3 Can't see well enough to tell
pan_duct_stones:
           0  No
           1 Yes
pan_duct_mass:
           0  No
           1 Yes
pan_peri_normal:
           1 Normal
           2 Abnormal
pan_calci:
           0 Absent
           1 Present
           3 Can't see well enough to tell
pan_calci_place:
           1  Parenchymal
           2 Peripancreatic
pan_cyst:
           0  No
           1 Yes
pan_collect:
           0  No
           1 Yes
pan_fluid:
           0  No
           1 Yes
pan_masses:
           0 No
           1 Yes
pan_oth_abnormal:
           0 No
           1 Yes, specify
image_qual_uss:
           1 Optimal
           2 Non-optimal
image_not_optimal:
           1 Bowel gas
           2 Obese participant
           3 Participant uncooperative
           4 Others, specify
uss_problem:
           0 No
           1 Yes

. labelbook

-----------------------------------------------------------------------------------------------------------------------
Value label _merge 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,5]                     String length:  [11,23]
           N:  5                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Master only (1)
           2   Using only (2)
           3   Matched (3)
           4   Missing updated (4)
           5   Nonmissing conflict (5)

   Variables:  


-----------------------------------------------------------------------------------------------------------------------
Value label ac 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  ac


-----------------------------------------------------------------------------------------------------------------------
Value label agree 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,3]                     String length:  [9,29]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No, they do not agree
           1   Yes, they agree
           2   Unable to contact participant
           3   Undecided

   Variables:  agree


-----------------------------------------------------------------------------------------------------------------------
Value label assent 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  assent


-----------------------------------------------------------------------------------------------------------------------
Value label bike 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  bike


-----------------------------------------------------------------------------------------------------------------------
Value label bmi_cat 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [5,13]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Underweight
           2   Normal Weight
           3   Overweight
           4   Obese

   Variables:  bmi_cat_child bmi_cat


-----------------------------------------------------------------------------------------------------------------------
Value label boat 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  boat


-----------------------------------------------------------------------------------------------------------------------
Value label car 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  car


-----------------------------------------------------------------------------------------------------------------------
Value label cellphone 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  cellphone


-----------------------------------------------------------------------------------------------------------------------
Value label chair 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  chair


-----------------------------------------------------------------------------------------------------------------------
Value label cohort 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,6]                     String length:  [5,14]
           N:  6                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           1   DIVIDS
           2   SAM Lusaka
           3   CICADA
           4   NUSTART Lusaka
           5   St-ATT
           6   CLHNS

   Variables:  cohort


-----------------------------------------------------------------------------------------------------------------------
Value label computer 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  computer


-----------------------------------------------------------------------------------------------------------------------
Value label confirm___1 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  confirm


-----------------------------------------------------------------------------------------------------------------------
Value label consent_basic 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [24,39]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  no
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Consents to standard OGTT¬
           2   Consents to basic OGTT¬
           3   Does not consent to either of the above

   Variables:  consent_basic


-----------------------------------------------------------------------------------------------------------------------
Value label cont_age 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  cont_age


-----------------------------------------------------------------------------------------------------------------------
Value label cont_art 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [3,27]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Not HIV-infected
           2   Yes
           3   HIV-infected but not on ART

   Variables:  cont_art


-----------------------------------------------------------------------------------------------------------------------
Value label cont_hiv_test 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [16,40]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           1   Known HIV-infected from ART clinic
           2   Willing to test for HIV and is positive
           3   Willing to test for HIV and is negative
           4   Refuses HIV test

   Variables:  cont_hiv_test


-----------------------------------------------------------------------------------------------------------------------
Value label cont_mald 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  cont_mald


-----------------------------------------------------------------------------------------------------------------------
Value label cont_site 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [5,23]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   From a local ART clinic
           2   Neighbour
           3   Sibling
           4   Other

   Variables:  cont_site


-----------------------------------------------------------------------------------------------------------------------
Value label control 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  control


-----------------------------------------------------------------------------------------------------------------------
Value label cook 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,6]                     String length:  [6,37]
           N:  6                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   In separate room/kitchen in the house
           2   In the main room of the house
           3   Indoor corridor
           4   In a separate building
           5   Outdoors
           6   Others

   Variables:  cook


-----------------------------------------------------------------------------------------------------------------------
Value label cow 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  cow


-----------------------------------------------------------------------------------------------------------------------
Value label ct 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,2]                     String length:  [3,25]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes
           2   Not randomized to CT scan

   Variables:  ct


-----------------------------------------------------------------------------------------------------------------------
Value label ct_image_qual 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [7,11]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Optimal
           2   Non-optimal

   Variables:  ct_image_qual


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_calci 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,3]                     String length:  [6,29]
           N:  3                 Unique at full length:  yes
        Gaps:  yes                 Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   Absent
           1   Present
           3   Can't see well enough to tell

   Variables:  ct_pan_calci


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_calci_place 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [11,12]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Parenchymal
           2   Per-pancreas

   Variables:  ct_pan_calci_place


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_contour 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [8,29]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Normal/Smooth
           2   Abnormal
           3   Can't see well enough to tell

   Variables:  ct_pan_contour


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_contour_problem 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [10,30]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           1   Irregular border
           2   Lobulated
           3   Other contour problem, specify

   Variables:  ct_pan_contour_problem


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_duct 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [6,29]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Normal
           2   Abnormal
           3   Can't see well enough to tell

   Variables:  ct_pan_duct


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_duct_mass 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  ct_pan_duct_mass


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_duct_stones 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  ct_pan_duct_stones


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_oth_abnormal 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,12]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes, specify

   Variables:  ct_pan_oth_abnormal


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_paren_fibrosis 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  ct_pan_paren_fibrosis


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_paren_inflam 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  ct_pan_paren_inflam


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_paren_steatosis 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  ct_pan_paren_steatosis


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_parenchyma 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [6,29]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Normal
           2   Abnormal
           3   Can't see well enough to tell

   Variables:  ct_pan_parenchyma


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_shape 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [5,29]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           1   Normal
           2   Small
           3   Enlarged
           4   Can't see well enough to tell

   Variables:  ct_pan_shape


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_shape_problem 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [32,42]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Imbalance in size of head compared to tail
           2   Other shape abnormality, specify

   Variables:  ct_pan_shape_problem


-----------------------------------------------------------------------------------------------------------------------
Value label ct_pan_size_qual 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [5,29]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           1   Normal
           2   Small
           3   Enlarged
           4   Can't see well enough to tell

   Variables:  ct_pan_size_qual


-----------------------------------------------------------------------------------------------------------------------
Value label ct_problem 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [9,25]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Bowel gas
           2   Obese participant
           3   Participant uncooperative
           4   Others, specify

   Variables:  ct_problem


-----------------------------------------------------------------------------------------------------------------------
Value label ct_sample 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  ct_sample


-----------------------------------------------------------------------------------------------------------------------
Value label ct_scan 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [-103,1]                  String length:  [2,12]
           N:  6                 Unique at full length:  yes
        Gaps:  yes                 Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
        -103   Equipment NA
        -102   Absconded
        -100   Pending
         -98   Refused
           0   No
           1   Yes

   Variables:  ct_scan


-----------------------------------------------------------------------------------------------------------------------
Value label dwelltype 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [12,25]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Single house
           2   Apartment /Condo/Tenement
           3   Makeshift/Barong-barong
           4   Others, Specify

   Variables:  dwelltype


-----------------------------------------------------------------------------------------------------------------------
Value label edu_child 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [13,17]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Government school
           2   Fee-paying school
           3   Not in school

   Variables:  edu_child


-----------------------------------------------------------------------------------------------------------------------
Value label edu_father 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [-97,7]                   String length:  [10,59]
           N:  8                 Unique at full length:  yes
        Gaps:  yes                 Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
         -97   Don't know
           1   No education/kindergarten
           2   Some primary
           3   Completed primary (with or without some secondary)
           4   Completed (ordinary) secondary
           5   Completed advance secondary (Tanzania only)
           6   Post-secondary vocational or other non-university education
           7   Completed university

   Variables:  edu_father


-----------------------------------------------------------------------------------------------------------------------
Value label edu_mother 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [-97,7]                   String length:  [10,59]
           N:  8                 Unique at full length:  yes
        Gaps:  yes                 Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
         -97   Don't know
           1   No education/kindergarten
           2   Some primary
           3   Completed primary (with or without some secondary)
           4   Completed (ordinary) secondary
           5   Completed advance secondary (Tanzania only)
           6   Post-secondary vocational or other non-university education
           7   Completed university

   Variables:  edu_mother


-----------------------------------------------------------------------------------------------------------------------
Value label education 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,7]                     String length:  [12,59]
           N:  7                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   No education/kindergarten
           2   Some primary
           3   Completed primary (with or without some secondary)
           4   Completed (ordinary) secondary
           5   Completed advance secondary (Tanzania only)
           6   Post-secondary vocational or other non-university education
           7   Completed university

   Variables:  education


-----------------------------------------------------------------------------------------------------------------------
Value label efan 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  efan


-----------------------------------------------------------------------------------------------------------------------
Value label electric 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [2,45]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Yes, own source
           2   Yes, tap from neighbor or other joint sources
           3   No
           4   Others, specify

   Variables:  electric


-----------------------------------------------------------------------------------------------------------------------
Value label employ 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,8]                     String length:  [7,42]
           N:  8                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Professional (eg. teacher/doctor/engineer)
           2   Salaried office other than professional
           3   Self-employed or owns small business
           4   Salaried manual work
           5   Casual labour
           6   Household work
           7   Retired
           8   Unemployed [looking for a job]

   Variables:  employ


-----------------------------------------------------------------------------------------------------------------------
Value label employ_father 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [-97,8]                   String length:  [7,42]
           N:  9                 Unique at full length:  yes
        Gaps:  yes                 Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
         -97   Don't know
           1   Professional (eg. teacher/doctor/engineer)
           2   Salaried office other than professional
           3   Self-employed or owns small business
           4   Salaried manual work
           5   Casual labour
           6   Household work
           7   Retired
           8   Unemployed [looking for a job]

   Variables:  employ_father


-----------------------------------------------------------------------------------------------------------------------
Value label employ_mother 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [-97,8]                   String length:  [7,42]
           N:  9                 Unique at full length:  yes
        Gaps:  yes                 Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
         -97   Don't know
           1   Professional (eg. teacher/doctor/engineer)
           2   Salaried office other than professional
           3   Self-employed or owns small business
           4   Salaried manual work
           5   Casual labour
           6   Household work
           7   Retired
           8   Unemployed [looking for a job]

   Variables:  employ_mother


-----------------------------------------------------------------------------------------------------------------------
Value label explain___1 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  explain


-----------------------------------------------------------------------------------------------------------------------
Value label flag_preg 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,3]                     String length:  [15,75]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   children cohort
           1   pregnant or has a positive pregnancy test result
           2   male or if female, in post-menopausal or has negative pregnancy test result
           3   did not agree to do pregnancy test

   Variables:  flag_preg


-----------------------------------------------------------------------------------------------------------------------
Value label fuel 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,9]                     String length:  [5,29]
           N:  9                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           1   Electricity
           2   Liquefied petroleum Gas (LPG)
           3   Natural gas
           4   Kerosene
           5   Charcoal
           6   Wood
           7   Biomass/Agricultural Crop
           8   Animal Dung
           9   Others, Specify

   Variables:  fuel


-----------------------------------------------------------------------------------------------------------------------
Value label goat 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  goat


-----------------------------------------------------------------------------------------------------------------------
Value label grip_dominanthand 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [4,12]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Right
           2   Left
           3   Ambidextrous

   Variables:  grip_dominanthand


-----------------------------------------------------------------------------------------------------------------------
Value label grip_unit_l 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [1,2]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   kg
           2   N

   Variables:  grip_unit_l


-----------------------------------------------------------------------------------------------------------------------
Value label grip_unit_r 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [1,2]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   kg
           2   N

   Variables:  grip_unit_r


-----------------------------------------------------------------------------------------------------------------------
Value label house 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [15,64]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   High quality material throughout including roof, walls and floor
           2   Partly low quality and partly high quality
           3   Made from mud, thatch or other low quality materials
           4   Others, specify

   Variables:  house


-----------------------------------------------------------------------------------------------------------------------
Value label image_not_optimal 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [9,25]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Bowel gas
           2   Obese participant
           3   Participant uncooperative
           4   Others, specify

   Variables:  image_not_optimal


-----------------------------------------------------------------------------------------------------------------------
Value label image_qual_uss 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [7,11]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Optimal
           2   Non-optimal

   Variables:  image_qual_uss


-----------------------------------------------------------------------------------------------------------------------
Value label indepth_exp 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  indepth_exp


-----------------------------------------------------------------------------------------------------------------------
Value label indepth_sample 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  indepth_sample


-----------------------------------------------------------------------------------------------------------------------
Value label insulin_dep 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  insulin_dep


-----------------------------------------------------------------------------------------------------------------------
Value label languages 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [7,10]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   English
           2   Swahili
           3   Cebuano
           4   Hiligaynon

   Variables:  languages


-----------------------------------------------------------------------------------------------------------------------
Value label marital 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [13,27]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Married/cohabiting
           2   Single/Never married
           3   Divorced/Annulled/Separated
           4   Widow/widower

   Variables:  marital


-----------------------------------------------------------------------------------------------------------------------
Value label menstruate 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [-98,1]                   String length:  [2,10]
           N:  4                 Unique at full length:  yes
        Gaps:  yes                 Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
         -98   Refused
         -97   Don't know
           0   No
           1   Yes

   Variables:  menstruate


-----------------------------------------------------------------------------------------------------------------------
Value label motorcycle 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  motorcycle


-----------------------------------------------------------------------------------------------------------------------
Value label pan_calci 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,3]                     String length:  [6,29]
           N:  3                 Unique at full length:  yes
        Gaps:  yes                 Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   Absent
           1   Present
           3   Can't see well enough to tell

   Variables:  pan_calci


-----------------------------------------------------------------------------------------------------------------------
Value label pan_calci_place 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [12,14]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           1   Parenchymal
           2   Peripancreatic

   Variables:  pan_calci_place


-----------------------------------------------------------------------------------------------------------------------
Value label pan_collect 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  pan_collect


-----------------------------------------------------------------------------------------------------------------------
Value label pan_contour 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [8,29]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Normal/Smooth
           2   Abnormal
           3   Can't see well enough to tell

   Variables:  pan_contour


-----------------------------------------------------------------------------------------------------------------------
Value label pan_contour_problem 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [9,30]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Irregular border
           2   Lobulated
           3   Other contour problem, specify

   Variables:  pan_contour_problem


-----------------------------------------------------------------------------------------------------------------------
Value label pan_cyst 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  pan_cyst


-----------------------------------------------------------------------------------------------------------------------
Value label pan_duct 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [6,29]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Normal
           2   Abnormal
           3   Can't see well enough to tell

   Variables:  pan_duct


-----------------------------------------------------------------------------------------------------------------------
Value label pan_duct_mass 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  pan_duct_mass


-----------------------------------------------------------------------------------------------------------------------
Value label pan_duct_normal 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [6,8]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Normal
           2   Abnormal

   Variables:  pan_duct_normal


-----------------------------------------------------------------------------------------------------------------------
Value label pan_duct_stones 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  pan_duct_stones


-----------------------------------------------------------------------------------------------------------------------
Value label pan_fluid 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  pan_fluid


-----------------------------------------------------------------------------------------------------------------------
Value label pan_masses 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  pan_masses


-----------------------------------------------------------------------------------------------------------------------
Value label pan_oth_abnormal 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,12]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes, specify

   Variables:  pan_oth_abnormal


-----------------------------------------------------------------------------------------------------------------------
Value label pan_paren_fibrosis 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  pan_paren_fibrosis


-----------------------------------------------------------------------------------------------------------------------
Value label pan_paren_inflam 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  pan_paren_inflam


-----------------------------------------------------------------------------------------------------------------------
Value label pan_paren_steatosis 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  pan_paren_steatosis


-----------------------------------------------------------------------------------------------------------------------
Value label pan_parenchyma 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [6,29]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Normal
           2   Abnormal
           3   Can't see well enough to tell

   Variables:  pan_parenchyma


-----------------------------------------------------------------------------------------------------------------------
Value label pan_peri_normal 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [6,8]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Normal
           2   Abnormal

   Variables:  pan_peri_normal


-----------------------------------------------------------------------------------------------------------------------
Value label pan_shape 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,3]                     String length:  [6,29]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Normal
           2   Abnormal
           3   Can't see well enough to tell

   Variables:  pan_shape


-----------------------------------------------------------------------------------------------------------------------
Value label pan_shape_problem 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [32,43]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           1   Imbalance in size of head compared to tail
           2   Other shape abnormality, specify

   Variables:  pan_shape_problem


-----------------------------------------------------------------------------------------------------------------------
Value label pan_size_normal 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [6,8]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Normal
           2   Abnormal

   Variables:  pan_size_normal


-----------------------------------------------------------------------------------------------------------------------
Value label pan_size_qual 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [5,29]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Normal
           2   Small
           3   Enlarged
           4   Can't see well enough to tell

   Variables:  pan_size_qual


-----------------------------------------------------------------------------------------------------------------------
Value label phone 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  phone


-----------------------------------------------------------------------------------------------------------------------
Value label pig 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  pig


-----------------------------------------------------------------------------------------------------------------------
Value label poultry_own 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  poultry_own


-----------------------------------------------------------------------------------------------------------------------
Value label preg_result 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [38,57]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  no
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   has documented negative pregnancy test performed by SAMPA
           2   has documented positive pregnancy test

   Variables:  preg_result


-----------------------------------------------------------------------------------------------------------------------
Value label preg_test 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [11,48]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   No, is male
           2   No, is female, and says they are post-menopausal
           3   No, since they already know they are pregnant
           4   Yes, will agree to test

   Variables:  preg_test


-----------------------------------------------------------------------------------------------------------------------
Value label radio 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  radio


-----------------------------------------------------------------------------------------------------------------------
Value label radio_exam 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [-103,1]                  String length:  [3,12]
           N:  6                 Unique at full length:  yes
        Gaps:  yes                 Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
        -103   Equipment NA
        -102   Absconded
        -100   Pending
         -99   Refused
           0   No
           1   Yes

   Variables:  radio_exam


-----------------------------------------------------------------------------------------------------------------------
Value label re_dwelltype 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [12,25]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Single house
           2   Apartment /Condo/Tenement
           3   Makeshift/Barong-barong
           4   Others, Specify

   Variables:  re_dwelltype


-----------------------------------------------------------------------------------------------------------------------
Value label re_electric 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [2,45]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Yes, own source
           2   Yes, tap from neighbor or other joint sources
           3   No
           4   Others, specify

   Variables:  re_electric


-----------------------------------------------------------------------------------------------------------------------
Value label re_fuel 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,9]                     String length:  [5,29]
           N:  9                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           1   Electricity
           2   Liquefied petroleum Gas (LPG)
           3   Natural gas
           4   Kerosene
           5   Charcoal
           6   Wood
           7   Biomass/Agricultural Crop
           8   Animal Dung
           9   Others, Specify

   Variables:  re_fuel


-----------------------------------------------------------------------------------------------------------------------
Value label re_tenurhws 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,5]                     String length:  [3,46]
           N:  5                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Own
           2   Rent
           3   Free (caretaker, owned by parents/relatives)
           4   Squat (settle in public/private dwelling units
           5   Others, Specify

   Variables:  re_tenurhws


-----------------------------------------------------------------------------------------------------------------------
Value label re_toilet 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,8]                     String length:  [15,37]
           N:  8                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  no
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Own Flush toilet
           2   Own Ventilated pit latrine
           3   Own Pit latrine
           4   Shared/ public Flush toilet
           5   Shared/ public Ventilated pit latrine
           6   Shared/ public Pit latrine
           7   None-we defecate in the bush/field
           8   Others, Specify

   Variables:  re_toilet


-----------------------------------------------------------------------------------------------------------------------
Value label re_water 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,8]                     String length:  [13,31]
           N:  8                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Piped private source
           2   Private tube well or borehole
           3   Piped public or communal source
           4   Public tube well or borehole
           5   Unprotected well
           6   Tanker or other water delivery
           7   Surface water
           8   Others, Specify

   Variables:  re_water


-----------------------------------------------------------------------------------------------------------------------
Value label rec_diab 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,2]                     String length:  [3,23]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes, uncomplicated
           2   Yes with complications

   Variables:  rec_diab


-----------------------------------------------------------------------------------------------------------------------
Value label ref 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  ref


-----------------------------------------------------------------------------------------------------------------------
Value label sewing 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  sewing


-----------------------------------------------------------------------------------------------------------------------
Value label sex 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [4,6]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Male
           2   Female

   Variables:  sex


-----------------------------------------------------------------------------------------------------------------------
Value label solar 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  solar


-----------------------------------------------------------------------------------------------------------------------
Value label stove 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  stove


-----------------------------------------------------------------------------------------------------------------------
Value label table 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  table


-----------------------------------------------------------------------------------------------------------------------
Value label tanner 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [-98,9]                   String length:  [1,10]
           N:  8                 Unique at full length:  yes
        Gaps:  yes                 Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  yes
  Definition
         -98   Refused
         -97   Don't know
           1   1
           2   2
           3   3
           4   4
           5   5
           9   9

   Variables:  tanner


-----------------------------------------------------------------------------------------------------------------------
Value label tanner_method 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,2]                     String length:  [34,53]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   ,Direct observation by study staff
           2   Boy pointed to the diagram which represents his stage

   Variables:  tanner_method


-----------------------------------------------------------------------------------------------------------------------
Value label tenurhws 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,5]                     String length:  [3,46]
           N:  5                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Own
           2   Rent
           3   Free (caretaker, owned by parents/relatives)
           4   Squat (settle in public/private dwelling units
           5   Others, Specify:{tenurhws_o:icons}

   Variables:  tenurhws


-----------------------------------------------------------------------------------------------------------------------
Value label toilet 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,8]                     String length:  [15,37]
           N:  8                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  no
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Own Flush toilet
           2   Own Ventilated pit latrine
           3   Own Pit latrine
           4   Shared/ public Flush toilet
           5   Shared/ public Ventilated pit latrine
           6   Shared/ public Pit latrine
           7   None-we defecate in the bush/field
           8   Others, Specify

   Variables:  toilet


-----------------------------------------------------------------------------------------------------------------------
Value label tr_contact1 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  tr_contact1


-----------------------------------------------------------------------------------------------------------------------
Value label tr_contact2 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  tr_contact2


-----------------------------------------------------------------------------------------------------------------------
Value label tr_contact3 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  tr_contact3


-----------------------------------------------------------------------------------------------------------------------
Value label tr_method1 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [5,10]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   cellphone
           2   telephone
           3   email
           4   home visit

   Variables:  tr_method1


-----------------------------------------------------------------------------------------------------------------------
Value label tr_method2 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [5,10]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   cellphone
           2   telephone
           3   email
           4   home visit

   Variables:  tr_method2


-----------------------------------------------------------------------------------------------------------------------
Value label tr_method3 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [5,10]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   cellphone
           2   telephone
           3   email
           4   home visit

   Variables:  tr_method3


-----------------------------------------------------------------------------------------------------------------------
Value label tr_reas_noc_phone1 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [15,23]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   wrong phone number
           2   incorrect email
           3   address changed
           4   Others {tr_r}eas_other1

   Variables:  tr_reas_noc_phone1


-----------------------------------------------------------------------------------------------------------------------
Value label tr_reas_noc_phone2 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [15,23]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   wrong phone number
           2   incorrect email
           3   address changed
           4   Others {tr_r}eas_other1

   Variables:  tr_reas_noc_phone2


-----------------------------------------------------------------------------------------------------------------------
Value label tr_reas_noc_phone3 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,4]                     String length:  [15,23]
           N:  4                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   wrong phone number
           2   incorrect email
           3   address changed
           4   Others {tr_r}eas_other1

   Variables:  tr_reas_noc_phone3


-----------------------------------------------------------------------------------------------------------------------
Value label tractor 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  tractor


-----------------------------------------------------------------------------------------------------------------------
Value label tv 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  tv


-----------------------------------------------------------------------------------------------------------------------
Value label uss 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,2]                     String length:  [3,28]
           N:  3                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes
           2   Not randomized to Ultrasound

   Variables:  uss


-----------------------------------------------------------------------------------------------------------------------
Value label uss_problem 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  uss_problem


-----------------------------------------------------------------------------------------------------------------------
Value label uss_sample 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [3,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  yes
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  uss_sample


-----------------------------------------------------------------------------------------------------------------------
Value label vcd 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  vcd


-----------------------------------------------------------------------------------------------------------------------
Value label water 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [1,8]                     String length:  [13,31]
           N:  8                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           1   Piped private source
           2   Private tube well or borehole
           3   Piped public or communal source
           4   Public tube well or borehole
           5   Unprotected well
           6   Tanker or other water delivery
           7   Surface water
           8   Others, Specify

   Variables:  water


-----------------------------------------------------------------------------------------------------------------------
Value label wmachine 
-----------------------------------------------------------------------------------------------------------------------

      Values                                    Labels
       Range:  [0,1]                     String length:  [2,3]
           N:  2                 Unique at full length:  yes
        Gaps:  no                  Unique at length 12:  yes
  Missing .*:  0                           Null string:  no
                               Leading/trailing blanks:  no
                                    Numeric -> numeric:  no
  Definition
           0   No
           1   Yes

   Variables:  wmachine


. sum ct_pan_head_trans

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
ct_pan_hea~s |        329    1.347325    11.93763       -106        5.9

. sktest ct_pan_head_trans

Skewness and kurtosis tests for normality
                                                              ----- Joint test -----
         Variable |       Obs   Pr(skewness)   Pr(kurtosis)   Adj chi2(2)  Prob>chi2
------------------+-----------------------------------------------------------------
ct_pan_head_trans |       329         0.0000         0.0000        378.62     0.0000

. sum ct_pan_head_trans if  ct_pan_head_trans >=0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
ct_pan_hea~s |        325    2.668523    .5006585       1.09        5.9

. sktest ct_pan_head_trans if  ct_pan_head_trans >=0

Skewness and kurtosis tests for normality
                                                              ----- Joint test -----
         Variable |       Obs   Pr(skewness)   Pr(kurtosis)   Adj chi2(2)  Prob>chi2
------------------+-----------------------------------------------------------------
ct_pan_head_trans |       325         0.0000         0.0000         50.73     0.0000

. qnorm ct_pan_head_trans if  ct_pan_head_trans >=0

. regress ct_pan_head_trans cohort

      Source |       SS           df       MS      Number of obs   =       329
-------------+----------------------------------   F(1, 327)       =      0.50
       Model |  72.0714321         1  72.0714321   Prob > F        =    0.4778
    Residual |  46670.2432       327  142.722456   R-squared       =    0.0015
-------------+----------------------------------   Adj R-squared   =   -0.0015
       Total |  46742.3146       328  142.507057   Root MSE        =    11.947

------------------------------------------------------------------------------
ct_pan_hea~s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |  -.4413113   .6210258    -0.71   0.478    -1.663021    .7803986
       _cons |   3.442548   3.021126     1.14   0.255    -2.500748    9.385844
------------------------------------------------------------------------------

. regress ct_pan_head_trans ct_pan_head_ap cohort

      Source |       SS           df       MS      Number of obs   =       329
-------------+----------------------------------   F(2, 326)       =     57.34
       Model |  12163.5243         2  6081.76213   Prob > F        =    0.0000
    Residual |  34578.7904       326  106.069909   R-squared       =    0.2602
-------------+----------------------------------   Adj R-squared   =    0.2557
       Total |  46742.3146       328  142.507057   Root MSE        =    10.299

--------------------------------------------------------------------------------
ct_pan_head_~s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
ct_pan_head_ap |   1.011568   .0947441    10.68   0.000     .8251814    1.197955
        cohort |  -.2778289   .5355957    -0.52   0.604    -1.331489    .7758312
         _cons |   .4295525   2.619711     0.16   0.870    -4.724119    5.583224
--------------------------------------------------------------------------------

. regress ct_pan_head_trans ct_pan_head_ap

      Source |       SS           df       MS      Number of obs   =       329
-------------+----------------------------------   F(1, 327)       =    114.66
       Model |   12134.983         1   12134.983   Prob > F        =    0.0000
    Residual |  34607.3316       327  105.832818   R-squared       =    0.2596
-------------+----------------------------------   Adj R-squared   =    0.2574
       Total |  46742.3146       328  142.507057   Root MSE        =    10.288

--------------------------------------------------------------------------------
ct_pan_head_~s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
ct_pan_head_ap |   1.012973   .0945995    10.71   0.000      .826873    1.199074
         _cons |  -.8926082   .6045144    -1.48   0.141    -2.081836    .2966198
--------------------------------------------------------------------------------

. regress ct_pan_head_trans age

      Source |       SS           df       MS      Number of obs   =       329
-------------+----------------------------------   F(1, 327)       =      0.51
       Model |  73.4743801         1  73.4743801   Prob > F        =    0.4736
    Residual |  46668.8403       327  142.718166   R-squared       =    0.0016
-------------+----------------------------------   Adj R-squared   =   -0.0015
       Total |  46742.3146       328  142.507057   Root MSE        =    11.946

------------------------------------------------------------------------------
ct_pan_hea~s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         age |   .0403976   .0563024     0.72   0.474    -.0703631    .1511582
       _cons |  -.4807571   2.631566    -0.18   0.855    -5.657693    4.696179
------------------------------------------------------------------------------

. describe ct_pan_head_trans

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-----------------------------------------------------------------------------------------------------------------------
ct_pan_head_t~s float   %9.0g                 [14.15] Pancreas head size measured in transverse dimension

. stem ct_pan_head_trans

Stem-and-leaf plot for ct_pan_head_trans
([14.15] Pancreas head size measured in transverse dimension)

ct_pan_head_trans rounded to integers

 -10. | 6666
 -10* | 
  -9. | 
  -9* | 
  -8. | 
  -8* | 
  -7. | 
  -7* | 
  -6. | 
  -6* | 
  -5. | 
  -5* | 
  -4. | 
  -4* | 
  -3. | 
  -3* | 
  -2. | 
  -2* | 
  -1. | 
  -1* | 
  -0. | 
  -0* | 
   0* | 1122222222222222222222222222222222222222222222222222222222222 ... (324)
   0. | 6

. help stem

. stem ct_pan_head_trans, round(3)

Stem-and-leaf plot for ct_pan_head_trans
([14.15] Pancreas head size measured in transverse dimension)

ct_pan_head_trans rounded to nearest multiple of 3
plot in units of 3

 -3f | 5555
 -3t | 
 -3* | 
 -2. | 
 -2s | 
 -2f | 
 -2t | 
 -2* | 
 -1. | 
 -1s | 
 -1f | 
 -1t | 
 -1* | 
 -0. | 
 -0s | 
 -0f | 
 -0t | 
 -0* | 
  0* | 00111111111111111111111111111111111111111111111111111111111111 ... (324)
  0t | 2

. stem ct_pan_head_trans, round(0.1)

Stem-and-leaf plot for ct_pan_head_trans
([14.15] Pancreas head size measured in transverse dimension)

ct_pan_head_trans rounded to nearest multiple of 0.1
plot in units of 0.1

 -10** | 60,60,60,60
 -10** | 
 -10** | 
 -10** | 
  -9** | 
  -9** | 
  -9** | 
  -9** | 
  -9** | 
  -8** | 
  -8** | 
  -8** | 
  -8** | 
  -8** | 
  -7** | 
  -7** | 
  -7** | 
  -7** | 
  -7** | 
  -6** | 
  -6** | 
  -6** | 
  -6** | 
  -6** | 
  -5** | 
  -5** | 
  -5** | 
  -5** | 
  -5** | 
  -4** | 
  -4** | 
  -4** | 
  -4** | 
  -4** | 
  -3** | 
  -3** | 
  -3** | 
  -3** | 
  -3** | 
  -2** | 
  -2** | 
  -2** | 
  -2** | 
  -2** | 
  -1** | 
  -1** | 
  -1** | 
  -1** | 
  -1** | 
  -0** | 
  -0** | 
  -0** | 
  -0** | 
  -0** | 
   0** | 11,14,15,15,16,16,16,17,17,18,18,18,19,19,19,19,19,19,19,19,19
   0** | 20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,21, ... (302)
   0** | 40,59

. stem ct_pan_head_trans, round(0.01)

Stem-and-leaf plot for ct_pan_head_trans
([14.15] Pancreas head size measured in transverse dimension)

ct_pan_head_trans rounded to nearest multiple of 0.01
plot in units of 0.01

 -10*** | 600,600,600,600
 -10*** | 
 -10*** | 
 -10*** | 
  -9*** | 
  -9*** | 
  -9*** | 
  -9*** | 
  -9*** | 
  -8*** | 
  -8*** | 
  -8*** | 
  -8*** | 
  -8*** | 
  -7*** | 
  -7*** | 
  -7*** | 
  -7*** | 
  -7*** | 
  -6*** | 
  -6*** | 
  -6*** | 
  -6*** | 
  -6*** | 
  -5*** | 
  -5*** | 
  -5*** | 
  -5*** | 
  -5*** | 
  -4*** | 
  -4*** | 
  -4*** | 
  -4*** | 
  -4*** | 
  -3*** | 
  -3*** | 
  -3*** | 
  -3*** | 
  -3*** | 
  -2*** | 
  -2*** | 
  -2*** | 
  -2*** | 
  -2*** | 
  -1*** | 
  -1*** | 
  -1*** | 
  -1*** | 
  -1*** | 
  -0*** | 
  -0*** | 
  -0*** | 
  -0*** | 
  -0*** | 
   0*** | 109,140,150,150,160,160,164,170,170,179,180,180,187,189,190, ... (23)
   0*** | 200,200,200,200,200,200,200,201,201,202,202,202,203,203, ... (301)
   0*** | 590

. regress ct_pan_head_trans age

      Source |       SS           df       MS      Number of obs   =       329
-------------+----------------------------------   F(1, 327)       =      0.51
       Model |  73.4743801         1  73.4743801   Prob > F        =    0.4736
    Residual |  46668.8403       327  142.718166   R-squared       =    0.0016
-------------+----------------------------------   Adj R-squared   =   -0.0015
       Total |  46742.3146       328  142.507057   Root MSE        =    11.946

------------------------------------------------------------------------------
ct_pan_hea~s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         age |   .0403976   .0563024     0.72   0.474    -.0703631    .1511582
       _cons |  -.4807571   2.631566    -0.18   0.855    -5.657693    4.696179
------------------------------------------------------------------------------

. scatter ct_pan_head_trans age

. scatter ct_pan_head_trans age if ct_pan_head_trans > 0

. scatter ct_pan_head_trans age if ct_pan_head_trans > 0

. scatter ct_pan_head_trans age if ct_pan_head_trans > 0 & ct_pan_head_tras < 5
ct_pan_head_tras not found
r(111);

. scatter ct_pan_head_trans age if ct_pan_head_trans > 0 & ct_pan_head_trans < 5

. scatter ct_pan_head_trans age if ct_pan_head_trans > 0 & ct_pan_head_trans < 10

. scatter ct_pan_head_trans age if ct_pan_head_trans > 0 & ct_pan_head_trans < 5

. scatter ct_pan_head_trans age if ct_pan_head_trans > 0 & ct_pan_head_trans < 5 || lfitci ct_pan_head_trans age

. scatter ct_pan_head_trans age if ct_pan_head_trans > 0 & ct_pan_head_trans < 5 || lfitci ct_pan_head_trans age if ct_
> pan_head_trans > 0 & ct_pan_head_trans < 5 

. help datasignature

. sum ct_pan_head_ap ct_pan_head_trans, by(sex)
option by() not allowed
r(198);

. ttest ct_pan_head_ap ct_pan_head_trans, over(sex)
too many variables specified
r(103);

. dotplot ct_pan_head_ap ct_pan_head_trans, over(sex)
only 1 variable may be plotted with by()
r(198);

. dotplot ct_pan_head_ap, over(sex)

. dotplot ct_pan_head_ap if ct_pan_head_ap > 0, over(sex)

. dotplot ct_pan_head_ap if ct_pan_head_ap > 0, over(sex) center median

. dotplot  ct_pan_head_trans if  ct_pan_head_trans > 0, over(sex) center median

. striplot ct_pan_head_ap, over(sex)
command striplot is unrecognized
r(199);

. net search stripplot
(contacting http://www.stata.com)

1 package found (Stata Journal listed first)
--------------------------------------------

onewplot from http://fmwww.bc.edu/RePEc/bocode/o
    'ONEWPLOT': module for oneway plots / onewplot plots data as a series of
    marks against a single / magnitude axis. onewplot is an alternative to
    graph, oneway with / more flexibility in some respects. This is version
    1.2.2 of the / software. Users of Stata 8 up should see stripplot.  / KW:


. help stripplot

. stripplot ct_pan_head_ap, over(sex)

. stripplot ct_pan_head_ap if ct_pan_head_ap>0, over(sex)

. stripplot ct_pan_head_ap if ct_pan_head_ap>0, over(sex) cumul

. stripplot ct_pan_head_ap if ct_pan_head_ap>0, over(sex) cumul stack
may not combine cumulate and stack options
r(198);

. stripplot ct_pan_head_ap if ct_pan_head_ap>0, over(sex) cumul freq
option freq not allowed
r(198);

. stripplot ct_pan_head_ap if ct_pan_head_ap>0, over(sex) cumul

. stripplot ct_pan_head_ap ct_pan_head_trans if ct_pan_head_ap>0, over(sex) cumul
over() may not be combined with more than one variable
r(198);

. stripplot ct_pan_head_trans if ct_pan_head_trans>0, over(sex) cumul

. help joyplot

. joyplot ct_pan_head_trans if ct_pan_head_trans>0, over(sex) 
option by() required
r(198);

. joyplot ct_pan_head_trans if ct_pan_head_trans>0, by(sex) 

. joyplot ct_pan_head_trans if ct_pan_head_trans>0, by(cohort) 
variable y5 not found
r(111);

. joyplot ct_pan_head_trans if ct_pan_head_trans>0 & cohort>2, by(cohort) 
variable y5 not found
r(111);

. which joyplot
/Users/juansolon/Library/Application Support/Stata/ado/plus/j/joyplot.ado
*! Joyplot v1.62 (28 May 2023)
*! Asjad Naqvi (asjadnaqvi@gmail.com)

. joyplot ct_pan_head_trans if ct_pan_head_trans>0, by(cont_site) 
Groups with errors:

     +-------------------------+
     |               cont_site |
     |-------------------------|
  1. | From a local ART clinic |
 28. |                   Other |
     +-------------------------+
2 over group(s) (cont_site) have fewer than 10 observations. Either clean them manually or use the droplow option to au
> tomatically filter them out.

. joyplot ct_pan_head_trans if ct_pan_head_trans>0, by(languages) 

. joyplot ct_pan_head_trans if ct_pan_head_trans>0, by(education) 
Groups with errors:

     +---------------------------------------------+
     |                                   education |
     |---------------------------------------------|
275. | Completed advance secondary (Tanzania only) |
     +---------------------------------------------+
1 over group(s) (education) have fewer than 10 observations. Either clean them manually or use the droplow option to au
> tomatically filter them out.

. joyplot ct_pan_head_trans if ct_pan_head_trans>0, by(education) droplow
variable y3 not found
r(111);

. joyplot ct_pan_head_trans if ct_pan_head_trans>0, by(employ)
Groups with errors:

     +--------------------------------------------+
     |                                     employ |
     |--------------------------------------------|
  1. | Professional (eg. teacher/doctor/engineer) |
     +--------------------------------------------+
1 over group(s) (employ) have fewer than 10 observations. Either clean them manually or use the droplow option to autom
> atically filter them out.

. joyplot ct_pan_head_trans if ct_pan_head_trans>0, by(employ) droplow
variable y8 not found
r(111);

. tab employ

            Current occupation of adult |
                           participant? |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
Professional (eg. teacher/doctor/engine |         43        2.31        2.31
Salaried office other than professional |         93        5.00        7.31
   Self-employed or owns small business |        441       23.70       31.00
                   Salaried manual work |        220       11.82       42.83
                          Casual labour |        653       35.09       77.92
                         Household work |        218       11.71       89.63
                                Retired |         53        2.85       92.48
         Unemployed [looking for a job] |        140        7.52      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,861      100.00

. label list employ
employ:
           1 Professional (eg. teacher/doctor/engineer)
           2 Salaried office other than professional
           3 Self-employed or owns small business
           4 Salaried manual work
           5 Casual labour
           6 Household work
           7 Retired
           8 Unemployed [looking for a job]

. joyplot ct_pan_head_trans if ct_pan_head_trans>0, by(employ_father) droplow
no observations
r(2000);

. help joyplot

. d cohort

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-----------------------------------------------------------------------------------------------------------------------
cohort          byte    %14.0g     cohort     Study cohort

. joyplot ct_pan_head_trans sex if ct_pan_head_trans>0
option by() required
r(198);

. joyplot ct_pan_head_trans sex if ct_pan_head_trans>0, by(cohort)

. joyplot ct_pan_head_trans if ct_pan_head_trans>0, by(cohort)
variable y5 not found
r(111);

. joyplot ct_pan_head_trans sex if ct_pan_head_trans>0, by(cohort) 

. label list cohort
cohort:
           1  DIVIDS
           2 SAM Lusaka
           3 CICADA
           4 NUSTART Lusaka
           5 St-ATT
           6 CLHNS

. joyplot ct_pan_head_trans sex if ct_pan_head_trans>0 & if cohort>2, by(cohort) 
if not found
r(111);

. joyplot ct_pan_head_trans sex if ct_pan_head_trans>0 & cohort>2, by(cohort) 

. joyplot ct_pan_head_trans if ct_pan_head_trans>0 & cohort>2, by(cohort) 
variable y5 not found
r(111);

. help ridgeline

. ridgeline_plot  ct_pan_head_trans, over(sex)
too few variables specified
r(102);

. ridgeline_plot ct_pan_head_trans, over(sex)
too few variables specified
r(102);

. ridgeline_plot ct_pan_head_trans ct_pan_head_ap, over(sex)

. ridgeline_plot ct_pan_head_trans ct_pan_head_ap if ct_pan_head_trans > 0  , over(sex)

. ridgeline_plot ct_pan_head_trans ct_pan_head_ap if ct_pan_head_trans > 0 &  ct_pan_head_trans < 6 , over(sex)

. ridgeline_plot ct_pan_head_trans ct_pan_head_ap if ct_pan_head_trans > 0 &  ct_pan_head_trans < 6 , over(cohort)

. ridgeline_plot ct_pan_head_trans age if ct_pan_head_trans > 0 &  ct_pan_head_trans < 6 , over(cohort)

. ridgeline_plot ct_pan_head_trans age if ct_pan_head_trans > 0 &  ct_pan_head_trans < 6 , over(cohort)

. ridgeline_plot bmi age , over(cohort)

. ridgeline_plot bmi age , over(cohort) normalize

. joyplot bmi age , over(cohort) normalize
option by() required
r(198);

. joyplot bmi age , by(cohort) normalize
option normalize incorrectly specified
r(198);

. joyplot bmi age , by(cohort) 

. joyplot bmi age if cohort>2 , by(cohort) 

. tab bmi cohort
too many values
r(134);

. bysort cohort : sum bmi

-----------------------------------------------------------------------------------------------------------------------
-> cohort = DIVIDS

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        328    17.33552    3.546702   10.30793   29.76944

-----------------------------------------------------------------------------------------------------------------------
-> cohort = SAM Lusaka

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         98    17.08647     2.83431   12.66205   26.27824

-----------------------------------------------------------------------------------------------------------------------
-> cohort = CICADA

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        976    23.11017    5.022209   13.61728   46.70962

-----------------------------------------------------------------------------------------------------------------------
-> cohort = NUSTART Lusaka

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        301    21.93966    5.279254   12.62903    47.0578

-----------------------------------------------------------------------------------------------------------------------
-> cohort = St-ATT

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        275    20.63644    3.654519   9.185072   32.43367

-----------------------------------------------------------------------------------------------------------------------
-> cohort = CLHNS

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        308    26.79176    4.763138   15.62478   42.13478


. table cohort sex, statistic(mean bmi)

--------------------------------------------------
                 |      [2.2] Participant's sex   
                 |      Male     Female      Total
-----------------+--------------------------------
Study cohort     |                                
  DIVIDS         |  16.92307   17.73804   17.33552
  SAM Lusaka     |  16.14144    18.0315   17.08647
  CICADA         |  21.47625   24.27398   23.11017
  NUSTART Lusaka |  19.39832   23.30109   21.93966
  St-ATT         |  20.43127   21.09504   20.63644
  CLHNS          |  26.50039   27.30888   26.79176
  Total          |  21.09212   22.98692    22.0677
--------------------------------------------------

. table cohort sex, statistic(mean bmi) statistic(median bmi)

--------------------------------------------------
                 |      [2.2] Participant's sex   
                 |      Male     Female      Total
-----------------+--------------------------------
Study cohort     |                                
  DIVIDS         |                                
    Mean         |  16.92307   17.73804   17.33552
    Median       |  16.06256   17.26271   16.59003
  SAM Lusaka     |                                
    Mean         |  16.14144    18.0315   17.08647
    Median       |  15.72635    17.5075   16.33767
  CICADA         |                                
    Mean         |  21.47625   24.27398   23.11017
    Median       |  20.70461   23.19499   22.10929
  NUSTART Lusaka |                                
    Mean         |  19.39832   23.30109   21.93966
    Median       |  18.76324   21.81629   20.63364
  St-ATT         |                                
    Mean         |  20.43127   21.09504   20.63644
    Median       |  20.11256   21.05157   20.16744
  CLHNS          |                                
    Mean         |  26.50039   27.30888   26.79176
    Median       |  26.34861   27.26367   26.61354
  Total          |                                
    Mean         |  21.09212   22.98692    22.0677
    Median       |  20.25958   22.04172   21.16275
--------------------------------------------------

. table cohort sex, statistic(mean bmi) statistic(median bmi) statistic(median ht)
variable ht not found
(error in option statistic())
r(111);

. table cohort sex, statistic(mean bmi) statistic(median bmi) statistic(median height)

-----------------------------------------------------------
                          |      [2.2] Participant's sex   
                          |      Male     Female      Total
--------------------------+--------------------------------
Study cohort              |                                
  DIVIDS                  |                                
    Mean                  |                                
      Body mass index     |  16.92307   17.73804   17.33552
    Median                |                                
      Body mass index     |  16.06256   17.26271   16.59003
      Average height (cm) |   154.625    151.075      152.1
  SAM Lusaka              |                                
    Mean                  |                                
      Body mass index     |  16.14144    18.0315   17.08647
    Median                |                                
      Body mass index     |  15.72635    17.5075   16.33767
      Average height (cm) |     143.5     145.75    145.175
  CICADA                  |                                
    Mean                  |                                
      Body mass index     |  21.47625   24.27398   23.11017
    Median                |                                
      Body mass index     |  20.70461   23.19499   22.10929
      Average height (cm) |     170.5     159.05     163.95
  NUSTART Lusaka          |                                
    Mean                  |                                
      Body mass index     |  19.39832   23.30109   21.93966
    Median                |                                
      Body mass index     |  18.76324   21.81629   20.63364
      Average height (cm) |       171    159.975     162.35
  St-ATT                  |                                
    Mean                  |                                
      Body mass index     |  20.43127   21.09504   20.63644
    Median                |                                
      Body mass index     |  20.11256   21.05157   20.16744
      Average height (cm) |    162.65     151.05     159.05
  CLHNS                   |                                
    Mean                  |                                
      Body mass index     |  26.50039   27.30888   26.79176
    Median                |                                
      Body mass index     |  26.34861   27.26367   26.61354
      Average height (cm) |     164.9      151.3    161.225
  Total                   |                                
    Mean                  |                                
      Body mass index     |  21.09212   22.98692    22.0677
    Median                |                                
      Body mass index     |  20.25958   22.04172   21.16275
      Average height (cm) |     165.9     156.55      160.7
-----------------------------------------------------------

. table cohort sex, statistic(mean bmi) statistic(median bmi) statistic(median height) statistic (mean age)

-----------------------------------------------------------
                          |      [2.2] Participant's sex   
                          |      Male     Female      Total
--------------------------+--------------------------------
Study cohort              |                                
  DIVIDS                  |                                
    Mean                  |                                
      Body mass index     |  16.92307   17.73804   17.33552
      Age (years)         |  14.28994    14.2948    14.2924
    Median                |                                
      Body mass index     |  16.06256   17.26271   16.59003
      Average height (cm) |   154.625    151.075      152.1
  SAM Lusaka              |                                
    Mean                  |                                
      Body mass index     |  16.14144    18.0315   17.08647
      Age (years)         |  13.22449    12.7551    12.9898
    Median                |                                
      Body mass index     |  15.72635    17.5075   16.33767
      Average height (cm) |     143.5     145.75    145.175
  CICADA                  |                                
    Mean                  |                                
      Body mass index     |  21.47625   24.27398   23.11017
      Age (years)         |  49.87715   46.94396   48.16462
    Median                |                                
      Body mass index     |  20.70461   23.19499   22.10929
      Average height (cm) |     170.5     159.05     163.95
  NUSTART Lusaka          |                                
    Mean                  |                                
      Body mass index     |  19.39832   23.30109   21.93966
      Age (years)         |  47.02857   42.81218   44.27815
    Median                |                                
      Body mass index     |  18.76324   21.81629   20.63364
      Average height (cm) |       171    159.975     162.35
  St-ATT                  |                                
    Mean                  |                                
      Body mass index     |  20.43127   21.09504   20.63644
      Age (years)         |  49.52041   49.34197   49.46999
    Median                |                                
      Body mass index     |  20.11256   21.05157   20.16744
      Average height (cm) |    162.65     151.05     159.05
  CLHNS                   |                                
    Mean                  |                                
      Body mass index     |  26.50039   27.30888   26.79176
      Age (years)         |  39.41776   39.45562   39.43129
    Median                |                                
      Body mass index     |  26.34861   27.26367   26.61354
      Average height (cm) |     164.9      151.3    161.225
  Total                   |                                
    Mean                  |                                
      Body mass index     |  21.09212   22.98692    22.0677
      Age (years)         |  42.35499   40.33136   41.40369
    Median                |                                
      Body mass index     |  20.25958   22.04172   21.16275
      Average height (cm) |     165.9     156.55      160.7
-----------------------------------------------------------

. exit, clear
