------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/juansolon/Documents/GitHub/sampa-radio/log/an_ct_bivariate.txt
  log type:  text
 opened on:  27 Mar 2025, 10:14:12

. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. 
. la var ct_pan_head_ap "Head, AP"

. la var ct_pan_head_trans "Head, Transverse"

. la var ct_pan_body_trans "Body, Transverse"

. la var ct_pan_tail_trans "Tail, Transverse"

. la var ct_pan_body_tail "Body-Tail, Length"

. la var ct_pan_vol "Pancreatic volume(ml)"

. 
. collect clear

. 
. local col "ever_mal"

. local contmed "ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_vol "  /*contino
> us variables; median (p25-p75)  will be reported*/

. 
. local colhead2 `"0 "NPM" 1 "PM""'

.                 
. * format median of `contmed'
. local nfrmt_p50 "%5.3f"

. local nfrmt_iqr "%5.3f"

. local sfrmt_p25 "(%s-"

. local sfrmt_p75 "%s)"

. 
. local title "Table .Unadjusted CT Measurements"

. count if radio3 ==1
  1,621

. local obs_uss = r(N)

. di `obs_uss'
1621

. count if ct2 ==1
  291

. local obs_ct = r(N)

. di `obs_ct'
291

. local notes1 "Values are [N] median (p25-p50)."

. local notes2 "`obs_uss' contributing any ultrasound measurement."

. local notes3 "`obs_ct' contributing any CT scan measurement."

. local notes4 "P values are for Kruskal-Wallis Tests"

. 
. 
. * STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  
. * THERE IS NOTHING TO MODIFY BEYOND THIS LINE UNLESS CHANGING CODE. 
. 
. * GENERATE TABLE STATS 
. 
.         table (var)(`col')  , ///
>                 stat(frequency) ///
>                 stat(count `contmed') ///
>                 stat(p50 `contmed') ///
>                 stat(p25 `contmed') ///
>                 stat(p75 `contmed') ///
>                 nototal

----------------------------------------------------------------
                              |   Ever experience malnutrition? 
                              |             NPM               PM
------------------------------+---------------------------------
Frequency                     |           1,101            1,021
Head, AP                      |                                 
  Number of nonmissing values |             149              141
  50th percentile             |            2.57             2.44
  25th percentile             |            2.29             2.15
  75th percentile             |             2.8             2.77
Head, Transverse              |                                 
  Number of nonmissing values |             148              139
  50th percentile             |             2.6             2.64
  25th percentile             |           2.395             2.32
  75th percentile             |             2.9             2.92
Body, Transverse              |                                 
  Number of nonmissing values |             148              141
  50th percentile             |            2.06             2.09
  25th percentile             |           1.725             1.73
  75th percentile             |            2.32             2.41
Tail, Transverse              |                                 
  Number of nonmissing values |             149              139
  50th percentile             |            1.76             1.77
  25th percentile             |            1.47             1.51
  75th percentile             |               2             2.08
Body-Tail, Length             |                                 
  Number of nonmissing values |             102              112
  50th percentile             |           10.65           10.015
  25th percentile             |            9.56            9.175
  75th percentile             |           11.75            10.94
Pancreatic volume(ml)         |                                 
  Number of nonmissing values |             101              108
  50th percentile             |        64.94215         62.00394
  25th percentile             |        54.50868         47.52549
  75th percentile             |         80.0287         80.46837
----------------------------------------------------------------

.                 
. collect rename Table c1
(current collection is c1)

.                 
. *REFORMAT RESULTS TO DESIRED COLUMNS
.                 
.         * recodes median and iqr
.                 collect recode result p50 = column1
(12 items recoded in collection c1)

.                 collect recode result p25 = column2
(12 items recoded in collection c1)

.                 collect recode result p75 = column3
(12 items recoded in collection c1)

.                 
.         * Create composite result : this is needed because 75 is in column3 and we want it in the same column as column 2 . 
>  Use for medians and probably CIs
.                 collect composite define column4 = column2 column3, replace

. 
.         * Calculate p-values from chi2 and df
.         foreach v in `contmed' {
  2.                 quietly kwallis `v', by(`col')
  3.                 collect: mystats
  4.         }

. 
.         
. * CREATE THE TABLE 1 Layout Super column - column 
. 
.         collect layout (var) (ever_mal#result[count column1 column4])

Collection: c1
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 6 x 6

--------------------------------------------------------------------------------------------------------------------------------------------------
                      |                                                Ever experience malnutrition?                                              
                      |                              NPM                                                            PM                            
                      |  Number of nonmissing values    column1      column2 column3   Number of nonmissing values    column1      column2 column3
----------------------+---------------------------------------------------------------------------------------------------------------------------
Head, AP              |                          149       2.57       2.29       2.8                           141       2.44       2.15      2.77
Head, Transverse      |                          148        2.6      2.395       2.9                           139       2.64       2.32      2.92
Body, Transverse      |                          148       2.06      1.725      2.32                           141       2.09       1.73      2.41
Tail, Transverse      |                          149       1.76       1.47         2                           139       1.77       1.51      2.08
Body-Tail, Length     |                          102      10.65       9.56     11.75                           112     10.015      9.175     10.94
Pancreatic volume(ml) |                          101   64.94215   54.50868   80.0287                           108   62.00394   47.52549  80.46837
--------------------------------------------------------------------------------------------------------------------------------------------------

. 
. * Format p-values
.         collect style cell result[p], nformat("%5.3f")

.         collect style cell result[p], sformat("p=%s")

. 
. * CHANGE HEADER TEXT
.         * column
.                 collect label levels `col' `colhead2', modify

. 
. collect preview /* preview changes */

--------------------------------------------------------------------------------------------------------------------------------------------------
                      |                                                Ever experience malnutrition?                                              
                      |                              NPM                                                            PM                            
                      |  Number of nonmissing values    column1      column2 column3   Number of nonmissing values    column1      column2 column3
----------------------+---------------------------------------------------------------------------------------------------------------------------
Head, AP              |                          149       2.57       2.29       2.8                           141       2.44       2.15      2.77
Head, Transverse      |                          148        2.6      2.395       2.9                           139       2.64       2.32      2.92
Body, Transverse      |                          148       2.06      1.725      2.32                           141       2.09       1.73      2.41
Tail, Transverse      |                          149       1.76       1.47         2                           139       1.77       1.51      2.08
Body-Tail, Length     |                          102      10.65       9.56     11.75                           112     10.015      9.175     10.94
Pancreatic volume(ml) |                          101   64.94215   54.50868   80.0287                           108   62.00394   47.52549  80.46837
--------------------------------------------------------------------------------------------------------------------------------------------------

. 
. * HIDE COLUMN HEADERS
. 
.         * Hide supercolumn variable name because it is self-descriptive
.                 
.         *       collect style header `scol', title(hide) /* this removes the column variable name or label by hiding it */
. 
.         * Hide the column variable name 
.                 
.                 collect style header `col', title(hide) /* this removes the column variable name or label by hiding it */

. 
.         * Hide the words column 1 and column 2 for the results 
. 
.                 collect style header result, level(hide) /* this removes column 1 and column2 header names*/

. 
. collect preview /* preview changes */

--------------------------------------------------------------------------------------------------
                      |                  NPM                                    PM                
----------------------+---------------------------------------------------------------------------
Head, AP              |  149       2.57       2.29       2.8   141       2.44       2.15      2.77
Head, Transverse      |  148        2.6      2.395       2.9   139       2.64       2.32      2.92
Body, Transverse      |  148       2.06      1.725      2.32   141       2.09       1.73      2.41
Tail, Transverse      |  149       1.76       1.47         2   139       1.77       1.51      2.08
Body-Tail, Length     |  102      10.65       9.56     11.75   112     10.015      9.175     10.94
Pancreatic volume(ml) |  101   64.94215   54.50868   80.0287   108   62.00394   47.52549  80.46837
--------------------------------------------------------------------------------------------------

. 
. * MODIFY ROW TEXT
. 
. 
. * REVISE ROW STYLES
. 
. * Stack levels of each variable , place a space between variables (spacer) ; 
. 
.         collect style row stack, nobinder spacer

. 
. * Remove vertical line after variables
. 
.         collect style cell border_block, border(right, pattern(nil))

. 
. * HIDE ROW Text
. 
. * Hide the variable names 
. collect style header `hiderows', title(hide)

. 
. 
. * FORMAT NUMBERS
. 
. * Format median
. 
.         collect style cell result[column1]#var[`contmed'], nformat(`nfrmt_p50')

. 
. * Add IQR formatting to p25 and p75 separately:
.         collect style cell result[column2]#var[`contmed'], nformat(`nfrmt_iqr') sformat("`sfrmt_p25'") /* formats iqr as (p2
> 5 - p75)*/

.         collect style cell result[column3]#var[`contmed'], nformat(`nfrmt_iqr') sformat("`sfrmt_p75'") 

. 
. * Format count column
.         collect style cell result[count], nformat("%4.0f") /* Format count as whole number */

.         collect style cell result[count], sformat("[%s]") /* Format count as whole number */

.         
. /* format factor variables (categorical) column 1 and column 2
> 
>         collect style cell var[`frmt_catvar1']#result[column1], nformat(`nfrmt_freq')
> 
>         collect style cell var[`frmt_catvar1']#result[column2], nformat(`nfrmt_perc') sformat("(`sfrmt_perc')") /* Adds (%) 
> to percent */
> 
> * format means variable column 1 and column 2
> 
>         collect style cell var[`contn']#result[column1], nformat(`nfrmt_mean') /* Formats continuous variable to one decimal
> */
> 
>         collect style cell var[`contn']#result[column2], nformat(`nfrmt_sd') sformat(`sfrmt_sd') /* Formats continuous varia
> ble to one decimal*/
> */
. * Change font of results
.         *collect style cell var[`contn']#result[column1], nformat(`nfrmt_mean') /* Formats continuous variable to one decima
> l*/
.         
. * Add text
.         collect title `title'

.         collect notes `notes1'

.         collect notes `notes2'

.         collect notes `notes3'

.         collect notes `notes4'

.         
. collect preview

Table .Unadjusted CT Measurements
--------------------------------------------------------------------------------------------
                                      NPM                                  PM               
--------------------------------------------------------------------------------------------
Head, AP               [149]    2.570     (2.290- 2.800)   [141]    2.440     (2.150- 2.770)
Head, Transverse       [148]    2.600     (2.395- 2.900)   [139]    2.640     (2.320- 2.920)
Body, Transverse       [148]    2.060     (1.725- 2.320)   [141]    2.090     (1.730- 2.410)
Tail, Transverse       [149]    1.760     (1.470- 2.000)   [139]    1.770     (1.510- 2.080)
Body-Tail, Length      [102]   10.650    (9.560- 11.750)   [112]   10.015    (9.175- 10.940)
Pancreatic volume(ml)  [101]   64.942   (54.509- 80.029)   [108]   62.004   (47.525- 80.468)
--------------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
1621 contributing any ultrasound measurement.
291 contributing any CT scan measurement.
P values are for Kruskal-Wallis Tests

. 
. * Save first collection with main stats
. collect layout (var) (ever_mal#result[count column1 column4])

Collection: c1
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 6 x 6

Table .Unadjusted CT Measurements
--------------------------------------------------------------------------------------------
                                      NPM                                  PM               
--------------------------------------------------------------------------------------------
Head, AP               [149]    2.570     (2.290- 2.800)   [141]    2.440     (2.150- 2.770)
Head, Transverse       [148]    2.600     (2.395- 2.900)   [139]    2.640     (2.320- 2.920)
Body, Transverse       [148]    2.060     (1.725- 2.320)   [141]    2.090     (1.730- 2.410)
Tail, Transverse       [149]    1.760     (1.470- 2.000)   [139]    1.770     (1.510- 2.080)
Body-Tail, Length      [102]   10.650    (9.560- 11.750)   [112]   10.015    (9.175- 10.940)
Pancreatic volume(ml)  [101]   64.942   (54.509- 80.029)   [108]   62.004   (47.525- 80.468)
--------------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
1621 contributing any ultrasound measurement.
291 contributing any CT scan measurement.
P values are for Kruskal-Wallis Tests

. collect save ./tables/ct1.json, replace
(collection c1 saved to file ./tables/ct1.json)

. 
. * Create new collection for p-values
. collect create c2
(current collection is c2)

. foreach v in `contmed' {
  2.     quietly kwallis `v', by(`col')
  3.     collect: mystats
  4. }

.    
.    
. 
. * Remap cmdset to match var levels
. collect recode cmdset 1 = ct_pan_head_ap
(5 items recoded in collection c2)

. collect recode cmdset 2 = ct_pan_head_trans
(5 items recoded in collection c2)

. collect recode cmdset 3 = ct_pan_body_trans
(5 items recoded in collection c2)

. collect recode cmdset 4 = ct_pan_tail_trans
(5 items recoded in collection c2)

. collect recode cmdset 5 = ct_pan_body_tail
(5 items recoded in collection c2)

. collect recode cmdset 6 = ct_pan_vol
(5 items recoded in collection c2)

. collect remap cmdset = var
(30 items remapped in collection c2)

. 
. * Combine collections
. collect combine c4 = c1 c2
(current collection is c4)

. 
. * Create layout for combined collection
. collect layout (var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans ///
>                                 ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan
> _vol]) ///
>                                 (ever_mal#result[count column1 column4] result[p])   
(level pan_body_trans of dimension var not found)
(level pan_head_ap of dimension var not found)
(level pan_head_trans of dimension var not found)
(level pan_tail_trans of dimension var not found)

Collection: c4
      Rows: var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans
            ct_pan_tail_trans ct_pan_body_tail ct_pan_vol]
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 6 x 7

Table .Unadjusted CT Measurements
------------------------------------------------------------------------------------------------------
                                      NPM                                  PM                         
------------------------------------------------------------------------------------------------------
Head, AP               [149]    2.570     (2.290- 2.800)   [141]    2.440     (2.150- 2.770)   p=0.155
Head, Transverse       [148]    2.600     (2.395- 2.900)   [139]    2.640     (2.320- 2.920)   p=0.953
Body, Transverse       [148]    2.060     (1.725- 2.320)   [141]    2.090     (1.730- 2.410)   p=0.379
Tail, Transverse       [149]    1.760     (1.470- 2.000)   [139]    1.770     (1.510- 2.080)   p=0.461
Body-Tail, Length      [102]   10.650    (9.560- 11.750)   [112]   10.015    (9.175- 10.940)   p=0.001
Pancreatic volume(ml)  [101]   64.942   (54.509- 80.029)   [108]   62.004   (47.525- 80.468)   p=0.463
------------------------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
1621 contributing any ultrasound measurement.
291 contributing any CT scan measurement.
P values are for Kruskal-Wallis Tests

.   
. 
. 
. collect save ./tables/ct1, replace      
(collection c4 saved to file ./tables/ct1.stjson)

. * Export combined table
. collect export ./tables/ct1.html, as(html) replace
(collection c4 exported to file ./tables/ct1.html)

. collect export ./tables/ct1.docx, as(docx) replace
(collection c4 exported to file ./tables/ct1.docx)

. collect export ./tables/ct1.xlsx, as(xlsx) replace
(collection c4 exported to file ./tables/ct1.xlsx)

. 
. collect use ./tables/uss1
(collection c3 read from file ./tables/uss1.stjson)

. 
. collect combine c5 = c3 c4
(current collection is c5)

. 
. collect layout (var) (ever_mal#result[count column1 column4] result[p])   

Collection: c5
      Rows: var
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 10 x 7

Table .Unadjusted Ultrasound Measurements
------------------------------------------------------------------------------------------------------
                                      NPM                                  PM                         
------------------------------------------------------------------------------------------------------
Head, AP               [149]    2.570     (2.290- 2.800)   [141]    2.440     (2.150- 2.770)   p=0.155
Head, AP               [715]    2.090     (1.860- 2.350)   [837]    2.070     (1.780- 2.390)   p=0.214
Head, Transverse       [148]    2.600     (2.395- 2.900)   [139]    2.640     (2.320- 2.920)   p=0.953
Head, Transverse       [635]    2.100     (1.860- 2.350)   [764]    1.820     (1.460- 2.200)   p=0.000
Body, Transverse       [148]    2.060     (1.725- 2.320)   [141]    2.090     (1.730- 2.410)   p=0.379
Body, Transverse       [745]    1.240     (1.070- 1.500)   [863]    1.230     (1.030- 1.490)   p=0.081
Tail, Transverse       [149]    1.760     (1.470- 2.000)   [139]    1.770     (1.510- 2.080)   p=0.461
Tail, Transverse       [509]    1.230     (1.070- 1.590)   [692]    1.420     (1.140- 1.715)   p=0.000
Body-Tail, Length      [102]   10.650    (9.560- 11.750)   [112]   10.015    (9.175- 10.940)   p=0.001
Pancreatic volume(ml)  [101]   64.942   (54.509- 80.029)   [108]   62.004   (47.525- 80.468)   p=0.463
------------------------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
1621 contributing any ultrasound measurement.
291 contributing any CT scan measurement.
P values are for Kruskal-Wallis Tests

. 
. * Reorder rows 
. collect layout (var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans ///
>                                 ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan
> _vol]) ///
>                                 (ever_mal#result[count column1 column4] result[p]) 

Collection: c5
      Rows: var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans
            ct_pan_tail_trans ct_pan_body_tail ct_pan_vol]
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 10 x 7

Table .Unadjusted Ultrasound Measurements
------------------------------------------------------------------------------------------------------
                                      NPM                                  PM                         
------------------------------------------------------------------------------------------------------
Head, AP               [715]    2.090     (1.860- 2.350)   [837]    2.070     (1.780- 2.390)   p=0.214
Head, Transverse       [635]    2.100     (1.860- 2.350)   [764]    1.820     (1.460- 2.200)   p=0.000
Body, Transverse       [745]    1.240     (1.070- 1.500)   [863]    1.230     (1.030- 1.490)   p=0.081
Tail, Transverse       [509]    1.230     (1.070- 1.590)   [692]    1.420     (1.140- 1.715)   p=0.000
Head, AP               [149]    2.570     (2.290- 2.800)   [141]    2.440     (2.150- 2.770)   p=0.155
Head, Transverse       [148]    2.600     (2.395- 2.900)   [139]    2.640     (2.320- 2.920)   p=0.953
Body, Transverse       [148]    2.060     (1.725- 2.320)   [141]    2.090     (1.730- 2.410)   p=0.379
Tail, Transverse       [149]    1.760     (1.470- 2.000)   [139]    1.770     (1.510- 2.080)   p=0.461
Body-Tail, Length      [102]   10.650    (9.560- 11.750)   [112]   10.015    (9.175- 10.940)   p=0.001
Pancreatic volume(ml)  [101]   64.942   (54.509- 80.029)   [108]   62.004   (47.525- 80.468)   p=0.463
------------------------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
1621 contributing any ultrasound measurement.
291 contributing any CT scan measurement.
P values are for Kruskal-Wallis Tests

.                                 
. * Add a Dimension for USS and CT Variables
. 
. collect addtags vartype[USS 1621 contributing any measurement], fortags(var[pan_head_ap pan_head_trans pan_body_trans pan_ta
> il_trans])
(52 items changed in collection c5)

. collect addtags vartype[CT 291 contributing any measurement], fortags(var[ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans
>  ct_pan_tail_trans ct_pan_body_tail ct_pan_vol])
(78 items changed in collection c5)

. 
. collect layout (vartype#var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans ///
>                                 ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan
> _vol]) ///
>                                 (ever_mal#result[count column1 column4] result[p]) 

Collection: c5
      Rows: vartype#var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans ct_pan_head_ap ct_pan_head_trans
            ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_vol]
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 13 x 7

Table .Unadjusted Ultrasound Measurements
----------------------------------------------------------------------------------------------------------------------
                                                      NPM                                  PM                         
----------------------------------------------------------------------------------------------------------------------
USS 1621 contributing any measurement                                                                                 
  Head, AP                             [715]    2.090     (1.860- 2.350)   [837]    2.070     (1.780- 2.390)   p=0.214
  Head, Transverse                     [635]    2.100     (1.860- 2.350)   [764]    1.820     (1.460- 2.200)   p=0.000
  Body, Transverse                     [745]    1.240     (1.070- 1.500)   [863]    1.230     (1.030- 1.490)   p=0.081
  Tail, Transverse                     [509]    1.230     (1.070- 1.590)   [692]    1.420     (1.140- 1.715)   p=0.000
                                                                                                                      
CT 291 contributing any measurement                                                                                   
  Head, AP                             [149]    2.570     (2.290- 2.800)   [141]    2.440     (2.150- 2.770)   p=0.155
  Head, Transverse                     [148]    2.600     (2.395- 2.900)   [139]    2.640     (2.320- 2.920)   p=0.953
  Body, Transverse                     [148]    2.060     (1.725- 2.320)   [141]    2.090     (1.730- 2.410)   p=0.379
  Tail, Transverse                     [149]    1.760     (1.470- 2.000)   [139]    1.770     (1.510- 2.080)   p=0.461
  Body-Tail, Length                    [102]   10.650    (9.560- 11.750)   [112]   10.015    (9.175- 10.940)   p=0.001
  Pancreatic volume(ml)                [101]   64.942   (54.509- 80.029)   [108]   62.004   (47.525- 80.468)   p=0.463
----------------------------------------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
1621 contributing any ultrasound measurement.
291 contributing any CT scan measurement.
P values are for Kruskal-Wallis Tests

. 
. * Table Styles
.         collect style cell, font(Arial, size(11))

.         collect style notes, font(Arial, size(11))

. 
. * Table title styles
.         collect style title, font(Arial, size(11) bold)

.                                 
. collect notes, clear

. collect notes "Values are [N] median (p25-p75)."

. collect notes "P values are for Kruskal-Wallis tests."

. collect title "Radiologic measurements in the whole cohort, by prior exposure"                          

. collect save ./tables/uss_ct, replace   
(collection c5 saved to file ./tables/uss_ct.stjson)

. * Export combined table
. collect export ./tables/uss_ct.html, as(html) replace
(collection c5 exported to file ./tables/uss_ct.html)

. 
. collect export ./tables/uss_ct.docx, as(docx) replace
(collection c5 exported to file ./tables/uss_ct.docx)

. collect export ./tables/uss_ct.xlsx, as(xlsx) replace
(collection c5 exported to file ./tables/uss_ct.xlsx)

. 
. 
. 
. 
. /* END END END END END END END END END END END END END END END END END END END END */
.         
. 
. 
end of do-file

. d pan_*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------------
pan_size_qual   byte    %29.0g     pan_size_qual
                                              Qualitative indicator of pancreas size
pan_head_trans  float   %9.0g                 Head, Transverse
pan_head_ap     float   %9.0g                 Head, AP
pan_body_trans  float   %9.0g                 Body, Transverse
pan_tail_trans  float   %9.0g                 Tail, Transverse
pan_shape       byte    %29.0g     pan_shape
                                              Pancreas shape
pan_shape_pro~m byte    %42.0g     pan_shape_problem
                                              For abnormal shape, specify the problem
pan_shape_pro~y str23   %23s                  Other shape abnormality, specify
pan_contour     byte    %29.0g     pan_contour
                                              Pancreas contour
pan_contour_p~m byte    %30.0g     pan_contour_problem
                                              For abnormal contour, specify the problem
pan_contour_p~y str17   %17s                  Other contour problem, specify
pan_parenchyma  byte    %29.0g     pan_parenchyma
                                              Pancreatic Parenchyma
pan_paren_inf~m byte    %8.0g      pan_paren_inflam
                                              Pancreas shows signs of inflammation of edema
pan_paren_fib~s byte    %8.0g      pan_paren_fibrosis
                                              Pancreas shows signs of fibrosis
pan_paren_ste~s byte    %8.0g      pan_paren_steatosis
                                              Pancreas shows signs of steatosis
pan_duct        byte    %29.0g     pan_duct   Pancreas Duct
pan_duct_stones byte    %8.0g      pan_duct_stones
                                              Stones detected in the duct
pan_duct_mass   byte    %8.0g      pan_duct_mass
                                              Mass detected in the duct
pan_calci       byte    %29.0g     pan_calci
                                              Calcifications
pan_calci_place byte    %14.0g     pan_calci_place
                                              If calcification is present, indicate where it is
pan_cyst_yes    strL    %9s                   If yes specify
pan_oth_abnor~l byte    %12.0g     pan_oth_abnormal
                                              Any other abnormalities detected?
pan_oth_abn_s~y strL    %9s                   Specify other abnormalities detected

. tab pan_paren_steatosis

   Pancreas |
shows signs |
         of |
  steatosis |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |          8        4.91        4.91
        Yes |        155       95.09      100.00
------------+-----------------------------------
      Total |        163      100.00

. tab pan_paren_steatosis, mis

   Pancreas |
shows signs |
         of |
  steatosis |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |          8        0.38        0.38
        Yes |        155        7.30        7.68
          . |      1,959       92.32      100.00
------------+-----------------------------------
      Total |      2,122      100.00

. tab pan_paren_steatosis ever_mal, mis

  Pancreas |
     shows |    Ever experience
  signs of |     malnutrition?
 steatosis |       NPM         PM |     Total
-----------+----------------------+----------
        No |         3          5 |         8 
       Yes |       104         51 |       155 
         . |       994        965 |     1,959 
-----------+----------------------+----------
     Total |     1,101      1,021 |     2,122 

. tab pan_paren_steatosis ever_mal if radio3==1, mis

  Pancreas |
     shows |    Ever experience
  signs of |     malnutrition?
 steatosis |       NPM         PM |     Total
-----------+----------------------+----------
        No |         3          5 |         8 
       Yes |       102         47 |       149 
         . |       647        817 |     1,464 
-----------+----------------------+----------
     Total |       752        869 |     1,621 

. tab pan_paren_steatosis ever_mal, mis col chi

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Pancreas |
     shows |    Ever experience
  signs of |     malnutrition?
 steatosis |       NPM         PM |     Total
-----------+----------------------+----------
        No |         3          5 |         8 
           |      0.27       0.49 |      0.38 
-----------+----------------------+----------
       Yes |       104         51 |       155 
           |      9.45       5.00 |      7.30 
-----------+----------------------+----------
         . |       994        965 |     1,959 
           |     90.28      94.52 |     92.32 
-----------+----------------------+----------
     Total |     1,101      1,021 |     2,122 
           |    100.00     100.00 |    100.00 

          Pearson chi2(2) =  16.0587   Pr = 0.000

. tab pan_paren_steatosis ever_mal if pan_paren_steatosis !=., mis col chi

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Pancreas |
     shows |    Ever experience
  signs of |     malnutrition?
 steatosis |       NPM         PM |     Total
-----------+----------------------+----------
        No |         3          5 |         8 
           |      2.80       8.93 |      4.91 
-----------+----------------------+----------
       Yes |       104         51 |       155 
           |     97.20      91.07 |     95.09 
-----------+----------------------+----------
     Total |       107         56 |       163 
           |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   2.9548   Pr = 0.086

. tab pan_paren_steatosis ever_mal if pan_paren_steatosis !=. & radioe==1, mis col chi
radioe not found
r(111);

. tab pan_paren_steatosis ever_mal if pan_paren_steatosis !=. & radio3==1, mis col chi

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Pancreas |
     shows |    Ever experience
  signs of |     malnutrition?
 steatosis |       NPM         PM |     Total
-----------+----------------------+----------
        No |         3          5 |         8 
           |      2.86       9.62 |      5.10 
-----------+----------------------+----------
       Yes |       102         47 |       149 
           |     97.14      90.38 |     94.90 
-----------+----------------------+----------
     Total |       105         52 |       157 
           |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   3.2846   Pr = 0.070

. tab pan_paren*
too many variables specified
r(103);

. tab pan_parenchy ever_mal, col chi mis

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |    Ever experience
                      |     malnutrition?
Pancreatic Parenchyma |       NPM         PM |     Total
----------------------+----------------------+----------
               Normal |       640        809 |     1,449 
                      |     58.13      79.24 |     68.28 
----------------------+----------------------+----------
             Abnormal |       108         54 |       162 
                      |      9.81       5.29 |      7.63 
----------------------+----------------------+----------
Can't see well enough |        86         36 |       122 
                      |      7.81       3.53 |      5.75 
----------------------+----------------------+----------
                    . |       267        122 |       389 
                      |     24.25      11.95 |     18.33 
----------------------+----------------------+----------
                Total |     1,101      1,021 |     2,122 
                      |    100.00     100.00 |    100.00 

          Pearson chi2(3) = 109.3909   Pr = 0.000

. tab pan_parenchy ever_mal if radio3==1 & if pan_parenchyma <2, col chi mis
if not found
r(111);

. tab pan_parenchy ever_mal if radio3==1 * if pan_parenchy <2, col chi mis
if not found
r(111);

. tab pan_parenchy ever_mal if radio3==1 & if pan_parenchy <2, col chi mis
if not found
r(111);

. tab pan_parenchy ever_mal if radio3==1

                      |    Ever experience
                      |     malnutrition?
Pancreatic Parenchyma |       NPM         PM |     Total
----------------------+----------------------+----------
               Normal |       639        809 |     1,448 
             Abnormal |       106         50 |       156 
Can't see well enough |         4          7 |        11 
----------------------+----------------------+----------
                Total |       749        866 |     1,615 

. tab pan_parenchy ever_mal if radio3==1 & pan_parenchy <2

                      |    Ever experience
                      |     malnutrition?
Pancreatic Parenchyma |       NPM         PM |     Total
----------------------+----------------------+----------
               Normal |       639        809 |     1,448 
----------------------+----------------------+----------
                Total |       639        809 |     1,448 

. tab pan_parenchy ever_mal if radio3==1 & pan_parenchy <3

                      |    Ever experience
                      |     malnutrition?
Pancreatic Parenchyma |       NPM         PM |     Total
----------------------+----------------------+----------
               Normal |       639        809 |     1,448 
             Abnormal |       106         50 |       156 
----------------------+----------------------+----------
                Total |       745        859 |     1,604 

. tab pan_parenchy ever_mal if radio3==1 & pan_parenchy <3, col row chi

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

                      |    Ever experience
                      |     malnutrition?
Pancreatic Parenchyma |       NPM         PM |     Total
----------------------+----------------------+----------
               Normal |       639        809 |     1,448 
                      |     44.13      55.87 |    100.00 
                      |     85.77      94.18 |     90.27 
----------------------+----------------------+----------
             Abnormal |       106         50 |       156 
                      |     67.95      32.05 |    100.00 
                      |     14.23       5.82 |      9.73 
----------------------+----------------------+----------
                Total |       745        859 |     1,604 
                      |     46.45      53.55 |    100.00 
                      |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  32.1211   Pr = 0.000

. tab assay_f

      Fecal |
   Elastase |
      Assay |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        322       15.17       15.17
          1 |      1,800       84.83      100.00
------------+-----------------------------------
      Total |      2,122      100.00

. tab radio2

  Ultrasound |      Freq.     Percent        Cum.
-------------+-----------------------------------
          No |        382       18.00       18.00
         Yes |      1,740       82.00      100.00
-------------+-----------------------------------
       Total |      2,122      100.00

. tab radio3

   USS Scans |
  Visualized |      Freq.     Percent        Cum.
-------------+-----------------------------------
          No |        501       23.61       23.61
         Yes |      1,621       76.39      100.00
-------------+-----------------------------------
       Total |      2,122      100.00

. tab subset

   Analysis |
     Subset |
 (With Fe-1 |
    or USS) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,122      100.00      100.00
------------+-----------------------------------
      Total |      2,122      100.00

. tab recruited

  Recruited |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,122      100.00      100.00
------------+-----------------------------------
      Total |      2,122      100.00

. tab radio_exam
variable radio_exam not found
r(111);

. tab radio2

  Ultrasound |      Freq.     Percent        Cum.
-------------+-----------------------------------
          No |        382       18.00       18.00
         Yes |      1,740       82.00      100.00
-------------+-----------------------------------
       Total |      2,122      100.00

. tab ct2

     CT Scan |      Freq.     Percent        Cum.
-------------+-----------------------------------
          No |      1,831       86.29       86.29
         Yes |        291       13.71      100.00
-------------+-----------------------------------
       Total |      2,122      100.00

. tab ct2 radio3

             | USS Scans Visualized
     CT Scan |        No        Yes |     Total
-------------+----------------------+----------
          No |       498      1,333 |     1,831 
         Yes |         3        288 |       291 
-------------+----------------------+----------
       Total |       501      1,621 |     2,122 

. use "/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data/SAMPA/All_combined_sam
> pa_data.dta", clear

. d radio*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------------
radio           byte    %8.0g      radio      Radio / radio cassette/ CD player
radiol_refer    byte    %17.0g     radiol_refer
                                              What specialist does the radiologist or site clinician think the participant sho
radiol_refer_~s str24   %24s                  Others, specify
radio_exam      byte    %12.0g     radio_exam
                                              Was a radiological examination performed?

. tab radio_exam

       Was a |
radiological |
 examination |
  performed? |      Freq.     Percent        Cum.
-------------+-----------------------------------
         Yes |      1,763      100.00      100.00
-------------+-----------------------------------
       Total |      1,763      100.00

. tab assay_f
variable assay_f not found
r(111);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD00730.000000"

. /* master_imaging.do
> Juan Solon
> March 3 2025
> Purpose
> This serves as the master do file for the Sampa Imaging Elastase Paper
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         01-data
>         02-data-temp
>         03-tables
>         04-do
>         05-figures
>         log 
> */
. 
. **# Create Study Dataset for Analysis
. version 18.5

. 
. local pwd "~/Documents/GitHub/sampa-radio"

. cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. local suffix: display %tdCCYY-NN-DD =daily("`c(current_date)'", "DMY")

. *use "my_file.`suffix'.dta", clear
. capture log close
