---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/juansolon/Documents/GitHub/sampa-radio/log/an_ct_bivariate.txt
  log type:  text
 opened on:  25 Mar 2025, 10:33:06

. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. 
. la var ct_pan_head_ap "Head, AP"

. la var ct_pan_head_trans "Head, Transverse"

. la var ct_pan_body_trans "Body, Transverse"

. la var ct_pan_tail_trans "Tail, Transverse"

. la var ct_pan_body_tail "Body-Tail, Length"

. la var ct_pan_vol "Pancreatic volume(ml)"

. 
. collect clear

. 
. local col "ever_mal"

. local contmed "ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_vol "  /*continous variables; median (p25-p75)  will be repor
> ted*/

. 
. local colhead2 `"0 "NPM" 1 "PM""'

.                 
. * format median of `contmed'
. local nfrmt_p50 "%5.3f"

. local nfrmt_iqr "%5.3f"

. local sfrmt_p25 "(%s-"

. local sfrmt_p75 "%s)"

. 
. local title "Table .Unadjusted CT Measurements"

. count if radio3 ==1
  1,621

. local obs_uss = r(N)

. di `obs_uss'
1621

. count if ct2 ==1
  291

. local obs_ct = r(N)

. di `obs_ct'
291

. local notes1 "Values are [N] median (p25-p50)."

. local notes2 "`obs_uss' contributing any ultrasound measurement."

. local notes3 "`obs_ct' contributing any CT scan measurement."

. local notes4 "P values are for Kruskal-Wallis Tests"

. 
. 
. * STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  
. * THERE IS NOTHING TO MODIFY BEYOND THIS LINE UNLESS CHANGING CODE. 
. 
. * GENERATE TABLE STATS 
. 
.         table (var)(`col')  , ///
>                 stat(frequency) ///
>                 stat(count `contmed') ///
>                 stat(p50 `contmed') ///
>                 stat(p25 `contmed') ///
>                 stat(p75 `contmed') ///
>                 nototal

----------------------------------------------------------------
                              |   Ever experience malnutrition? 
                              |             NPM               PM
------------------------------+---------------------------------
Frequency                     |           1,101            1,021
Head, AP                      |                                 
  Number of nonmissing values |             149              141
  50th percentile             |            2.57             2.44
  25th percentile             |            2.29             2.15
  75th percentile             |             2.8             2.77
Head, Transverse              |                                 
  Number of nonmissing values |             148              139
  50th percentile             |             2.6             2.64
  25th percentile             |           2.395             2.32
  75th percentile             |             2.9             2.92
Body, Transverse              |                                 
  Number of nonmissing values |             148              141
  50th percentile             |            2.06             2.09
  25th percentile             |           1.725             1.73
  75th percentile             |            2.32             2.41
Tail, Transverse              |                                 
  Number of nonmissing values |             149              139
  50th percentile             |            1.76             1.77
  25th percentile             |            1.47             1.51
  75th percentile             |               2             2.08
Body-Tail, Length             |                                 
  Number of nonmissing values |             102              112
  50th percentile             |           10.65           10.015
  25th percentile             |            9.56            9.175
  75th percentile             |           11.75            10.94
Pancreatic volume(ml)         |                                 
  Number of nonmissing values |             101              108
  50th percentile             |        64.94215         62.00394
  25th percentile             |        54.50868         47.52549
  75th percentile             |         80.0287         80.46837
----------------------------------------------------------------

.                 
. collect rename Table c1
(current collection is c1)

.                 
. *REFORMAT RESULTS TO DESIRED COLUMNS
.                 
.         * recodes median and iqr
.                 collect recode result p50 = column1
(12 items recoded in collection c1)

.                 collect recode result p25 = column2
(12 items recoded in collection c1)

.                 collect recode result p75 = column3
(12 items recoded in collection c1)

.                 
.         * Create composite result : this is needed because 75 is in column3 and we want it in the same column as column 2 .  Use for medians and probably CIs
.                 collect composite define column4 = column2 column3, replace

. 
.         * Calculate p-values from chi2 and df
.         foreach v in `contmed' {
  2.                 quietly kwallis `v', by(`col')
  3.                 collect: mystats
  4.         }

. 
.         
. * CREATE THE TABLE 1 Layout Super column - column 
. 
.         collect layout (var) (ever_mal#result[count column1 column4])

Collection: c1
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 6 x 6

--------------------------------------------------------------------------------------------------------------------------------------------------
                      |                                                Ever experience malnutrition?                                              
                      |                              NPM                                                            PM                            
                      |  Number of nonmissing values    column1      column2 column3   Number of nonmissing values    column1      column2 column3
----------------------+---------------------------------------------------------------------------------------------------------------------------
Head, AP              |                          149       2.57       2.29       2.8                           141       2.44       2.15      2.77
Head, Transverse      |                          148        2.6      2.395       2.9                           139       2.64       2.32      2.92
Body, Transverse      |                          148       2.06      1.725      2.32                           141       2.09       1.73      2.41
Tail, Transverse      |                          149       1.76       1.47         2                           139       1.77       1.51      2.08
Body-Tail, Length     |                          102      10.65       9.56     11.75                           112     10.015      9.175     10.94
Pancreatic volume(ml) |                          101   64.94215   54.50868   80.0287                           108   62.00394   47.52549  80.46837
--------------------------------------------------------------------------------------------------------------------------------------------------

. 
. * Format p-values
.         collect style cell result[p], nformat("%5.3f")

.         collect style cell result[p], sformat("p=%s")

. 
. * CHANGE HEADER TEXT
.         * column
.                 collect label levels `col' `colhead2', modify

. 
. collect preview /* preview changes */

--------------------------------------------------------------------------------------------------------------------------------------------------
                      |                                                Ever experience malnutrition?                                              
                      |                              NPM                                                            PM                            
                      |  Number of nonmissing values    column1      column2 column3   Number of nonmissing values    column1      column2 column3
----------------------+---------------------------------------------------------------------------------------------------------------------------
Head, AP              |                          149       2.57       2.29       2.8                           141       2.44       2.15      2.77
Head, Transverse      |                          148        2.6      2.395       2.9                           139       2.64       2.32      2.92
Body, Transverse      |                          148       2.06      1.725      2.32                           141       2.09       1.73      2.41
Tail, Transverse      |                          149       1.76       1.47         2                           139       1.77       1.51      2.08
Body-Tail, Length     |                          102      10.65       9.56     11.75                           112     10.015      9.175     10.94
Pancreatic volume(ml) |                          101   64.94215   54.50868   80.0287                           108   62.00394   47.52549  80.46837
--------------------------------------------------------------------------------------------------------------------------------------------------

. 
. * HIDE COLUMN HEADERS
. 
.         * Hide supercolumn variable name because it is self-descriptive
.                 
.         *       collect style header `scol', title(hide) /* this removes the column variable name or label by hiding it */
. 
.         * Hide the column variable name 
.                 
.                 collect style header `col', title(hide) /* this removes the column variable name or label by hiding it */

. 
.         * Hide the words column 1 and column 2 for the results 
. 
.                 collect style header result, level(hide) /* this removes column 1 and column2 header names*/

. 
. collect preview /* preview changes */

--------------------------------------------------------------------------------------------------
                      |                  NPM                                    PM                
----------------------+---------------------------------------------------------------------------
Head, AP              |  149       2.57       2.29       2.8   141       2.44       2.15      2.77
Head, Transverse      |  148        2.6      2.395       2.9   139       2.64       2.32      2.92
Body, Transverse      |  148       2.06      1.725      2.32   141       2.09       1.73      2.41
Tail, Transverse      |  149       1.76       1.47         2   139       1.77       1.51      2.08
Body-Tail, Length     |  102      10.65       9.56     11.75   112     10.015      9.175     10.94
Pancreatic volume(ml) |  101   64.94215   54.50868   80.0287   108   62.00394   47.52549  80.46837
--------------------------------------------------------------------------------------------------

. 
. * MODIFY ROW TEXT
. 
. 
. * REVISE ROW STYLES
. 
. * Stack levels of each variable , place a space between variables (spacer) ; 
. 
.         collect style row stack, nobinder spacer

. 
. * Remove vertical line after variables
. 
.         collect style cell border_block, border(right, pattern(nil))

. 
. * HIDE ROW Text
. 
. * Hide the variable names 
. collect style header `hiderows', title(hide)

. 
. 
. * FORMAT NUMBERS
. 
. * Format median
. 
.         collect style cell result[column1]#var[`contmed'], nformat(`nfrmt_p50')

. 
. * Add IQR formatting to p25 and p75 separately:
.         collect style cell result[column2]#var[`contmed'], nformat(`nfrmt_iqr') sformat("`sfrmt_p25'") /* formats iqr as (p25 - p75)*/

.         collect style cell result[column3]#var[`contmed'], nformat(`nfrmt_iqr') sformat("`sfrmt_p75'") 

. 
. * Format count column
.         collect style cell result[count], nformat("%4.0f") /* Format count as whole number */

.         collect style cell result[count], sformat("[%s]") /* Format count as whole number */

.         
. /* format factor variables (categorical) column 1 and column 2
> 
>         collect style cell var[`frmt_catvar1']#result[column1], nformat(`nfrmt_freq')
> 
>         collect style cell var[`frmt_catvar1']#result[column2], nformat(`nfrmt_perc') sformat("(`sfrmt_perc')") /* Adds (%) to percent */
> 
> * format means variable column 1 and column 2
> 
>         collect style cell var[`contn']#result[column1], nformat(`nfrmt_mean') /* Formats continuous variable to one decimal*/
> 
>         collect style cell var[`contn']#result[column2], nformat(`nfrmt_sd') sformat(`sfrmt_sd') /* Formats continuous variable to one decimal*/
> */
. * Change font of results
.         *collect style cell var[`contn']#result[column1], nformat(`nfrmt_mean') /* Formats continuous variable to one decimal*/
.         
. * Add text
.         collect title `title'

.         collect notes `notes1'

.         collect notes `notes2'

.         collect notes `notes3'

.         collect notes `notes4'

.         
. collect preview

Table .Unadjusted CT Measurements
--------------------------------------------------------------------------------------------
                                      NPM                                  PM               
--------------------------------------------------------------------------------------------
Head, AP               [149]    2.570     (2.290- 2.800)   [141]    2.440     (2.150- 2.770)
Head, Transverse       [148]    2.600     (2.395- 2.900)   [139]    2.640     (2.320- 2.920)
Body, Transverse       [148]    2.060     (1.725- 2.320)   [141]    2.090     (1.730- 2.410)
Tail, Transverse       [149]    1.760     (1.470- 2.000)   [139]    1.770     (1.510- 2.080)
Body-Tail, Length      [102]   10.650    (9.560- 11.750)   [112]   10.015    (9.175- 10.940)
Pancreatic volume(ml)  [101]   64.942   (54.509- 80.029)   [108]   62.004   (47.525- 80.468)
--------------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
1621 contributing any ultrasound measurement.
291 contributing any CT scan measurement.
P values are for Kruskal-Wallis Tests

. 
. * Save first collection with main stats
. collect layout (var) (ever_mal#result[count column1 column4])

Collection: c1
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 6 x 6

Table .Unadjusted CT Measurements
--------------------------------------------------------------------------------------------
                                      NPM                                  PM               
--------------------------------------------------------------------------------------------
Head, AP               [149]    2.570     (2.290- 2.800)   [141]    2.440     (2.150- 2.770)
Head, Transverse       [148]    2.600     (2.395- 2.900)   [139]    2.640     (2.320- 2.920)
Body, Transverse       [148]    2.060     (1.725- 2.320)   [141]    2.090     (1.730- 2.410)
Tail, Transverse       [149]    1.760     (1.470- 2.000)   [139]    1.770     (1.510- 2.080)
Body-Tail, Length      [102]   10.650    (9.560- 11.750)   [112]   10.015    (9.175- 10.940)
Pancreatic volume(ml)  [101]   64.942   (54.509- 80.029)   [108]   62.004   (47.525- 80.468)
--------------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
1621 contributing any ultrasound measurement.
291 contributing any CT scan measurement.
P values are for Kruskal-Wallis Tests

. collect save ./tables/ct1.json, replace
(collection c1 saved to file ./tables/ct1.json)

. 
. * Create new collection for p-values
. collect create c2
(current collection is c2)

. foreach v in `contmed' {
  2.     quietly kwallis `v', by(`col')
  3.     collect: mystats
  4. }

.    
.    
. 
. * Remap cmdset to match var levels
. collect recode cmdset 1 = ct_pan_head_ap
(5 items recoded in collection c2)

. collect recode cmdset 2 = ct_pan_head_trans
(5 items recoded in collection c2)

. collect recode cmdset 3 = ct_pan_body_trans
(5 items recoded in collection c2)

. collect recode cmdset 4 = ct_pan_tail_trans
(5 items recoded in collection c2)

. collect recode cmdset 5 = ct_pan_body_tail
(5 items recoded in collection c2)

. collect recode cmdset 6 = ct_pan_vol
(5 items recoded in collection c2)

. collect remap cmdset = var
(30 items remapped in collection c2)

. 
. * Combine collections
. collect combine c4 = c1 c2
(current collection is c4)

. 
. * Create layout for combined collection
. collect layout (var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans ///
>                                 ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_vol]) ///
>                                 (ever_mal#result[count column1 column4] result[p])   
(level pan_body_trans of dimension var not found)
(level pan_head_ap of dimension var not found)
(level pan_head_trans of dimension var not found)
(level pan_tail_trans of dimension var not found)

Collection: c4
      Rows: var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail
            ct_pan_vol]
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 6 x 7

Table .Unadjusted CT Measurements
------------------------------------------------------------------------------------------------------
                                      NPM                                  PM                         
------------------------------------------------------------------------------------------------------
Head, AP               [149]    2.570     (2.290- 2.800)   [141]    2.440     (2.150- 2.770)   p=0.155
Head, Transverse       [148]    2.600     (2.395- 2.900)   [139]    2.640     (2.320- 2.920)   p=0.953
Body, Transverse       [148]    2.060     (1.725- 2.320)   [141]    2.090     (1.730- 2.410)   p=0.379
Tail, Transverse       [149]    1.760     (1.470- 2.000)   [139]    1.770     (1.510- 2.080)   p=0.461
Body-Tail, Length      [102]   10.650    (9.560- 11.750)   [112]   10.015    (9.175- 10.940)   p=0.001
Pancreatic volume(ml)  [101]   64.942   (54.509- 80.029)   [108]   62.004   (47.525- 80.468)   p=0.463
------------------------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
1621 contributing any ultrasound measurement.
291 contributing any CT scan measurement.
P values are for Kruskal-Wallis Tests

.   
. 
. 
. collect save ./tables/ct1, replace      
(collection c4 saved to file ./tables/ct1.stjson)

. * Export combined table
. collect export ./tables/ct1.html, as(html) replace
(collection c4 exported to file ./tables/ct1.html)

. collect export ./tables/ct1.docx, as(docx) replace
(collection c4 exported to file ./tables/ct1.docx)

. collect export ./tables/ct1.xlsx, as(xlsx) replace
(collection c4 exported to file ./tables/ct1.xlsx)

. 
. collect use ./tables/uss1
(collection c3 read from file ./tables/uss1.stjson)

. 
. collect combine c5 = c3 c4
(current collection is c5)

. 
. collect layout (var) (ever_mal#result[count column1 column4] result[p])   

Collection: c5
      Rows: var
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 10 x 7

Table .Unadjusted Ultrasound Measurements
------------------------------------------------------------------------------------------------------
                                      NPM                                  PM                         
------------------------------------------------------------------------------------------------------
Head, AP               [149]    2.570     (2.290- 2.800)   [141]    2.440     (2.150- 2.770)   p=0.155
Head, AP               [715]    2.090     (1.860- 2.350)   [837]    2.070     (1.780- 2.390)   p=0.214
Head, Transverse       [148]    2.600     (2.395- 2.900)   [139]    2.640     (2.320- 2.920)   p=0.953
Head, Transverse       [635]    2.100     (1.860- 2.350)   [764]    1.820     (1.460- 2.200)   p=0.000
Body, Transverse       [148]    2.060     (1.725- 2.320)   [141]    2.090     (1.730- 2.410)   p=0.379
Body, Transverse       [745]    1.240     (1.070- 1.500)   [863]    1.230     (1.030- 1.490)   p=0.081
Tail, Transverse       [149]    1.760     (1.470- 2.000)   [139]    1.770     (1.510- 2.080)   p=0.461
Tail, Transverse       [509]    1.230     (1.070- 1.590)   [692]    1.420     (1.140- 1.715)   p=0.000
Body-Tail, Length      [102]   10.650    (9.560- 11.750)   [112]   10.015    (9.175- 10.940)   p=0.001
Pancreatic volume(ml)  [101]   64.942   (54.509- 80.029)   [108]   62.004   (47.525- 80.468)   p=0.463
------------------------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
1621 contributing any ultrasound measurement.
291 contributing any CT scan measurement.

. 
. * Reorder rows 
. collect layout (var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans ///
>                                 ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_vol]) ///
>                                 (ever_mal#result[count column1 column4] result[p]) 

Collection: c5
      Rows: var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail
            ct_pan_vol]
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 10 x 7

Table .Unadjusted Ultrasound Measurements
------------------------------------------------------------------------------------------------------
                                      NPM                                  PM                         
------------------------------------------------------------------------------------------------------
Head, AP               [715]    2.090     (1.860- 2.350)   [837]    2.070     (1.780- 2.390)   p=0.214
Head, Transverse       [635]    2.100     (1.860- 2.350)   [764]    1.820     (1.460- 2.200)   p=0.000
Body, Transverse       [745]    1.240     (1.070- 1.500)   [863]    1.230     (1.030- 1.490)   p=0.081
Tail, Transverse       [509]    1.230     (1.070- 1.590)   [692]    1.420     (1.140- 1.715)   p=0.000
Head, AP               [149]    2.570     (2.290- 2.800)   [141]    2.440     (2.150- 2.770)   p=0.155
Head, Transverse       [148]    2.600     (2.395- 2.900)   [139]    2.640     (2.320- 2.920)   p=0.953
Body, Transverse       [148]    2.060     (1.725- 2.320)   [141]    2.090     (1.730- 2.410)   p=0.379
Tail, Transverse       [149]    1.760     (1.470- 2.000)   [139]    1.770     (1.510- 2.080)   p=0.461
Body-Tail, Length      [102]   10.650    (9.560- 11.750)   [112]   10.015    (9.175- 10.940)   p=0.001
Pancreatic volume(ml)  [101]   64.942   (54.509- 80.029)   [108]   62.004   (47.525- 80.468)   p=0.463
------------------------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
1621 contributing any ultrasound measurement.
291 contributing any CT scan measurement.

.                                 
. * Add a Dimension for USS and CT Variables
. 
. collect addtags vartype[USS 1621 contributing any measurement], fortags(var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans])
(52 items changed in collection c5)

. collect addtags vartype[CT 291 contributing any measurement], fortags(var[ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_vo
> l])
(78 items changed in collection c5)

. 
. collect layout (vartype#var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans ///
>                                 ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_vol]) ///
>                                 (ever_mal#result[count column1 column4] result[p]) 

Collection: c5
      Rows: vartype#var[pan_head_ap pan_head_trans pan_body_trans pan_tail_trans ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail
            ct_pan_vol]
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 13 x 7

Table .Unadjusted Ultrasound Measurements
----------------------------------------------------------------------------------------------------------------------
                                                      NPM                                  PM                         
----------------------------------------------------------------------------------------------------------------------
USS 1621 contributing any measurement                                                                                 
  Head, AP                             [715]    2.090     (1.860- 2.350)   [837]    2.070     (1.780- 2.390)   p=0.214
  Head, Transverse                     [635]    2.100     (1.860- 2.350)   [764]    1.820     (1.460- 2.200)   p=0.000
  Body, Transverse                     [745]    1.240     (1.070- 1.500)   [863]    1.230     (1.030- 1.490)   p=0.081
  Tail, Transverse                     [509]    1.230     (1.070- 1.590)   [692]    1.420     (1.140- 1.715)   p=0.000
                                                                                                                      
CT 291 contributing any measurement                                                                                   
  Head, AP                             [149]    2.570     (2.290- 2.800)   [141]    2.440     (2.150- 2.770)   p=0.155
  Head, Transverse                     [148]    2.600     (2.395- 2.900)   [139]    2.640     (2.320- 2.920)   p=0.953
  Body, Transverse                     [148]    2.060     (1.725- 2.320)   [141]    2.090     (1.730- 2.410)   p=0.379
  Tail, Transverse                     [149]    1.760     (1.470- 2.000)   [139]    1.770     (1.510- 2.080)   p=0.461
  Body-Tail, Length                    [102]   10.650    (9.560- 11.750)   [112]   10.015    (9.175- 10.940)   p=0.001
  Pancreatic volume(ml)                [101]   64.942   (54.509- 80.029)   [108]   62.004   (47.525- 80.468)   p=0.463
----------------------------------------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
1621 contributing any ultrasound measurement.
291 contributing any CT scan measurement.

.                                 
. collect notes, clear

. collect notes "Values are [N] median (p25-p75)."

. collect notes "P values are for Kruskal-Wallis tests."

. collect title "Radiologic measurements in the whole cohort, by prior exposure"                          

. collect save ./tables/uss_ct, replace   
(collection c5 saved to file ./tables/uss_ct.stjson)

. * Export combined table
. collect export ./tables/uss_ct.html, as(html) replace
(collection c5 exported to file ./tables/uss_ct.html)

. collect export ./tables/uss_ct.docx, as(docx) replace
(collection c5 exported to file ./tables/uss_ct.docx)

. collect export ./tables/uss_ct.xlsx, as(xlsx) replace
(collection c5 exported to file ./tables/uss_ct.xlsx)

. 
. 
. 
. 
. /* END END END END END END END END END END END END END END END END END END END END */
.         
. 
. 
end of do-file

. d crp
variable crp not found
r(111);

. tab assay_f

      Fecal |
   Elastase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        322       15.17       15.17
          1 |      1,800       84.83      100.00
------------+-----------------------------------
      Total |      2,122      100.00

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. capture log close
