{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/juansolon/Documents/GitHub/sampa-radio/log/an_cont.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Mar 2025, 08:51:32
{txt}
{com}. 
. * 1. Descriptive Statistics
. * ------------------------
. * Basic statistics for key variables
. table () (ever_mal), ///
>     stat(frequency) /// 
>     stat(mean fecal_elastase) ///
>     stat(p25 fecal_elastase) ///
>     stat(p50 fecal_elastase) ///
>     stat(p75 fecal_elastase) ///
>     stat(iqr fecal_elastase)
{res}
{smcl}
{reset}{...}
{hline 19}{c -}{c TT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
{space 19} {c |}  {space 2}Ever experience malnutrition?{space 2}
{space 19} {c |}  {space 6}NPM   {space 7}PM   {space 4}Total
{hline 19}{c -}{c +}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
Frequency{space 10} {c |}  {space 4}{result:1,181}   {space 4}{result:1,097}   {space 4}{result:2,278}
Mean{space 15} {c |}  {space 1}{result:332.6861}   {space 1}{result:360.9896}   {space 1}{result:345.2358}
25th percentile{space 4} {c |}  {space 2}{result:132.437}   {space 1}{result:146.2165}   {space 2}{result:140.296}
50th percentile{space 4} {c |}  {space 2}{result:313.704}   {space 2}{result:374.824}   {space 2}{result:341.183}
75th percentile{space 4} {c |}  {space 1}{result:587.6312}   {space 6}{result:600}   {space 6}{result:600}
Interquartile range {c |}  {space 1}{result:455.1942}   {space 1}{result:453.7835}   {space 2}{result:459.704}
{hline 19}{c -}{c BT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}

{com}. 
. table () (bmi_cat), ///
>     stat(frequency) /// 
>     stat(mean fecal_elastase) ///
>     stat(p25 fecal_elastase) ///
>     stat(p50 fecal_elastase) ///
>     stat(p75 fecal_elastase) ///
>     stat(iqr fecal_elastase)
{res}
{smcl}
{reset}{...}
{hline 19}{c -}{c TT}{c -}{c -}{hline 11}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 8}{c -}{c -}{c -}{hline 8}
{space 19} {c |}  {space 11}BMI classification of children and adult{space 11}
{space 19} {c |}  Underweight   Normal Weight   Overweight   {space 3}Obese   {space 3}Total
{hline 19}{c -}{c +}{c -}{c -}{hline 11}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 8}{c -}{c -}{c -}{hline 8}
Frequency{space 10} {c |}  {space 8}{result:493}   {space 8}{result:1,192}   {space 7}{result:392}   {space 5}{result:194}   {space 3}{result:2,271}
Mean{space 15} {c |}  {space 3}{result:353.6853}   {space 5}{result:327.6411}   {space 2}{result:363.5746}   {result:389.6134}   {result:345.2358}
25th percentile{space 4} {c |}  {space 4}{result:145.721}   {space 6}{result:121.446}   {space 3}{result:165.132}   {space 1}{result:204.032}   {space 1}{result:140.296}
50th percentile{space 4} {c |}  {space 4}{result:357.286}   {space 6}{result:301.578}   {space 2}{result:369.7907}   {result:445.2305}   {space 1}{result:341.183}
75th percentile{space 4} {c |}  {space 8}{result:600}   {space 6}{result:586.526}   {space 7}{result:600}   {space 5}{result:600}   {space 5}{result:600}
Interquartile range {c |}  {space 4}{result:454.279}   {space 7}{result:465.08}   {space 3}{result:434.868}   {space 1}{result:395.968}   {space 1}{result:459.704}
{hline 19}{c -}{c BT}{c -}{c -}{hline 11}{c -}{c -}{c -}{hline 13}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 8}{c -}{c -}{c -}{hline 8}

{com}. 
. * 2. Basic Model
. * -------------
. * Model 1: Basic model with main effects only
. tobit fecal_elastase i.ever_mal i.bmi_cat i.africa i.child i.exposure i.hiv2, ul(600)
{res}{txt}
Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-9843.7774}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-9843.7774}  
Iteration 1:{space 2}Log likelihood = {res:-9739.8659}  
Iteration 2:{space 2}Log likelihood = {res:-9734.8617}  
Iteration 3:{space 2}Log likelihood = {res:-9734.8352}  
Iteration 4:{space 2}Log likelihood = {res:-9734.8352}  
{res}
{txt}{col 1}Tobit regression{col 53}{lalign 17:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 53}{ralign 17:Uncensored}{col 70} = {res}{ralign 6:1,342}
{txt}{col 1}Limits: Lower = {ralign 4:{txt:-inf}}{col 53}{ralign 17:Left-censored}{col 70} = {res}{ralign 6:0}
{txt}{col 1}        Upper = {ralign 4:{res:600}}{col 53}{ralign 17:   Right-censored}{col 70} = {res}{ralign 6:460}

{txt}{col 53}{lalign 17:LR chi2({res:8})}{col 70} = {res}{ralign 6:322.00}
{txt}{col 53}{lalign 17:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-9734.8352}{txt}{col 53}{lalign 17:Pseudo R2}{col 70} = {res}{ralign 6:0.0163}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       fecal_elastase{col 23}{c |} Coefficient{col 35}  Std. err.{col 47}      t{col 55}   P>|t|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}ever_mal {c |}
{space 18}PM  {c |}{col 23}{res}{space 2} 41.61613{col 35}{space 2} 14.48215{col 46}{space 1}    2.87{col 55}{space 3}0.004{col 63}{space 4} 13.21248{col 76}{space 3} 70.01978
{txt}{space 21} {c |}
{space 14}bmi_cat {c |}
{space 7}Normal Weight  {c |}{col 23}{res}{space 2} 2.092399{col 35}{space 2} 17.92108{col 46}{space 1}    0.12{col 55}{space 3}0.907{col 63}{space 4}-33.05598{col 76}{space 3} 37.24077
{txt}{space 10}Overweight  {c |}{col 23}{res}{space 2}   30.246{col 35}{space 2} 23.24841{col 46}{space 1}    1.30{col 55}{space 3}0.193{col 63}{space 4}-15.35082{col 76}{space 3} 75.84281
{txt}{space 15}Obese  {c |}{col 23}{res}{space 2} 75.45591{col 35}{space 2}  27.7536{col 46}{space 1}    2.72{col 55}{space 3}0.007{col 63}{space 4} 21.02314{col 76}{space 3} 129.8887
{txt}{space 21} {c |}
{space 15}africa {c |}
{space 16}Asia  {c |}{col 23}{res}{space 2} 235.7783{col 35}{space 2} 19.23939{col 46}{space 1}   12.25{col 55}{space 3}0.000{col 63}{space 4} 198.0443{col 76}{space 3} 273.5123
{txt}{space 21} {c |}
{space 16}child {c |}
{space 15}Adult  {c |}{col 23}{res}{space 2} 16.35228{col 35}{space 2} 28.58696{col 46}{space 1}    0.57{col 55}{space 3}0.567{col 63}{space 4}-39.71496{col 76}{space 3} 72.41952
{txt}{space 21} {c |}
{space 9}exposuretime {c |}
{space 2}Exposure as Adults  {c |}{col 23}{res}{space 2}-23.61594{col 35}{space 2} 23.58824{col 46}{space 1}   -1.00{col 55}{space 3}0.317{col 63}{space 4}-69.87925{col 76}{space 3} 22.64737
{txt}{space 15}1.hiv2 {c |}{col 23}{res}{space 2} 35.54418{col 35}{space 2} 16.64722{col 46}{space 1}    2.14{col 55}{space 3}0.033{col 63}{space 4} 2.894205{col 76}{space 3} 68.19415
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 256.5173{col 35}{space 2} 27.34468{col 46}{space 1}    9.38{col 55}{space 3}0.000{col 63}{space 4} 202.8865{col 76}{space 3} 310.1481
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.fecal_elastase){c |}{col 23}{res}{space 2} 62690.33{col 35}{space 2}  2572.14{col 63}{space 4} 57843.27{col 76}{space 3} 67943.57
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store m1
{txt}
{com}. estimates title: "Basic Model"
{txt}
{com}. 
. * 3. Model with BMI-Malnutrition Interaction
. * ----------------------------------------
. * Model 2: Adding BMI-malnutrition interaction
. tobit fecal_elastase i.ever_mal##i.bmi_cat i.africa i.child i.exposure i.hiv2, ul(600)
{res}{txt}
Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-9840.0183}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-9840.0183}  
Iteration 1:{space 2}Log likelihood = {res:-9735.9086}  
Iteration 2:{space 2}Log likelihood = {res:-9730.8649}  
Iteration 3:{space 2}Log likelihood = {res:-9730.8378}  
Iteration 4:{space 2}Log likelihood = {res:-9730.8378}  
{res}
{txt}{col 1}Tobit regression{col 53}{lalign 17:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 53}{ralign 17:Uncensored}{col 70} = {res}{ralign 6:1,342}
{txt}{col 1}Limits: Lower = {ralign 4:{txt:-inf}}{col 53}{ralign 17:Left-censored}{col 70} = {res}{ralign 6:0}
{txt}{col 1}        Upper = {ralign 4:{res:600}}{col 53}{ralign 17:   Right-censored}{col 70} = {res}{ralign 6:460}

{txt}{col 53}{lalign 17:LR chi2({res:11})}{col 70} = {res}{ralign 6:329.99}
{txt}{col 53}{lalign 17:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-9730.8378}{txt}{col 53}{lalign 17:Pseudo R2}{col 70} = {res}{ralign 6:0.0167}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       fecal_elastase{col 23}{c |} Coefficient{col 35}  Std. err.{col 47}      t{col 55}   P>|t|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}ever_mal {c |}
{space 18}PM  {c |}{col 23}{res}{space 2} 77.01913{col 35}{space 2} 40.55823{col 46}{space 1}    1.90{col 55}{space 3}0.058{col 63}{space 4}  -2.5273{col 76}{space 3} 156.5656
{txt}{space 21} {c |}
{space 14}bmi_cat {c |}
{space 7}Normal Weight  {c |}{col 23}{res}{space 2} 25.66155{col 35}{space 2} 39.62099{col 46}{space 1}    0.65{col 55}{space 3}0.517{col 63}{space 4}-52.04668{col 76}{space 3} 103.3698
{txt}{space 10}Overweight  {c |}{col 23}{res}{space 2} 72.87361{col 35}{space 2} 41.73423{col 46}{space 1}    1.75{col 55}{space 3}0.081{col 63}{space 4}-8.979298{col 76}{space 3} 154.7265
{txt}{space 15}Obese  {c |}{col 23}{res}{space 2} 119.4963{col 35}{space 2}  44.3051{col 46}{space 1}    2.70{col 55}{space 3}0.007{col 63}{space 4} 32.60114{col 76}{space 3} 206.3914
{txt}{space 21} {c |}
{space 5}ever_mal#bmi_cat {c |}
{space 4}PM#Normal Weight  {c |}{col 23}{res}{space 2}-19.32412{col 35}{space 2} 44.18039{col 46}{space 1}   -0.44{col 55}{space 3}0.662{col 63}{space 4}-105.9746{col 76}{space 3}  67.3264
{txt}{space 7}PM#Overweight  {c |}{col 23}{res}{space 2}-97.85007{col 35}{space 2} 53.95017{col 46}{space 1}   -1.81{col 55}{space 3}0.070{col 63}{space 4} -203.662{col 76}{space 3} 7.961824
{txt}{space 12}PM#Obese  {c |}{col 23}{res}{space 2}-139.7205{col 35}{space 2} 70.82106{col 46}{space 1}   -1.97{col 55}{space 3}0.049{col 63}{space 4}-278.6211{col 76}{space 3}-.8198564
{txt}{space 21} {c |}
{space 15}africa {c |}
{space 16}Asia  {c |}{col 23}{res}{space 2} 236.6905{col 35}{space 2} 19.20443{col 46}{space 1}   12.32{col 55}{space 3}0.000{col 63}{space 4}  199.025{col 76}{space 3} 274.3559
{txt}{space 21} {c |}
{space 16}child {c |}
{space 15}Adult  {c |}{col 23}{res}{space 2} 16.45628{col 35}{space 2} 28.71254{col 46}{space 1}    0.57{col 55}{space 3}0.567{col 63}{space 4}-39.85732{col 76}{space 3} 72.76988
{txt}{space 21} {c |}
{space 9}exposuretime {c |}
{space 2}Exposure as Adults  {c |}{col 23}{res}{space 2}-27.10801{col 35}{space 2} 23.58331{col 46}{space 1}   -1.15{col 55}{space 3}0.251{col 63}{space 4} -73.3617{col 76}{space 3} 19.14569
{txt}{space 15}1.hiv2 {c |}{col 23}{res}{space 2} 36.21045{col 35}{space 2} 16.62211{col 46}{space 1}    2.18{col 55}{space 3}0.030{col 63}{space 4} 3.609692{col 76}{space 3} 68.81121
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 228.0529{col 35}{space 2} 40.38749{col 46}{space 1}    5.65{col 55}{space 3}0.000{col 63}{space 4} 148.8413{col 76}{space 3} 307.2645
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.fecal_elastase){c |}{col 23}{res}{space 2}  62399.8{col 35}{space 2} 2559.788{col 63}{space 4} 57575.97{col 76}{space 3} 67627.78
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store m2
{txt}
{com}. estimates title: "Model with BMI-Malnutrition Interaction"
{txt}
{com}. 
. * Compare models
. lrtest m1 m2

{txt}Likelihood-ratio test
Assumption: {res}{stata est replay m1:m1}{txt} nested within {res}{stata est replay m2:m2}

{txt}{ralign 11:LR chi2({res:3})} = {res}{ralign 6:7.99}
{txt}{ralign 11:Prob > chi2} = {res}{ralign 6:0.0461}
{txt}
{com}. 
. * 4. Marginal Effects Analysis
. * --------------------------
. * Calculate marginal effects for the interaction model
. margins, dydx(*) atmeans
{res}
{txt}{col 1}Conditional marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Linear prediction, predict()}{p_end}
{p2col:dy/dx wrt:}{res:1.ever_mal 2.bmi_cat 3.bmi_cat 4.bmi_cat 2.africa 2.child 2.exposuretime 1.hiv2}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 14:0.ever_mal} = {res:{ralign 8:.5566038}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.ever_mal} = {res:{ralign 8:.4433962}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.africa} = {res:{ralign 8:.63596}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.africa} = {res:{ralign 8:.36404}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.child} = {res:{ralign 8:.1115427}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.child} = {res:{ralign 8:.8884573}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.exposuretime} = {res:{ralign 8:.27303}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.exposuretime} = {res:{ralign 8:.72697}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:0.hiv2} = {res:{ralign 8:.6104329}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.hiv2} = {res:{ralign 8:.3895671}} {txt:(mean)}

{res}{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33} Delta-method
{col 21}{c |}      dy/dx{col 33}   std. err.{col 45}      t{col 53}   P>|t|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}ever_mal {c |}
{space 16}PM  {c |}{col 21}{res}{space 2} 34.95444{col 33}{space 2} 15.05757{col 44}{space 1}    2.32{col 53}{space 3}0.020{col 61}{space 4} 5.422195{col 74}{space 3} 64.48669
{txt}{space 19} {c |}
{space 12}bmi_cat {c |}
{space 5}Normal Weight  {c |}{col 21}{res}{space 2} 17.09331{col 33}{space 2} 23.94468{col 44}{space 1}    0.71{col 53}{space 3}0.475{col 61}{space 4}-29.86913{col 74}{space 3} 64.05575
{txt}{space 8}Overweight  {c |}{col 21}{res}{space 2} 29.48726{col 33}{space 2} 28.63409{col 44}{space 1}    1.03{col 53}{space 3}0.303{col 61}{space 4}-26.67247{col 74}{space 3} 85.64699
{txt}{space 13}Obese  {c |}{col 21}{res}{space 2} 57.54474{col 33}{space 2} 35.78915{col 44}{space 1}    1.61{col 53}{space 3}0.108{col 61}{space 4}-12.64815{col 74}{space 3} 127.7376
{txt}{space 19} {c |}
{space 13}africa {c |}
{space 14}Asia  {c |}{col 21}{res}{space 2} 236.6905{col 33}{space 2} 19.20443{col 44}{space 1}   12.32{col 53}{space 3}0.000{col 61}{space 4}  199.025{col 74}{space 3} 274.3559
{txt}{space 19} {c |}
{space 14}child {c |}
{space 13}Adult  {c |}{col 21}{res}{space 2} 16.45628{col 33}{space 2} 28.71254{col 44}{space 1}    0.57{col 53}{space 3}0.567{col 61}{space 4}-39.85732{col 74}{space 3} 72.76988
{txt}{space 19} {c |}
{space 7}exposuretime {c |}
Exposure as Adults  {c |}{col 21}{res}{space 2}-27.10801{col 33}{space 2} 23.58331{col 44}{space 1}   -1.15{col 53}{space 3}0.251{col 61}{space 4} -73.3617{col 74}{space 3} 19.14569
{txt}{space 13}1.hiv2 {c |}{col 21}{res}{space 2} 36.21045{col 33}{space 2} 16.62211{col 44}{space 1}    2.18{col 53}{space 3}0.030{col 61}{space 4} 3.609692{col 74}{space 3} 68.81121
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 85}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. 
. * Create margins plots for BMI-malnutrition interaction
. margins ever_mal#bmi_cat, atmeans
{res}
{txt}{col 1}Adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 14:1.africa} = {res:{ralign 8:.63596}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.africa} = {res:{ralign 8:.36404}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.child} = {res:{ralign 8:.1115427}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.child} = {res:{ralign 8:.8884573}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.exposuretime} = {res:{ralign 8:.27303}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.exposuretime} = {res:{ralign 8:.72697}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:0.hiv2} = {res:{ralign 8:.6104329}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.hiv2} = {res:{ralign 8:.3895671}} {txt:(mean)}

{res}{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32} Delta-method
{col 20}{c |}     Margin{col 32}   std. err.{col 44}      t{col 52}   P>|t|{col 60}     [95% con{col 73}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}ever_mal#bmi_cat {c |}
{space 2}NPM#Underweight  {c |}{col 20}{res}{space 2} 323.2381{col 32}{space 2} 37.90205{col 43}{space 1}    8.53{col 52}{space 3}0.000{col 60}{space 4} 248.9012{col 73}{space 3}  397.575
{txt}NPM#Normal Weight  {c |}{col 20}{res}{space 2} 348.8997{col 32}{space 2}  11.3091{col 43}{space 1}   30.85{col 52}{space 3}0.000{col 60}{space 4} 326.7192{col 73}{space 3} 371.0801
{txt}{space 3}NPM#Overweight  {c |}{col 20}{res}{space 2} 396.1117{col 32}{space 2} 16.38208{col 43}{space 1}   24.18{col 52}{space 3}0.000{col 60}{space 4} 363.9817{col 73}{space 3} 428.2417
{txt}{space 8}NPM#Obese  {c |}{col 20}{res}{space 2} 442.7344{col 32}{space 2} 21.85208{col 43}{space 1}   20.26{col 52}{space 3}0.000{col 60}{space 4} 399.8761{col 73}{space 3} 485.5926
{txt}{space 3}PM#Underweight  {c |}{col 20}{res}{space 2} 400.2572{col 32}{space 2} 15.87749{col 43}{space 1}   25.21{col 52}{space 3}0.000{col 60}{space 4} 369.1169{col 73}{space 3} 431.3976
{txt}{space 1}PM#Normal Weight  {c |}{col 20}{res}{space 2} 406.5947{col 32}{space 2} 13.14998{col 43}{space 1}   30.92{col 52}{space 3}0.000{col 60}{space 4} 380.8037{col 73}{space 3} 432.3856
{txt}{space 4}PM#Overweight  {c |}{col 20}{res}{space 2} 375.2808{col 32}{space 2} 31.76502{col 43}{space 1}   11.81{col 52}{space 3}0.000{col 60}{space 4} 312.9804{col 73}{space 3} 437.5812
{txt}{space 9}PM#Obese  {c |}{col 20}{res}{space 2}  380.033{col 32}{space 2} 54.13633{col 43}{space 1}    7.02{col 52}{space 3}0.000{col 60}{space 4}  273.856{col 73}{space 3} 486.2101
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. marginsplot, title("Marginal Effects of Malnutrition by BMI Category") ///
>     ytitle("Marginal Effect on Fecal Elastase") ///
>     xtitle("Previous Malnutrition") ///
>     note("Interaction between Malnutrition and BMI", size(small)) ///
>         graphregion(margin(vsmall)) ///
>         plotregion(margin(vlarge)) ///
>         xlabel(,labsize(medsmall))      
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:ever_mal bmi_cat}{p_end}
{res}{txt}
{com}.         
. gr export ./figures/fe_mal_bmi_interaction.png, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures/fe_mal_bmi_interaction.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. * 5. Predicted Values
. * ------------------
. * Calculate predicted values for each combination
. margins ever_mal#bmi_cat, atmeans
{res}
{txt}{col 1}Adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 14:1.africa} = {res:{ralign 8:.63596}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.africa} = {res:{ralign 8:.36404}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.child} = {res:{ralign 8:.1115427}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.child} = {res:{ralign 8:.8884573}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.exposuretime} = {res:{ralign 8:.27303}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.exposuretime} = {res:{ralign 8:.72697}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:0.hiv2} = {res:{ralign 8:.6104329}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.hiv2} = {res:{ralign 8:.3895671}} {txt:(mean)}

{res}{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32} Delta-method
{col 20}{c |}     Margin{col 32}   std. err.{col 44}      t{col 52}   P>|t|{col 60}     [95% con{col 73}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}ever_mal#bmi_cat {c |}
{space 2}NPM#Underweight  {c |}{col 20}{res}{space 2} 323.2381{col 32}{space 2} 37.90205{col 43}{space 1}    8.53{col 52}{space 3}0.000{col 60}{space 4} 248.9012{col 73}{space 3}  397.575
{txt}NPM#Normal Weight  {c |}{col 20}{res}{space 2} 348.8997{col 32}{space 2}  11.3091{col 43}{space 1}   30.85{col 52}{space 3}0.000{col 60}{space 4} 326.7192{col 73}{space 3} 371.0801
{txt}{space 3}NPM#Overweight  {c |}{col 20}{res}{space 2} 396.1117{col 32}{space 2} 16.38208{col 43}{space 1}   24.18{col 52}{space 3}0.000{col 60}{space 4} 363.9817{col 73}{space 3} 428.2417
{txt}{space 8}NPM#Obese  {c |}{col 20}{res}{space 2} 442.7344{col 32}{space 2} 21.85208{col 43}{space 1}   20.26{col 52}{space 3}0.000{col 60}{space 4} 399.8761{col 73}{space 3} 485.5926
{txt}{space 3}PM#Underweight  {c |}{col 20}{res}{space 2} 400.2572{col 32}{space 2} 15.87749{col 43}{space 1}   25.21{col 52}{space 3}0.000{col 60}{space 4} 369.1169{col 73}{space 3} 431.3976
{txt}{space 1}PM#Normal Weight  {c |}{col 20}{res}{space 2} 406.5947{col 32}{space 2} 13.14998{col 43}{space 1}   30.92{col 52}{space 3}0.000{col 60}{space 4} 380.8037{col 73}{space 3} 432.3856
{txt}{space 4}PM#Overweight  {c |}{col 20}{res}{space 2} 375.2808{col 32}{space 2} 31.76502{col 43}{space 1}   11.81{col 52}{space 3}0.000{col 60}{space 4} 312.9804{col 73}{space 3} 437.5812
{txt}{space 9}PM#Obese  {c |}{col 20}{res}{space 2}  380.033{col 32}{space 2} 54.13633{col 43}{space 1}    7.02{col 52}{space 3}0.000{col 60}{space 4}  273.856{col 73}{space 3} 486.2101
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. * Test contrasts between PM and NPM within each BMI category
. margins r.ever_mal@bmi_cat, atmeans
{res}
{txt}{col 1}Contrasts of adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 14:1.africa} = {res:{ralign 8:.63596}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.africa} = {res:{ralign 8:.36404}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.child} = {res:{ralign 8:.1115427}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.child} = {res:{ralign 8:.8884573}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.exposuretime} = {res:{ralign 8:.27303}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.exposuretime} = {res:{ralign 8:.72697}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:0.hiv2} = {res:{ralign 8:.6104329}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.hiv2} = {res:{ralign 8:.3895671}} {txt:(mean)}

{res}{col 1}{text}{hline 27}{c TT}{hline 11}{hline 12}{hline 11}
{col 28}{text}{c |}         df{col 40}           F{col 52}        P>F
{res}{col 1}{text}{hline 27}{c +}{hline 11}{hline 12}{hline 11}
{space 10}ever_mal@bmi_cat {c |}
{space 2}(PM vs NPM) Underweight  {res}{col 28}{text}{c |}{result}{space 2}        1{col 40}{space 3}     3.61{col 52}{space 2}   0.0577
{txt}(PM vs NPM) Normal Weight  {res}{col 28}{text}{c |}{result}{space 2}        1{col 40}{space 3}    10.88{col 52}{space 2}   0.0010
{txt}{space 3}(PM vs NPM) Overweight  {res}{col 28}{text}{c |}{result}{space 2}        1{col 40}{space 3}     0.34{col 52}{space 2}   0.5577
{txt}{space 8}(PM vs NPM) Obese  {res}{col 28}{text}{c |}{result}{space 2}        1{col 40}{space 3}     1.17{col 52}{space 2}   0.2804
{col 1}{text}                    Joint {col 28}{c |}{result}{space 2}        4{col 40}{space 3}     4.07{col 52}{space 2}   0.0027
{col 28}{text}{c |}
{res}{col 1}{text}               Denominator{col 28}{c |}{result}{space 2}     1791
{col 1}{text}{hline 27}{c BT}{hline 11}{hline 12}{hline 11}
{res}
{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 28}{c |}{col 40} Delta-method
{col 28}{c |}   Contrast{col 40}   std. err.{col 52}     [95% con{col 65}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 10}ever_mal@bmi_cat {c |}
{space 2}(PM vs NPM) Underweight  {c |}{col 28}{res}{space 2} 77.01913{col 40}{space 2} 40.55823{col 51}{space 5}  -2.5273{col 65}{space 3} 156.5656
{txt}(PM vs NPM) Normal Weight  {c |}{col 28}{res}{space 2} 57.69501{col 40}{space 2} 17.49233{col 51}{space 5} 23.38748{col 65}{space 3} 92.00253
{txt}{space 3}(PM vs NPM) Overweight  {c |}{col 28}{res}{space 2}-20.83094{col 40}{space 2}  35.5268{col 51}{space 5}-90.50928{col 65}{space 3} 48.84741
{txt}{space 8}(PM vs NPM) Obese  {c |}{col 28}{res}{space 2}-62.70132{col 40}{space 2} 58.07131{col 51}{space 5} -176.596{col 65}{space 3} 51.19332
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. marginsplot, recast(scatter) ///
>     title("Contrasts of PM vs NPM by BMI - FE-1") ///
>     ytitle("Contrast of Linear Prediction ") ///
>     xtitle("BMI Category") ///
>     xlabel(, labsize(medsmall) angle(forty_five)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     yline(0)
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:bmi_cat}{p_end}
{res}{txt}
{com}. gr export ./figures/fe_contrasts_by_bmi.png, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures/fe_contrasts_by_bmi.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. * Visualize predicted values
. marginsplot, bydimension(bmi_cat) recast(scatter) ///
>     ytitle("Linear Prediction Fecal Elastase") ///
>     xtitle("Current BMI Categories") ///
>     xlabel(, labsize(medsmall) angle(forty_five)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     byopts(yrescale title("Predicted Fecal Elastase by BMI Category and Malnutrition Status") ///
>            note("PM = Previously Malnourished; NPM = Not Previously Malnourished", size(small)) rows(2))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:bmi_cat}{p_end}
{res}{txt}
{com}. gr export ./figures/fe_predicted_by_bmi.png, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures/fe_predicted_by_bmi.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. * 6. Additional Interactions
. * ------------------------
. * Only after confirming BMI-malnutrition interaction, we can explore other interactions
. * Model 3: Adding region-malnutrition interaction
. tobit fecal_elastase i.ever_mal##i.bmi_cat i.ever_mal##i.africa i.child i.exposure i.hiv2, ul(600)
{res}{txt}
Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-9839.0533}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-9839.0533}  
Iteration 1:{space 2}Log likelihood = {res:-9734.7172}  
Iteration 2:{space 2}Log likelihood = {res:-9729.6491}  
Iteration 3:{space 2}Log likelihood = {res:-9729.6216}  
Iteration 4:{space 2}Log likelihood = {res:-9729.6216}  
{res}
{txt}{col 1}Tobit regression{col 53}{lalign 17:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 53}{ralign 17:Uncensored}{col 70} = {res}{ralign 6:1,342}
{txt}{col 1}Limits: Lower = {ralign 4:{txt:-inf}}{col 53}{ralign 17:Left-censored}{col 70} = {res}{ralign 6:0}
{txt}{col 1}        Upper = {ralign 4:{res:600}}{col 53}{ralign 17:   Right-censored}{col 70} = {res}{ralign 6:460}

{txt}{col 53}{lalign 17:LR chi2({res:12})}{col 70} = {res}{ralign 6:332.43}
{txt}{col 53}{lalign 17:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-9729.6216}{txt}{col 53}{lalign 17:Pseudo R2}{col 70} = {res}{ralign 6:0.0168}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       fecal_elastase{col 23}{c |} Coefficient{col 35}  Std. err.{col 47}      t{col 55}   P>|t|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}ever_mal {c |}
{space 18}PM  {c |}{col 23}{res}{space 2} 57.58236{col 35}{space 2} 42.39227{col 46}{space 1}    1.36{col 55}{space 3}0.175{col 63}{space 4}-25.56118{col 76}{space 3} 140.7259
{txt}{space 21} {c |}
{space 14}bmi_cat {c |}
{space 7}Normal Weight  {c |}{col 23}{res}{space 2} 19.91437{col 35}{space 2}  39.7515{col 46}{space 1}    0.50{col 55}{space 3}0.616{col 63}{space 4}-58.04985{col 76}{space 3} 97.87858
{txt}{space 10}Overweight  {c |}{col 23}{res}{space 2} 68.25444{col 35}{space 2} 41.79875{col 46}{space 1}    1.63{col 55}{space 3}0.103{col 63}{space 4}-13.72503{col 76}{space 3} 150.2339
{txt}{space 15}Obese  {c |}{col 23}{res}{space 2} 112.8982{col 35}{space 2}  44.4628{col 46}{space 1}    2.54{col 55}{space 3}0.011{col 63}{space 4} 25.69374{col 76}{space 3} 200.1027
{txt}{space 21} {c |}
{space 5}ever_mal#bmi_cat {c |}
{space 4}PM#Normal Weight  {c |}{col 23}{res}{space 2}-12.86491{col 35}{space 2} 44.34245{col 46}{space 1}   -0.29{col 55}{space 3}0.772{col 63}{space 4}-99.83331{col 76}{space 3}  74.1035
{txt}{space 7}PM#Overweight  {c |}{col 23}{res}{space 2}-98.09727{col 35}{space 2} 53.92573{col 46}{space 1}   -1.82{col 55}{space 3}0.069{col 63}{space 4}-203.8613{col 76}{space 3} 7.666733
{txt}{space 12}PM#Obese  {c |}{col 23}{res}{space 2}-141.2762{col 35}{space 2} 70.81482{col 46}{space 1}   -2.00{col 55}{space 3}0.046{col 63}{space 4}-280.1646{col 76}{space 3}-2.387751
{txt}{space 21} {c |}
{space 15}africa {c |}
{space 16}Asia  {c |}{col 23}{res}{space 2} 218.2958{col 35}{space 2} 22.49158{col 46}{space 1}    9.71{col 55}{space 3}0.000{col 63}{space 4} 174.1833{col 76}{space 3} 262.4083
{txt}{space 21} {c |}
{space 6}ever_mal#africa {c |}
{space 13}PM#Asia  {c |}{col 23}{res}{space 2} 42.50221{col 35}{space 2} 27.25828{col 46}{space 1}    1.56{col 55}{space 3}0.119{col 63}{space 4}-10.95919{col 76}{space 3}  95.9636
{txt}{space 21} {c |}
{space 16}child {c |}
{space 15}Adult  {c |}{col 23}{res}{space 2} 25.20912{col 35}{space 2}  29.2665{col 46}{space 1}    0.86{col 55}{space 3}0.389{col 63}{space 4}-32.19098{col 76}{space 3} 82.60922
{txt}{space 21} {c |}
{space 9}exposuretime {c |}
{space 2}Exposure as Adults  {c |}{col 23}{res}{space 2}-32.34272{col 35}{space 2} 23.81345{col 46}{space 1}   -1.36{col 55}{space 3}0.175{col 63}{space 4} -79.0478{col 76}{space 3} 14.36236
{txt}{space 15}1.hiv2 {c |}{col 23}{res}{space 2} 40.20243{col 35}{space 2} 16.81175{col 46}{space 1}    2.39{col 55}{space 3}0.017{col 63}{space 4}  7.22971{col 76}{space 3} 73.17515
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 233.8115{col 35}{space 2} 40.51711{col 46}{space 1}    5.77{col 55}{space 3}0.000{col 63}{space 4} 154.3457{col 76}{space 3} 313.2774
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.fecal_elastase){c |}{col 23}{res}{space 2}  62333.6{col 35}{space 2} 2556.839{col 63}{space 4} 57515.31{col 76}{space 3} 67555.54
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store m3
{txt}
{com}. estimates title: "Model with BMI and Region Interactions"
{txt}
{com}. 
. * Compare with previous model
. lrtest m2 m3

{txt}Likelihood-ratio test
Assumption: {res}{stata est replay m2:m2}{txt} nested within {res}{stata est replay m3:m3}

{txt}{ralign 11:LR chi2({res:1})} = {res}{ralign 6:2.43}
{txt}{ralign 11:Prob > chi2} = {res}{ralign 6:0.1189}
{txt}
{com}. 
. * Calculate and plot region-malnutrition interaction
. margins ever_mal#africa, atmeans
{res}
{txt}{col 1}Adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 14:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.child} = {res:{ralign 8:.1115427}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.child} = {res:{ralign 8:.8884573}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.exposuretime} = {res:{ralign 8:.27303}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.exposuretime} = {res:{ralign 8:.72697}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:0.hiv2} = {res:{ralign 8:.6104329}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.hiv2} = {res:{ralign 8:.3895671}} {txt:(mean)}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   std. err.{col 41}      t{col 49}   P>|t|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
ever_mal#africa {c |}
{space 4}NPM#Africa  {c |}{col 17}{res}{space 2} 282.5938{col 29}{space 2} 12.45228{col 40}{space 1}   22.69{col 49}{space 3}0.000{col 57}{space 4} 258.1713{col 70}{space 3} 307.0163
{txt}{space 6}NPM#Asia  {c |}{col 17}{res}{space 2} 500.8896{col 29}{space 2} 17.95552{col 40}{space 1}   27.90{col 49}{space 3}0.000{col 57}{space 4} 465.6736{col 70}{space 3} 536.1056
{txt}{space 5}PM#Africa  {c |}{col 17}{res}{space 2} 301.3309{col 29}{space 2} 14.64865{col 40}{space 1}   20.57{col 49}{space 3}0.000{col 57}{space 4} 272.6006{col 70}{space 3} 330.0611
{txt}{space 7}PM#Asia  {c |}{col 17}{res}{space 2} 562.1289{col 29}{space 2} 18.70624{col 40}{space 1}   30.05{col 49}{space 3}0.000{col 57}{space 4} 525.4405{col 70}{space 3} 598.8172
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. * Test for significant interaction between region and malnutrition
. test 1.ever_mal#1.africa 1.ever_mal#0.africa
{bf}{err}1.ever_mal#0.africa{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. * Alternative way to test the interaction using margins
. margins r.ever_mal@africa, atmeans
{res}
{txt}{col 1}Contrasts of adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 14:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.child} = {res:{ralign 8:.1115427}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.child} = {res:{ralign 8:.8884573}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.exposuretime} = {res:{ralign 8:.27303}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.exposuretime} = {res:{ralign 8:.72697}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:0.hiv2} = {res:{ralign 8:.6104329}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.hiv2} = {res:{ralign 8:.3895671}} {txt:(mean)}

{res}{col 1}{text}{hline 20}{c TT}{hline 11}{hline 12}{hline 11}
{col 21}{text}{c |}         df{col 33}           F{col 45}        P>F
{res}{col 1}{text}{hline 20}{c +}{hline 11}{hline 12}{hline 11}
{space 4}ever_mal@africa {c |}
(PM vs NPM) Africa  {res}{col 21}{text}{c |}{result}{space 2}        1{col 33}{space 3}     1.05{col 45}{space 2}   0.3057
{txt}{space 2}(PM vs NPM) Asia  {res}{col 21}{text}{c |}{result}{space 2}        1{col 33}{space 3}     7.34{col 45}{space 2}   0.0068
{col 1}{text}             Joint {col 21}{c |}{result}{space 2}        2{col 33}{space 3}     3.91{col 45}{space 2}   0.0202
{col 21}{text}{c |}
{res}{col 1}{text}        Denominator{col 21}{c |}{result}{space 2}     1790
{col 1}{text}{hline 20}{c BT}{hline 11}{hline 12}{hline 11}
{res}
{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 21}{c |}{col 33} Delta-method
{col 21}{c |}   Contrast{col 33}   std. err.{col 45}     [95% con{col 58}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}ever_mal@africa {c |}
(PM vs NPM) Africa  {c |}{col 21}{res}{space 2} 18.73709{col 33}{space 2} 18.28928{col 44}{space 5} -17.1335{col 58}{space 3} 54.60768
{txt}{space 2}(PM vs NPM) Asia  {c |}{col 21}{res}{space 2}  61.2393{col 33}{space 2} 22.60836{col 44}{space 5} 16.89775{col 58}{space 3} 105.5808
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. marginsplot, recast(scatter) ///
>     title("Contrasts of PM vs NPM by Region") ///
>     ytitle("Contrast of Linear Prediction") ///
>     xtitle("Region") ///
>     xlabel(, labsize(medsmall) angle(forty_five)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     yline(0)
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:africa}{p_end}
{res}{txt}
{com}. gr export ./figures/fe_contrasts_by_region.png, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures/fe_contrasts_by_region.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. * Calculate and display the difference in malnutrition effect between regions
. margins r.ever_mal@africa, atmeans
{res}
{txt}{col 1}Contrasts of adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 14:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.child} = {res:{ralign 8:.1115427}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.child} = {res:{ralign 8:.8884573}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.exposuretime} = {res:{ralign 8:.27303}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:2.exposuretime} = {res:{ralign 8:.72697}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:0.hiv2} = {res:{ralign 8:.6104329}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 14:1.hiv2} = {res:{ralign 8:.3895671}} {txt:(mean)}

{res}{col 1}{text}{hline 20}{c TT}{hline 11}{hline 12}{hline 11}
{col 21}{text}{c |}         df{col 33}           F{col 45}        P>F
{res}{col 1}{text}{hline 20}{c +}{hline 11}{hline 12}{hline 11}
{space 4}ever_mal@africa {c |}
(PM vs NPM) Africa  {res}{col 21}{text}{c |}{result}{space 2}        1{col 33}{space 3}     1.05{col 45}{space 2}   0.3057
{txt}{space 2}(PM vs NPM) Asia  {res}{col 21}{text}{c |}{result}{space 2}        1{col 33}{space 3}     7.34{col 45}{space 2}   0.0068
{col 1}{text}             Joint {col 21}{c |}{result}{space 2}        2{col 33}{space 3}     3.91{col 45}{space 2}   0.0202
{col 21}{text}{c |}
{res}{col 1}{text}        Denominator{col 21}{c |}{result}{space 2}     1790
{col 1}{text}{hline 20}{c BT}{hline 11}{hline 12}{hline 11}
{res}
{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 21}{c |}{col 33} Delta-method
{col 21}{c |}   Contrast{col 33}   std. err.{col 45}     [95% con{col 58}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}ever_mal@africa {c |}
(PM vs NPM) Africa  {c |}{col 21}{res}{space 2} 18.73709{col 33}{space 2} 18.28928{col 44}{space 5} -17.1335{col 58}{space 3} 54.60768
{txt}{space 2}(PM vs NPM) Asia  {c |}{col 21}{res}{space 2}  61.2393{col 33}{space 2} 22.60836{col 44}{space 5} 16.89775{col 58}{space 3} 105.5808
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. * Create table of results from final model
. esttab m3 using ./tables/final_model.tex, replace ///
>     title("Final Tobit Model Results") ///
>     mtitles("Model 3") ///
>     b(3) se(3) p(3) ///
>     star(* 0.05 ** 0.01 *** 0.001) ///
>     label ///
>     addnotes("Note: Coefficients are from Tobit model with upper limit of 600" ///
>              "PM = Previously Malnourished; NPM = Not Previously Malnourished" ///
>              "Reference categories: NPM, Normal BMI, Africa, Child, Early exposure, HIV negative")
{err}only one allowed of z, se, p, ci, and aux()
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. esttab m3 using ./tables/final_model.tex, replace ///
>     title("Final Tobit Model Results") ///
>     mtitles("Model 3") ///
>     b(3) se(3) ///
>     star(* 0.05 ** 0.01 *** 0.001) ///
>     label ///
>     addnotes("Note: Coefficients are from Tobit model with upper limit of 600" ///
>              "PM = Previously Malnourished; NPM = Not Previously Malnourished" ///
>              "Reference categories: NPM, Normal BMI, Africa, Child, Early exposure, HIV negative" ///
>              "Standard errors in parentheses" ///
>              "* p<0.05, ** p<0.01, *** p<0.001")
{res}{txt}{p 0 4 2}
(file {bf}
./tables/final_model.tex{rm}
not found)
{p_end}
(output written to {browse  `"./tables/final_model.tex"'})

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. * Create table of results from final model
. esttab m3 using ./tables/final_model.docx, replace ///
>     title("Final Tobit Model Results") ///
>     mtitles("Model 3") ///
>     b(3) se(3) ///
>     star(* 0.05 ** 0.01 *** 0.001) ///
>     label ///
>     addnotes("Note: Coefficients are from Tobit model with upper limit of 600" ///
>              "PM = Previously Malnourished; NPM = Not Previously Malnourished" ///
>              "Reference categories: NPM, Normal BMI, Africa, Child, Early exposure, HIV negative" ///
>              "Standard errors in parentheses" ///
>              "* p<0.05, ** p<0.01, *** p<0.001") ///
>     cells(b(star fmt(3)) se(par fmt(3))) ///
>     style(docx) ///
>     title("Table 1: Final Tobit Model Results") ///
>     note("Standard errors in parentheses" ///
>          "* p<0.05, ** p<0.01, *** p<0.001")
{err}option {bf:title()} not allowed
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. help esttab

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. esttab m3 using ./tables/final_model.rtf, replace ///
>     title("Table 1: Final Tobit Model Results") ///
>     mtitles("Model 3") ///
>     b(3) se(3) ///
>     star(* 0.05 ** 0.01 *** 0.001) ///
>     label ///
>     addnotes("Note: Coefficients are from Tobit model with upper limit of 600" ///
>              "PM = Previously Malnourished; NPM = Not Previously Malnourished" ///
>              "Reference categories: NPM, Normal BMI, Africa, Child, Early exposure, HIV negative" ///
>              "Standard errors in parentheses" ///
>              "* p<0.05, ** p<0.01, *** p<0.001") ///
>     cells(b(star fmt(3)) se(par fmt(3))) ///
>     style(rtf) ///
>     note("Standard errors in parentheses" ///
>          "* p<0.05, ** p<0.01, *** p<0.001")
{err}rtf style not available (file estout_rtf.def not found)
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. esttab m3 using ./tables/final_model.rtf, replace ///
>     title("Table 1: Final Tobit Model Results") ///
>     mtitles("Model 3") ///
>     b(3) se(3) ///
>     star(* 0.05 ** 0.01 *** 0.001) ///
>     label ///
>     addnotes("Note: Coefficients are from Tobit model with upper limit of 600" ///
>              "PM = Previously Malnourished; NPM = Not Previously Malnourished" ///
>              "Reference categories: NPM, Normal BMI, Africa, Child, Early exposure, HIV negative" ///
>              "Standard errors in parentheses" ///
>              "* p<0.05, ** p<0.01, *** p<0.001") ///
>     cells(b(star fmt(3)) se(par fmt(3))) ///
>     style(rtf) ///
>     note("Standard errors in parentheses" ///
>          "* p<0.05, ** p<0.01, *** p<0.001")
{err}rtf style not available (file estout_rtf.def not found)
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. esttab m3 using ./tables/final_model.rtf, replace ///
>     title("Table 1: Final Tobit Model Results") ///
>     mtitles("Model 3") ///
>     b(3) se(3) ///
>     star(* 0.05 ** 0.01 *** 0.001) ///
>     label ///
>     addnotes("Note: Coefficients are from Tobit model with upper limit of 600" ///
>              "PM = Previously Malnourished; NPM = Not Previously Malnourished" ///
>              "Reference categories: NPM, Normal BMI, Africa, Child, Early exposure, HIV negative" ///
>              "Standard errors in parentheses" ///
>              "* p<0.05, ** p<0.01, *** p<0.001") ///
>     cells(b(star fmt(3)) se(par fmt(3))) ///
>     style(md) ///
>     note("Standard errors in parentheses" ///
>          "* p<0.05, ** p<0.01, *** p<0.001")
{err}md style not available (file estout_md.def not found)
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. esttab m3
{res}
{txt}{hline 28}
{txt}                      (1)   
{txt}             fecal_elas~e   
{txt}{hline 28}
{res}fecal_elas~e                {txt}
{txt}0.ever_mal  {res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.ever_mal  {res}        57.58   {txt}
            {res} {ralign 12:{txt:(}1.36{txt:)}}   {txt}

{txt}1.bmi_cat   {res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}2.bmi_cat   {res}        19.91   {txt}
            {res} {ralign 12:{txt:(}0.50{txt:)}}   {txt}

{txt}3.bmi_cat   {res}        68.25   {txt}
            {res} {ralign 12:{txt:(}1.63{txt:)}}   {txt}

{txt}4.bmi_cat   {res}        112.9*  {txt}
            {res} {ralign 12:{txt:(}2.54{txt:)}}   {txt}

{txt}0.ever_mal~t{res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}0.ever_mal~t{res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}0.ever_mal~t{res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}0.ever_mal~t{res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.ever_mal~t{res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.ever_mal~t{res}       -12.86   {txt}
            {res} {ralign 12:{txt:(}-0.29{txt:)}}   {txt}

{txt}1.ever_mal~t{res}       -98.10   {txt}
            {res} {ralign 12:{txt:(}-1.82{txt:)}}   {txt}

{txt}1.ever_mal~t{res}       -141.3*  {txt}
            {res} {ralign 12:{txt:(}-2.00{txt:)}}   {txt}

{txt}1.africa    {res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}2.africa    {res}        218.3***{txt}
            {res} {ralign 12:{txt:(}9.71{txt:)}}   {txt}

{txt}0.ever_mal~a{res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}0.ever_mal~a{res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.ever_mal~a{res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.ever_mal~a{res}        42.50   {txt}
            {res} {ralign 12:{txt:(}1.56{txt:)}}   {txt}

{txt}1.child     {res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}2.child     {res}        25.21   {txt}
            {res} {ralign 12:{txt:(}0.86{txt:)}}   {txt}

{txt}1.exposure~e{res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}2.exposure~e{res}       -32.34   {txt}
            {res} {ralign 12:{txt:(}-1.36{txt:)}}   {txt}

{txt}0.hiv2      {res}            0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.hiv2      {res}        40.20*  {txt}
            {res} {ralign 12:{txt:(}2.39{txt:)}}   {txt}

{txt}_cons       {res}        233.8***{txt}
            {res} {ralign 12:{txt:(}5.77{txt:)}}   {txt}
{hline 28}
{res}/                           {txt}
{txt}var(e.feca~){res}      62333.6***{txt}
            {res} {ralign 12:{txt:(}24.38{txt:)}}   {txt}
{txt}{hline 28}
{txt}N           {res}         1802   {txt}
{txt}{hline 28}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. * 7. Final Model Diagnostics
. * -------------------------
. * Create table of results from final model
. estout m3 using ./tables/final_model.rtf, replace ///
>     cells(b(star fmt(3)) se(par fmt(3))) ///
>     starlevels(* 0.05 ** 0.01 *** 0.001) ///
>     style(rtf) ///
>     title("Table 1: Final Tobit Model Results") ///
>     label ///
>     varlabels(_cons Constant) ///
>     stats(N r2_p chi2 p chi2_ll, fmt(%9.0fc %9.3f %9.2f %9.3f %9.2f) ///
>     labels("N" "Pseudo R-squared" "Chi-squared" "p-value" "Log likelihood")) ///
>     note("Note: Coefficients are from Tobit model with upper limit of 600" ///
>          "PM = Previously Malnourished; NPM = Not Previously Malnourished" ///
>          "Reference categories: NPM, Normal BMI, Africa, Child, Early exposure, HIV negative" ///
>          "Standard errors in parentheses" ///
>          "* p<0.05, ** p<0.01, *** p<0.001")
{err}rtf style not available (file estout_rtf.def not found)
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. help estout

. help gr combine

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. * Clear any existing estimates
. eststo clear
{txt}
{com}. 
. * Model 1: Unadjusted (ever_mal only)
. logistic epi_binary ever_mal
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:1})}{col 70} = {res}{ralign 6:1.47}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.2254}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1145.8011}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0006}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  epi_binary{col 14}{c |} Odds ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} .8849659{col 26}{space 2} .0893075{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}   .72615{col 67}{space 3} 1.078516
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5266362{col 26}{space 2} .0349817{col 37}{space 1}   -9.65{col 46}{space 3}0.000{col 54}{space 4}  .462349{col 67}{space 3} .5998623
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model1
{txt}
{com}. estadd local controls "No"

{txt}added macro:
           e(controls) : "{res:No}"

{com}. 
. * Model 2: Adjusted for age
. logistic epi_binary ever_mal age
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:2})}{col 70} = {res}{ralign 6:2.85}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.2411}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1145.1133}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0012}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  epi_binary{col 14}{c |} Odds ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} .8953438{col 26}{space 2} .0908059{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4} .7339406{col 67}{space 3} 1.092242
{txt}{space 9}age {c |}{col 14}{res}{space 2} 1.004027{col 26}{space 2} .0034457{col 37}{space 1}    1.17{col 46}{space 3}0.242{col 54}{space 4} .9972966{col 67}{space 3} 1.010804
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4415057{col 26}{space 2} .0728116{col 37}{space 1}   -4.96{col 46}{space 3}0.000{col 54}{space 4} .3195648{col 67}{space 3} .6099772
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model2
{txt}
{com}. estadd local controls "Age"

{txt}added macro:
           e(controls) : "{res:Age}"

{com}. 
. * Model 3: Adjusted for cohort
. logistic epi_binary ever_mal cohort
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:2})}{col 70} = {res}{ralign 6:75.04}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1109.0138}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0327}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  epi_binary{col 14}{c |} Odds ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} .7993336{col 26}{space 2} .0830243{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4} .6521033{col 67}{space 3} .9798052
{txt}{space 6}cohort {c |}{col 14}{res}{space 2} .7244147{col 26}{space 2} .0281306{col 37}{space 1}   -8.30{col 46}{space 3}0.000{col 54}{space 4} .6713256{col 67}{space 3} .7817022
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.764456{col 26}{space 2} .2774359{col 37}{space 1}    3.61{col 46}{space 3}0.000{col 54}{space 4} 1.296497{col 67}{space 3} 2.401322
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model3
{txt}
{com}. estadd local controls "Cohort"

{txt}added macro:
           e(controls) : "{res:Cohort}"

{com}. 
. * Model 4: Fully adjusted
. logistic epi_binary ever_mal age cohort
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:3})}{col 70} = {res}{ralign 6:91.37}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1100.8514}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0398}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  epi_binary{col 14}{c |} Odds ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} .8269994{col 26}{space 2} .0863373{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4} .6739709{col 67}{space 3} 1.014774
{txt}{space 9}age {c |}{col 14}{res}{space 2} 1.014531{col 26}{space 2} .0036319{col 37}{space 1}    4.03{col 46}{space 3}0.000{col 54}{space 4} 1.007437{col 67}{space 3} 1.021674
{txt}{space 6}cohort {c |}{col 14}{res}{space 2} .6833401{col 26}{space 2} .0291544{col 37}{space 1}   -8.92{col 46}{space 3}0.000{col 54}{space 4} .6285224{col 67}{space 3} .7429389
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.155271{col 26}{space 2} .2200157{col 37}{space 1}    0.76{col 46}{space 3}0.449{col 54}{space 4}  .795384{col 67}{space 3} 1.677997
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model4
{txt}
{com}. estadd local controls "Age + Cohort"

{txt}added macro:
           e(controls) : "{res:Age + Cohort}"

{com}. 
. * Export results to HTML
. esttab model1 model2 model3 model4 using "03-tables/logistic_models.html", ///
>     eform cells(b(fmt(3)) ci(fmt(3) par)) ///
>     star(* 0.05 ** 0.01 *** 0.001) ///
>     stats(N controls, fmt(%9.0fc) labels("Observations" "Controls")) ///
>     mtitles("Model 1" "Model 2" "Model 3" "Model 4") ///
>     title("Logistic Regression Models for EPI Binary Outcome") ///
>     replace html
{res}{txt}{p 0 4 2}
(file {bf}
03-tables/logistic_models.html{rm}
not found)
{p_end}
{err}{p 0 4 2}
file {bf:{err}03-tables/logistic_models.html}
could not be opened
{p_end}
{txt}{search r(603), local:r(603);}

end of do-file

{search r(603), local:r(603);}

{com}. help esttab

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. logistic epi_binary ever_mal i.africa i.bmi_cat i.hiv2 age
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:7})}{col 70} = {res}{ralign 6:172.20}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1060.4378}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0751}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    epi_binary{col 16}{c |} Odds ratio{col 28}   Std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ever_mal {c |}{col 16}{res}{space 2} .8961017{col 28}{space 2} .1107288{col 39}{space 1}   -0.89{col 48}{space 3}0.375{col 56}{space 4} .7033584{col 69}{space 3} 1.141663
{txt}{space 14} {c |}
{space 8}africa {c |}
{space 9}Asia  {c |}{col 16}{res}{space 2} .1928755{col 28}{space 2} .0280229{col 39}{space 1}  -11.33{col 48}{space 3}0.000{col 56}{space 4} .1450795{col 69}{space 3} .2564178
{txt}{space 14} {c |}
{space 7}bmi_cat {c |}
Normal Weight  {c |}{col 16}{res}{space 2} .9896693{col 28}{space 2} .1485803{col 39}{space 1}   -0.07{col 48}{space 3}0.945{col 56}{space 4} .7373915{col 69}{space 3} 1.328257
{txt}{space 3}Overweight  {c |}{col 16}{res}{space 2} .7832399{col 28}{space 2} .1504542{col 39}{space 1}   -1.27{col 48}{space 3}0.203{col 56}{space 4}  .537509{col 69}{space 3} 1.141311
{txt}{space 8}Obese  {c |}{col 16}{res}{space 2} .5420908{col 28}{space 2} .1286947{col 39}{space 1}   -2.58{col 48}{space 3}0.010{col 56}{space 4} .3404028{col 69}{space 3} .8632785
{txt}{space 14} {c |}
{space 8}1.hiv2 {c |}{col 16}{res}{space 2} .6433607{col 28}{space 2} .0840062{col 39}{space 1}   -3.38{col 48}{space 3}0.001{col 56}{space 4} .4980922{col 69}{space 3} .8309968
{txt}{space 11}age {c |}{col 16}{res}{space 2} .9987102{col 28}{space 2} .0037305{col 39}{space 1}   -0.35{col 48}{space 3}0.730{col 56}{space 4} .9914252{col 69}{space 3} 1.006049
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1.221053{col 28}{space 2} .2808916{col 39}{space 1}    0.87{col 48}{space 3}0.385{col 56}{space 4} .7778996{col 69}{space 3} 1.916661
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model5
{txt}
{com}. estadd local controls "Region + BMI + HIV + Age"

{txt}added macro:
           e(controls) : "{res:Region + BMI + HIV + Age}"

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. * Check for prioritized interactions
. * 1. Region-malnutrition interaction (highest priority)
. logistic epi_binary i.ever_mal##i.africa i.bmi_cat i.hiv2 age
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:8})}{col 70} = {res}{ralign 6:172.67}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1060.1997}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0753}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     epi_binary{col 17}{c |} Odds ratio{col 29}   Std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}ever_mal {c |}
{space 12}PM  {c |}{col 17}{res}{space 2} .9374159{col 29}{space 2} .1310963{col 40}{space 1}   -0.46{col 49}{space 3}0.644{col 57}{space 4} .7126775{col 70}{space 3} 1.233024
{txt}{space 15} {c |}
{space 9}africa {c |}
{space 10}Asia  {c |}{col 17}{res}{space 2} .2065853{col 29}{space 2} .0361109{col 40}{space 1}   -9.02{col 49}{space 3}0.000{col 57}{space 4} .1466595{col 70}{space 3}  .290997
{txt}{space 15} {c |}
ever_mal#africa {c |}
{space 7}PM#Asia  {c |}{col 17}{res}{space 2} .8406316{col 29}{space 2} .2117128{col 40}{space 1}   -0.69{col 49}{space 3}0.491{col 57}{space 4} .5131341{col 70}{space 3} 1.377148
{txt}{space 15} {c |}
{space 8}bmi_cat {c |}
{space 1}Normal Weight  {c |}{col 17}{res}{space 2} .9898428{col 29}{space 2}  .149023{col 40}{space 1}   -0.07{col 49}{space 3}0.946{col 57}{space 4} .7369126{col 70}{space 3} 1.329586
{txt}{space 4}Overweight  {c |}{col 17}{res}{space 2}  .782412{col 29}{space 2} .1504467{col 40}{space 1}   -1.28{col 49}{space 3}0.202{col 57}{space 4} .5367371{col 70}{space 3} 1.140537
{txt}{space 9}Obese  {c |}{col 17}{res}{space 2}  .544884{col 29}{space 2} .1294219{col 40}{space 1}   -2.56{col 49}{space 3}0.011{col 57}{space 4} .3420779{col 70}{space 3} .8679269
{txt}{space 15} {c |}
{space 9}1.hiv2 {c |}{col 17}{res}{space 2}  .635282{col 29}{space 2} .0838289{col 40}{space 1}   -3.44{col 49}{space 3}0.001{col 57}{space 4} .4905078{col 70}{space 3} .8227865
{txt}{space 12}age {c |}{col 17}{res}{space 2} .9984242{col 29}{space 2} .0037599{col 40}{space 1}   -0.42{col 49}{space 3}0.675{col 57}{space 4} .9910821{col 70}{space 3} 1.005821
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 1.221723{col 29}{space 2}  .281431{col 40}{space 1}    0.87{col 49}{space 3}0.385{col 57}{space 4} .7778462{col 70}{space 3} 1.918899
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model5b
{txt}
{com}. lrtest model5 model5b

{txt}Likelihood-ratio test
Assumption: {res}{stata est replay model5:model5}{txt} nested within {res}{stata est replay model5b:model5b}

{txt}{ralign 11:LR chi2({res:1})} = {res}{ralign 6:0.48}
{txt}{ralign 11:Prob > chi2} = {res}{ralign 6:0.4901}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. * 2. BMI-malnutrition interaction (second priority)
. logistic epi_binary i.ever_mal i.africa i.ever_mal##i.bmi_cat i.hiv2 age
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:10})}{col 70} = {res}{ralign 6:174.77}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1059.1526}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0762}

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       epi_binary{col 19}{c |} Odds ratio{col 31}   Std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}ever_mal {c |}
{space 14}PM  {c |}{col 19}{res}{space 2} .9923521{col 31}{space 2} .3516906{col 42}{space 1}   -0.02{col 51}{space 3}0.983{col 59}{space 4} .4954491{col 72}{space 3} 1.987616
{txt}{space 17} {c |}
{space 11}africa {c |}
{space 12}Asia  {c |}{col 19}{res}{space 2} .1907743{col 31}{space 2} .0278218{col 42}{space 1}  -11.36{col 51}{space 3}0.000{col 59}{space 4} .1433454{col 72}{space 3} .2538961
{txt}{space 17} {c |}
{space 10}bmi_cat {c |}
{space 3}Normal Weight  {c |}{col 19}{res}{space 2} 1.132644{col 31}{space 2} .3868401{col 42}{space 1}    0.36{col 51}{space 3}0.715{col 59}{space 4} .5799312{col 72}{space 3} 2.212129
{txt}{space 6}Overweight  {c |}{col 19}{res}{space 2} .7922234{col 31}{space 2} .2835851{col 42}{space 1}   -0.65{col 51}{space 3}0.515{col 59}{space 4} .3927812{col 72}{space 3} 1.597882
{txt}{space 11}Obese  {c |}{col 19}{res}{space 2} .5675503{col 31}{space 2} .2170982{col 42}{space 1}   -1.48{col 51}{space 3}0.139{col 59}{space 4} .2681664{col 72}{space 3}  1.20117
{txt}{space 17} {c |}
{space 1}ever_mal#bmi_cat {c |}
PM#Normal Weight  {c |}{col 19}{res}{space 2} .8058795{col 31}{space 2} .3074444{col 42}{space 1}   -0.57{col 51}{space 3}0.572{col 59}{space 4} .3815358{col 72}{space 3} 1.702178
{txt}{space 3}PM#Overweight  {c |}{col 19}{res}{space 2} 1.318946{col 31}{space 2} .6211951{col 42}{space 1}    0.59{col 51}{space 3}0.557{col 59}{space 4} .5239976{col 72}{space 3} 3.319897
{txt}{space 8}PM#Obese  {c |}{col 19}{res}{space 2} 1.280645{col 31}{space 2} .8456867{col 42}{space 1}    0.37{col 51}{space 3}0.708{col 59}{space 4}  .351018{col 72}{space 3} 4.672273
{txt}{space 17} {c |}
{space 11}1.hiv2 {c |}{col 19}{res}{space 2} .6394846{col 31}{space 2} .0836671{col 42}{space 1}   -3.42{col 51}{space 3}0.001{col 59}{space 4}  .494838{col 72}{space 3} .8264132
{txt}{space 14}age {c |}{col 19}{res}{space 2} .9988731{col 31}{space 2} .0037667{col 42}{space 1}   -0.30{col 51}{space 3}0.765{col 59}{space 4} .9915177{col 72}{space 3} 1.006283
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}  1.11788{col 31}{space 2} .3958012{col 42}{space 1}    0.31{col 51}{space 3}0.753{col 59}{space 4} .5584897{col 72}{space 3} 2.237562
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model5a
{txt}
{com}. lrtest model5 model5a

{txt}Likelihood-ratio test
Assumption: {res}{stata est replay model5:model5}{txt} nested within {res}{stata est replay model5a:model5a}

{txt}{ralign 11:LR chi2({res:3})} = {res}{ralign 6:2.57}
{txt}{ralign 11:Prob > chi2} = {res}{ralign 6:0.4627}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. * 3. HIV-malnutrition interaction (third priority)
. logistic epi_binary i.ever_mal i.africa i.bmi_cat i.ever_mal##i.hiv2 age
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:8})}{col 70} = {res}{ralign 6:175.21}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1058.9318}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0764}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    epi_binary{col 16}{c |} Odds ratio{col 28}   Std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ever_mal {c |}
{space 11}PM  {c |}{col 16}{res}{space 2} 1.093338{col 28}{space 2} .1842368{col 39}{space 1}    0.53{col 48}{space 3}0.596{col 56}{space 4} .7858139{col 69}{space 3}  1.52121
{txt}{space 14} {c |}
{space 8}africa {c |}
{space 9}Asia  {c |}{col 16}{res}{space 2}  .184506{col 28}{space 2}  .027407{col 39}{space 1}  -11.38{col 48}{space 3}0.000{col 56}{space 4} .1379021{col 69}{space 3} .2468597
{txt}{space 14} {c |}
{space 7}bmi_cat {c |}
Normal Weight  {c |}{col 16}{res}{space 2} .9956567{col 28}{space 2} .1494901{col 39}{space 1}   -0.03{col 48}{space 3}0.977{col 56}{space 4} .7418367{col 69}{space 3} 1.336321
{txt}{space 3}Overweight  {c |}{col 16}{res}{space 2} .7939268{col 28}{space 2} .1526684{col 39}{space 1}   -1.20{col 48}{space 3}0.230{col 56}{space 4} .5446261{col 69}{space 3} 1.157344
{txt}{space 8}Obese  {c |}{col 16}{res}{space 2} .5441282{col 28}{space 2}  .129238{col 39}{space 1}   -2.56{col 48}{space 3}0.010{col 56}{space 4} .3416088{col 69}{space 3} .8667092
{txt}{space 14} {c |}
{space 8}1.hiv2 {c |}{col 16}{res}{space 2} .7445554{col 28}{space 2} .1152914{col 39}{space 1}   -1.90{col 48}{space 3}0.057{col 56}{space 4} .5496571{col 69}{space 3} 1.008561
{txt}{space 14} {c |}
{space 1}ever_mal#hiv2 {c |}
{space 9}PM#1  {c |}{col 16}{res}{space 2} .6783558{col 28}{space 2} .1517001{col 39}{space 1}   -1.74{col 48}{space 3}0.083{col 56}{space 4} .4376269{col 69}{space 3} 1.051504
{txt}{space 14} {c |}
{space 11}age {c |}{col 16}{res}{space 2} .9999165{col 28}{space 2} .0037902{col 39}{space 1}   -0.02{col 48}{space 3}0.982{col 56}{space 4} .9925154{col 69}{space 3} 1.007373
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1.100575{col 28}{space 2} .2614816{col 39}{space 1}    0.40{col 48}{space 3}0.687{col 56}{space 4} .6908535{col 69}{space 3} 1.753289
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model5c
{txt}
{com}. lrtest model5 model5c

{txt}Likelihood-ratio test
Assumption: {res}{stata est replay model5:model5}{txt} nested within {res}{stata est replay model5c:model5c}

{txt}{ralign 11:LR chi2({res:1})} = {res}{ralign 6:3.01}
{txt}{ralign 11:Prob > chi2} = {res}{ralign 6:0.0826}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. * Detailed Diagnostics for HIV-Malnutrition Interaction
. * --------------------------------------------------
. 
. * 1. Calculate predicted probabilities for each combination
. margins ever_mal#hiv2, atmeans
{res}
{txt}{col 1}Adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(epi_binary), predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 10:1.africa} = {res:{ralign 8:.63596}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.africa} = {res:{ralign 8:.36404}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:age} = {res:{ralign 8:42.43513}} {txt:(mean)}

{res}{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27} Delta-method
{col 15}{c |}     Margin{col 27}   std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
ever_mal#hiv2 {c |}
{space 7}NPM#0  {c |}{col 15}{res}{space 2} .3481199{col 27}{space 2} .0207745{col 38}{space 1}   16.76{col 47}{space 3}0.000{col 55}{space 4} .3074027{col 68}{space 3} .3888371
{txt}{space 7}NPM#1  {c |}{col 15}{res}{space 2} .2844932{col 27}{space 2} .0264588{col 38}{space 1}   10.75{col 47}{space 3}0.000{col 55}{space 4} .2326349{col 68}{space 3} .3363514
{txt}{space 8}PM#0  {c |}{col 15}{res}{space 2} .3686347{col 27}{space 2} .0312475{col 38}{space 1}   11.80{col 47}{space 3}0.000{col 55}{space 4} .3073908{col 68}{space 3} .4298787
{txt}{space 8}PM#1  {c |}{col 15}{res}{space 2} .2277377{col 27}{space 2} .0218005{col 38}{space 1}   10.45{col 47}{space 3}0.000{col 55}{space 4} .1850095{col 68}{space 3} .2704659
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. marginsplot, recast(scatter) ///
>     title("HIV-Malnutrition Interaction", size(medium)) ///
>     ytitle("Predicted Probability of EPI") ///
>     xtitle("HIV Status") ///
>     xlabel(0 "HIV Negative" 1 "HIV Positive", labsize(medsmall)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     note("PM = Previously Malnourished; NPM = Not Previously Malnourished", size(small)) ///
>     plot1opts(msymbol(circle) mcolor(blue)) ///
>     plot2opts(msymbol(square) mcolor(red)) ///
>     ciopts(lcolor(blue red)) ///
>     legend(order(1 "NPM" 2 "PM") rows(1) position(6))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:ever_mal hiv2}{p_end}
{res}{txt}
{com}. gr save ./figures/hiv_mal_interaction, replace
{txt}{p 0 4 2}
(file {bf}
./figures/hiv_mal_interaction{rm}
not found)
{p_end}
{res}{txt}file {bf:./figures/hiv_mal_interaction} saved as .gph format

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. margins ever_mal#hiv2, atmeans
{res}
{txt}{col 1}Adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(epi_binary), predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 10:1.africa} = {res:{ralign 8:.63596}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.africa} = {res:{ralign 8:.36404}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:age} = {res:{ralign 8:42.43513}} {txt:(mean)}

{res}{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27} Delta-method
{col 15}{c |}     Margin{col 27}   std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
ever_mal#hiv2 {c |}
{space 7}NPM#0  {c |}{col 15}{res}{space 2} .3481199{col 27}{space 2} .0207745{col 38}{space 1}   16.76{col 47}{space 3}0.000{col 55}{space 4} .3074027{col 68}{space 3} .3888371
{txt}{space 7}NPM#1  {c |}{col 15}{res}{space 2} .2844932{col 27}{space 2} .0264588{col 38}{space 1}   10.75{col 47}{space 3}0.000{col 55}{space 4} .2326349{col 68}{space 3} .3363514
{txt}{space 8}PM#0  {c |}{col 15}{res}{space 2} .3686347{col 27}{space 2} .0312475{col 38}{space 1}   11.80{col 47}{space 3}0.000{col 55}{space 4} .3073908{col 68}{space 3} .4298787
{txt}{space 8}PM#1  {c |}{col 15}{res}{space 2} .2277377{col 27}{space 2} .0218005{col 38}{space 1}   10.45{col 47}{space 3}0.000{col 55}{space 4} .1850095{col 68}{space 3} .2704659
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, recast(scatter) ///
>     title("HIV-Malnutrition Interaction", size(medium)) ///
>     ytitle("Predicted Probability of EPI") ///
>     xtitle("HIV Status") ///
>     xlabel(0 "HIV Negative" 1 "HIV Positive", labsize(medsmall)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     note("PM = Previously Malnourished; NPM = Not Previously Malnourished", size(small)) ///
>     plot1opts(msymbol(circle) mcolor(blue) msize(medium)) ///
>     plot2opts(msymbol(square) mcolor(red) msize(medium)) ///
>     ciopts(lcolor(blue red)) ///
>     legend(order(1 "NPM (○)" 2 "PM (■)") rows(1) position(6) size(small))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:ever_mal hiv2}{p_end}
{res}{txt}
{com}. gr save ./figures/hiv_mal_interaction, replace
{res}{txt}file {bf:./figures/hiv_mal_interaction} saved as .gph format

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. gr export ./figures//hiv_mal_interaction.png. as(png) replace
{err}invalid 'as' 
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. gr export ./figures//hiv_mal_interaction.png, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures//hiv_mal_interaction.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. * 2. Calculate contrasts between PM and NPM within each HIV status
. margins r.ever_mal@hiv2, atmeans
{res}
{txt}{col 1}Contrasts of adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(epi_binary), predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 10:1.africa} = {res:{ralign 8:.63596}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.africa} = {res:{ralign 8:.36404}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:age} = {res:{ralign 8:42.43513}} {txt:(mean)}

{res}{col 1}{text}{hline 15}{c TT}{hline 11}{hline 12}{hline 11}
{col 16}{text}{c |}         df{col 28}        chi2{col 40}     P>chi2
{res}{col 1}{text}{hline 15}{c +}{hline 11}{hline 12}{hline 11}
{space 1}ever_mal@hiv2 {c |}
(PM vs NPM) 0  {res}{col 16}{text}{c |}{result}{space 2}        1{col 28}{space 3}     0.28{col 40}{space 2}   0.5979
{txt}(PM vs NPM) 1  {res}{col 16}{text}{c |}{result}{space 2}        1{col 28}{space 3}     3.25{col 40}{space 2}   0.0716
{col 1}{text}        Joint {col 16}{c |}{result}{space 2}        2{col 28}{space 3}     3.78{col 40}{space 2}   0.1508
{col 1}{text}{hline 15}{c BT}{hline 11}{hline 12}{hline 11}
{res}
{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}{col 28} Delta-method
{col 16}{c |}   Contrast{col 28}   std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}ever_mal@hiv2 {c |}
(PM vs NPM) 0  {c |}{col 16}{res}{space 2} .0205148{col 28}{space 2} .0388982{col 39}{space 5}-.0557243{col 53}{space 3}  .096754
{txt}(PM vs NPM) 1  {c |}{col 16}{res}{space 2}-.0567555{col 28}{space 2} .0314993{col 39}{space 5}-.1184929{col 53}{space 3} .0049819
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. marginsplot, recast(scatter) ///
>     title("Contrasts: PM vs NPM by HIV Status", size(medium)) ///
>     ytitle("Difference in Predicted Probability (PM - NPM)") ///
>     xtitle("HIV Status") ///
>     xlabel(0 "HIV Negative" 1 "HIV Positive", labsize(medsmall)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     yline(0, lcolor(red) lpattern(dash)) ///
>     note("Positive values indicate higher probability in PM group", size(small)) ///
>     plot1opts(msymbol(circle) mcolor(blue)) ///
>     ciopts(lcolor(blue))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:hiv2}{p_end}
{res}{txt}
{com}. gr save ./figures/hiv_mal_contrasts, replace
{txt}{p 0 4 2}
(file {bf}
./figures/hiv_mal_contrasts{rm}
not found)
{p_end}
{res}{txt}file {bf:./figures/hiv_mal_contrasts} saved as .gph format

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. gr export ./figures/hiv_mal_contrasts.png, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures/hiv_mal_contrasts.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. * 3. Calculate contrasts between HIV positive and negative within each malnutrition status
. margins r.hiv2@ever_mal, atmeans
{res}
{txt}{col 1}Contrasts of adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(epi_binary), predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 10:1.africa} = {res:{ralign 8:.63596}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.africa} = {res:{ralign 8:.36404}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:age} = {res:{ralign 8:42.43513}} {txt:(mean)}

{res}{col 1}{text}{hline 14}{c TT}{hline 11}{hline 12}{hline 11}
{col 15}{text}{c |}         df{col 27}        chi2{col 39}     P>chi2
{res}{col 1}{text}{hline 14}{c +}{hline 11}{hline 12}{hline 11}
hiv2@ever_mal {c |}
(1 vs 0) NPM  {res}{col 15}{text}{c |}{result}{space 2}        1{col 27}{space 3}     3.78{col 39}{space 2}   0.0519
{txt}{space 1}(1 vs 0) PM  {res}{col 15}{text}{c |}{result}{space 2}        1{col 27}{space 3}    12.53{col 39}{space 2}   0.0004
{col 1}{text}       Joint {col 15}{c |}{result}{space 2}        2{col 27}{space 3}    14.45{col 39}{space 2}   0.0007
{col 1}{text}{hline 14}{c BT}{hline 11}{hline 12}{hline 11}
{res}
{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}{col 27} Delta-method
{col 15}{c |}   Contrast{col 27}   std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
hiv2@ever_mal {c |}
(1 vs 0) NPM  {c |}{col 15}{res}{space 2}-.0636267{col 27}{space 2} .0327362{col 38}{space 5}-.1277885{col 52}{space 3} .0005351
{txt}{space 1}(1 vs 0) PM  {c |}{col 15}{res}{space 2} -.140897{col 27}{space 2} .0397997{col 38}{space 5}-.2189031{col 52}{space 3} -.062891
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. marginsplot, recast(scatter) ///
>     title("Contrasts: HIV+ vs HIV- by Malnutrition Status", size(medium)) ///
>     ytitle("Difference in Predicted Probability (HIV+ - HIV-)") ///
>     xtitle("Malnutrition Status") ///
>     xlabel(0 "NPM" 1 "PM", labsize(medsmall)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     yline(0, lcolor(red) lpattern(dash)) ///
>     note("Negative values indicate lower probability in HIV+ group", size(small)) ///
>     plot1opts(msymbol(circle) mcolor(blue)) ///
>     ciopts(lcolor(blue))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:ever_mal}{p_end}
{res}{txt}
{com}. gr save ./figures/hiv_mal_contrasts2, replace
{txt}{p 0 4 2}
(file {bf}
./figures/hiv_mal_contrasts2{rm}
not found)
{p_end}
{res}{txt}file {bf:./figures/hiv_mal_contrasts2} saved as .gph format

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. gr export ./figures/hiv_mal_contrasts2, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures/hiv_mal_contrasts2{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. estat gof, group(10)
{txt}{p 0 6 2}note: obs collapsed on 10 quantiles of estimated probabilities.

Goodness-of-fit test after logistic model
Variable: {res}epi_binary

{txt}{ralign 23:Number of observations} = {res}{ralign 6:1,802}
{txt}{ralign 23:Number of groups} = {res}{ralign 6:10}
{txt}{ralign 23:Hosmer–Lemeshow chi2({res:8})} = {res}{ralign 6:11.47}
{txt}{ralign 23:Prob > chi2} = {res}{ralign 6:0.1766}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. logistic epi_bin i.ever_mal##i.bmi_cat i.ever_mal##i.africa i.child i.exposure i.hiv2
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:12})}{col 70} = {res}{ralign 6:180.42}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1056.3283}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0787}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         epi_binary{col 21}{c |} Odds ratio{col 33}   Std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}ever_mal {c |}
{space 16}PM  {c |}{col 21}{res}{space 2} 1.192886{col 33}{space 2} .4368772{col 44}{space 1}    0.48{col 53}{space 3}0.630{col 61}{space 4} .5819141{col 74}{space 3}  2.44534
{txt}{space 19} {c |}
{space 12}bmi_cat {c |}
{space 5}Normal Weight  {c |}{col 21}{res}{space 2} 1.344959{col 33}{space 2} .4657895{col 44}{space 1}    0.86{col 53}{space 3}0.392{col 61}{space 4}  .682211{col 74}{space 3} 2.651546
{txt}{space 8}Overweight  {c |}{col 21}{res}{space 2} .9785095{col 33}{space 2} .3578767{col 44}{space 1}   -0.06{col 53}{space 3}0.953{col 61}{space 4} .4778037{col 74}{space 3} 2.003921
{txt}{space 13}Obese  {c |}{col 21}{res}{space 2} .7140846{col 33}{space 2}  .279911{col 44}{space 1}   -0.86{col 53}{space 3}0.390{col 61}{space 4} .3312003{col 74}{space 3} 1.539602
{txt}{space 19} {c |}
{space 3}ever_mal#bmi_cat {c |}
{space 2}PM#Normal Weight  {c |}{col 21}{res}{space 2} .6912266{col 33}{space 2} .2666818{col 44}{space 1}   -0.96{col 53}{space 3}0.338{col 61}{space 4} .3245031{col 74}{space 3} 1.472387
{txt}{space 5}PM#Overweight  {c |}{col 21}{res}{space 2} 1.187153{col 33}{space 2} .5642388{col 44}{space 1}    0.36{col 53}{space 3}0.718{col 61}{space 4} .4676719{col 74}{space 3} 3.013505
{txt}{space 10}PM#Obese  {c |}{col 21}{res}{space 2} 1.174619{col 33}{space 2} .7843376{col 44}{space 1}    0.24{col 53}{space 3}0.810{col 61}{space 4} .3173349{col 74}{space 3} 4.347869
{txt}{space 19} {c |}
{space 13}africa {c |}
{space 14}Asia  {c |}{col 21}{res}{space 2} .2394529{col 33}{space 2} .0494702{col 44}{space 1}   -6.92{col 53}{space 3}0.000{col 61}{space 4} .1597219{col 74}{space 3} .3589845
{txt}{space 19} {c |}
{space 4}ever_mal#africa {c |}
{space 11}PM#Asia  {c |}{col 21}{res}{space 2} .7284409{col 33}{space 2} .1886501{col 44}{space 1}   -1.22{col 53}{space 3}0.221{col 61}{space 4} .4384822{col 74}{space 3} 1.210143
{txt}{space 19} {c |}
{space 14}child {c |}
{space 13}Adult  {c |}{col 21}{res}{space 2} .5560799{col 33}{space 2} .1544253{col 44}{space 1}   -2.11{col 53}{space 3}0.035{col 61}{space 4} .3226677{col 74}{space 3} .9583383
{txt}{space 19} {c |}
{space 7}exposuretime {c |}
Exposure as Adults  {c |}{col 21}{res}{space 2} 1.260449{col 33}{space 2} .3037144{col 44}{space 1}    0.96{col 53}{space 3}0.337{col 61}{space 4} .7859986{col 74}{space 3} 2.021289
{txt}{space 13}1.hiv2 {c |}{col 21}{res}{space 2} .6715596{col 33}{space 2} .0916025{col 44}{space 1}   -2.92{col 53}{space 3}0.004{col 61}{space 4}  .514018{col 74}{space 3} .8773861
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 1.184005{col 33}{space 2} .4117861{col 44}{space 1}    0.49{col 53}{space 3}0.627{col 61}{space 4} .5988435{col 74}{space 3} 2.340958
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. 
. * Clear any existing estimates and memory
. clear matrix
{txt}
{com}. clear mata
{txt}
{com}. eststo clear
{txt}
{com}. collect clear
{res}{txt}
{com}. 
. * 1. Basic Models
. * -------------
. * Model 1: Unadjusted (ever_mal only)
. logistic epi_binary ever_mal
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:1})}{col 70} = {res}{ralign 6:1.47}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.2254}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1145.8011}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0006}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  epi_binary{col 14}{c |} Odds ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} .8849659{col 26}{space 2} .0893075{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}   .72615{col 67}{space 3} 1.078516
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5266362{col 26}{space 2} .0349817{col 37}{space 1}   -9.65{col 46}{space 3}0.000{col 54}{space 4}  .462349{col 67}{space 3} .5998623
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model1
{txt}
{com}. estadd local controls "No"

{txt}added macro:
           e(controls) : "{res:No}"

{com}. 
. * Model 2: Adjusted for age
. logistic epi_binary ever_mal age
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:2})}{col 70} = {res}{ralign 6:2.85}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.2411}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1145.1133}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0012}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  epi_binary{col 14}{c |} Odds ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} .8953438{col 26}{space 2} .0908059{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4} .7339406{col 67}{space 3} 1.092242
{txt}{space 9}age {c |}{col 14}{res}{space 2} 1.004027{col 26}{space 2} .0034457{col 37}{space 1}    1.17{col 46}{space 3}0.242{col 54}{space 4} .9972966{col 67}{space 3} 1.010804
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4415057{col 26}{space 2} .0728116{col 37}{space 1}   -4.96{col 46}{space 3}0.000{col 54}{space 4} .3195648{col 67}{space 3} .6099772
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model2
{txt}
{com}. estadd local controls "Age"

{txt}added macro:
           e(controls) : "{res:Age}"

{com}. 
. * Model 3: Adjusted for cohort
. logistic epi_binary ever_mal cohort
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:2})}{col 70} = {res}{ralign 6:75.04}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1109.0138}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0327}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  epi_binary{col 14}{c |} Odds ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} .7993336{col 26}{space 2} .0830243{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4} .6521033{col 67}{space 3} .9798052
{txt}{space 6}cohort {c |}{col 14}{res}{space 2} .7244147{col 26}{space 2} .0281306{col 37}{space 1}   -8.30{col 46}{space 3}0.000{col 54}{space 4} .6713256{col 67}{space 3} .7817022
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.764456{col 26}{space 2} .2774359{col 37}{space 1}    3.61{col 46}{space 3}0.000{col 54}{space 4} 1.296497{col 67}{space 3} 2.401322
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model3
{txt}
{com}. estadd local controls "Cohort"

{txt}added macro:
           e(controls) : "{res:Cohort}"

{com}. 
. * Model 4: Fully adjusted
. logistic epi_binary ever_mal age cohort
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:3})}{col 70} = {res}{ralign 6:91.37}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1100.8514}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0398}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  epi_binary{col 14}{c |} Odds ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} .8269994{col 26}{space 2} .0863373{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4} .6739709{col 67}{space 3} 1.014774
{txt}{space 9}age {c |}{col 14}{res}{space 2} 1.014531{col 26}{space 2} .0036319{col 37}{space 1}    4.03{col 46}{space 3}0.000{col 54}{space 4} 1.007437{col 67}{space 3} 1.021674
{txt}{space 6}cohort {c |}{col 14}{res}{space 2} .6833401{col 26}{space 2} .0291544{col 37}{space 1}   -8.92{col 46}{space 3}0.000{col 54}{space 4} .6285224{col 67}{space 3} .7429389
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.155271{col 26}{space 2} .2200157{col 37}{space 1}    0.76{col 46}{space 3}0.449{col 54}{space 4}  .795384{col 67}{space 3} 1.677997
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model4
{txt}
{com}. estadd local controls "Age + Cohort"

{txt}added macro:
           e(controls) : "{res:Age + Cohort}"

{com}. 
. * Model 5: Adjusted for region, BMI, HIV, and age
. logistic epi_binary ever_mal i.africa i.bmi_cat i.hiv2 age
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:7})}{col 70} = {res}{ralign 6:172.20}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1060.4378}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0751}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    epi_binary{col 16}{c |} Odds ratio{col 28}   Std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ever_mal {c |}{col 16}{res}{space 2} .8961017{col 28}{space 2} .1107288{col 39}{space 1}   -0.89{col 48}{space 3}0.375{col 56}{space 4} .7033584{col 69}{space 3} 1.141663
{txt}{space 14} {c |}
{space 8}africa {c |}
{space 9}Asia  {c |}{col 16}{res}{space 2} .1928755{col 28}{space 2} .0280229{col 39}{space 1}  -11.33{col 48}{space 3}0.000{col 56}{space 4} .1450795{col 69}{space 3} .2564178
{txt}{space 14} {c |}
{space 7}bmi_cat {c |}
Normal Weight  {c |}{col 16}{res}{space 2} .9896693{col 28}{space 2} .1485803{col 39}{space 1}   -0.07{col 48}{space 3}0.945{col 56}{space 4} .7373915{col 69}{space 3} 1.328257
{txt}{space 3}Overweight  {c |}{col 16}{res}{space 2} .7832399{col 28}{space 2} .1504542{col 39}{space 1}   -1.27{col 48}{space 3}0.203{col 56}{space 4}  .537509{col 69}{space 3} 1.141311
{txt}{space 8}Obese  {c |}{col 16}{res}{space 2} .5420908{col 28}{space 2} .1286947{col 39}{space 1}   -2.58{col 48}{space 3}0.010{col 56}{space 4} .3404028{col 69}{space 3} .8632785
{txt}{space 14} {c |}
{space 8}1.hiv2 {c |}{col 16}{res}{space 2} .6433607{col 28}{space 2} .0840062{col 39}{space 1}   -3.38{col 48}{space 3}0.001{col 56}{space 4} .4980922{col 69}{space 3} .8309968
{txt}{space 11}age {c |}{col 16}{res}{space 2} .9987102{col 28}{space 2} .0037305{col 39}{space 1}   -0.35{col 48}{space 3}0.730{col 56}{space 4} .9914252{col 69}{space 3} 1.006049
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1.221053{col 28}{space 2} .2808916{col 39}{space 1}    0.87{col 48}{space 3}0.385{col 56}{space 4} .7778996{col 69}{space 3} 1.916661
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model5
{txt}
{com}. estadd local controls "Region + BMI + HIV + Age"

{txt}added macro:
           e(controls) : "{res:Region + BMI + HIV + Age}"

{com}. 
. * 2. Models with Interactions
. * -------------------------
. * Model 5a: Adding BMI-malnutrition interaction
. logistic epi_binary i.ever_mal i.africa i.ever_mal##i.bmi_cat i.hiv2 age
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:10})}{col 70} = {res}{ralign 6:174.77}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1059.1526}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0762}

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       epi_binary{col 19}{c |} Odds ratio{col 31}   Std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}ever_mal {c |}
{space 14}PM  {c |}{col 19}{res}{space 2} .9923521{col 31}{space 2} .3516906{col 42}{space 1}   -0.02{col 51}{space 3}0.983{col 59}{space 4} .4954491{col 72}{space 3} 1.987616
{txt}{space 17} {c |}
{space 11}africa {c |}
{space 12}Asia  {c |}{col 19}{res}{space 2} .1907743{col 31}{space 2} .0278218{col 42}{space 1}  -11.36{col 51}{space 3}0.000{col 59}{space 4} .1433454{col 72}{space 3} .2538961
{txt}{space 17} {c |}
{space 10}bmi_cat {c |}
{space 3}Normal Weight  {c |}{col 19}{res}{space 2} 1.132644{col 31}{space 2} .3868401{col 42}{space 1}    0.36{col 51}{space 3}0.715{col 59}{space 4} .5799312{col 72}{space 3} 2.212129
{txt}{space 6}Overweight  {c |}{col 19}{res}{space 2} .7922234{col 31}{space 2} .2835851{col 42}{space 1}   -0.65{col 51}{space 3}0.515{col 59}{space 4} .3927812{col 72}{space 3} 1.597882
{txt}{space 11}Obese  {c |}{col 19}{res}{space 2} .5675503{col 31}{space 2} .2170982{col 42}{space 1}   -1.48{col 51}{space 3}0.139{col 59}{space 4} .2681664{col 72}{space 3}  1.20117
{txt}{space 17} {c |}
{space 1}ever_mal#bmi_cat {c |}
PM#Normal Weight  {c |}{col 19}{res}{space 2} .8058795{col 31}{space 2} .3074444{col 42}{space 1}   -0.57{col 51}{space 3}0.572{col 59}{space 4} .3815358{col 72}{space 3} 1.702178
{txt}{space 3}PM#Overweight  {c |}{col 19}{res}{space 2} 1.318946{col 31}{space 2} .6211951{col 42}{space 1}    0.59{col 51}{space 3}0.557{col 59}{space 4} .5239976{col 72}{space 3} 3.319897
{txt}{space 8}PM#Obese  {c |}{col 19}{res}{space 2} 1.280645{col 31}{space 2} .8456867{col 42}{space 1}    0.37{col 51}{space 3}0.708{col 59}{space 4}  .351018{col 72}{space 3} 4.672273
{txt}{space 17} {c |}
{space 11}1.hiv2 {c |}{col 19}{res}{space 2} .6394846{col 31}{space 2} .0836671{col 42}{space 1}   -3.42{col 51}{space 3}0.001{col 59}{space 4}  .494838{col 72}{space 3} .8264132
{txt}{space 14}age {c |}{col 19}{res}{space 2} .9988731{col 31}{space 2} .0037667{col 42}{space 1}   -0.30{col 51}{space 3}0.765{col 59}{space 4} .9915177{col 72}{space 3} 1.006283
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}  1.11788{col 31}{space 2} .3958012{col 42}{space 1}    0.31{col 51}{space 3}0.753{col 59}{space 4} .5584897{col 72}{space 3} 2.237562
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model5a
{txt}
{com}. estadd local controls "All + BMI Interaction"

{txt}added macro:
           e(controls) : "{res:All + BMI Interaction}"

{com}. 
. * Model 5b: Adding region-malnutrition interaction
. logistic epi_binary i.ever_mal##i.africa i.bmi_cat i.hiv2 age
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:8})}{col 70} = {res}{ralign 6:172.67}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1060.1997}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0753}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     epi_binary{col 17}{c |} Odds ratio{col 29}   Std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}ever_mal {c |}
{space 12}PM  {c |}{col 17}{res}{space 2} .9374159{col 29}{space 2} .1310963{col 40}{space 1}   -0.46{col 49}{space 3}0.644{col 57}{space 4} .7126775{col 70}{space 3} 1.233024
{txt}{space 15} {c |}
{space 9}africa {c |}
{space 10}Asia  {c |}{col 17}{res}{space 2} .2065853{col 29}{space 2} .0361109{col 40}{space 1}   -9.02{col 49}{space 3}0.000{col 57}{space 4} .1466595{col 70}{space 3}  .290997
{txt}{space 15} {c |}
ever_mal#africa {c |}
{space 7}PM#Asia  {c |}{col 17}{res}{space 2} .8406316{col 29}{space 2} .2117128{col 40}{space 1}   -0.69{col 49}{space 3}0.491{col 57}{space 4} .5131341{col 70}{space 3} 1.377148
{txt}{space 15} {c |}
{space 8}bmi_cat {c |}
{space 1}Normal Weight  {c |}{col 17}{res}{space 2} .9898428{col 29}{space 2}  .149023{col 40}{space 1}   -0.07{col 49}{space 3}0.946{col 57}{space 4} .7369126{col 70}{space 3} 1.329586
{txt}{space 4}Overweight  {c |}{col 17}{res}{space 2}  .782412{col 29}{space 2} .1504467{col 40}{space 1}   -1.28{col 49}{space 3}0.202{col 57}{space 4} .5367371{col 70}{space 3} 1.140537
{txt}{space 9}Obese  {c |}{col 17}{res}{space 2}  .544884{col 29}{space 2} .1294219{col 40}{space 1}   -2.56{col 49}{space 3}0.011{col 57}{space 4} .3420779{col 70}{space 3} .8679269
{txt}{space 15} {c |}
{space 9}1.hiv2 {c |}{col 17}{res}{space 2}  .635282{col 29}{space 2} .0838289{col 40}{space 1}   -3.44{col 49}{space 3}0.001{col 57}{space 4} .4905078{col 70}{space 3} .8227865
{txt}{space 12}age {c |}{col 17}{res}{space 2} .9984242{col 29}{space 2} .0037599{col 40}{space 1}   -0.42{col 49}{space 3}0.675{col 57}{space 4} .9910821{col 70}{space 3} 1.005821
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 1.221723{col 29}{space 2}  .281431{col 40}{space 1}    0.87{col 49}{space 3}0.385{col 57}{space 4} .7778462{col 70}{space 3} 1.918899
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model5b
{txt}
{com}. estadd local controls "All + Region Interaction"

{txt}added macro:
           e(controls) : "{res:All + Region Interaction}"

{com}. 
. * Model 5c: Adding HIV-malnutrition interaction
. logistic epi_binary i.ever_mal i.africa i.bmi_cat i.ever_mal##i.hiv2 age
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:1,802}
{txt}{col 57}{lalign 13:LR chi2({res:8})}{col 70} = {res}{ralign 6:175.21}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1058.9318}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0764}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    epi_binary{col 16}{c |} Odds ratio{col 28}   Std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ever_mal {c |}
{space 11}PM  {c |}{col 16}{res}{space 2} 1.093338{col 28}{space 2} .1842368{col 39}{space 1}    0.53{col 48}{space 3}0.596{col 56}{space 4} .7858139{col 69}{space 3}  1.52121
{txt}{space 14} {c |}
{space 8}africa {c |}
{space 9}Asia  {c |}{col 16}{res}{space 2}  .184506{col 28}{space 2}  .027407{col 39}{space 1}  -11.38{col 48}{space 3}0.000{col 56}{space 4} .1379021{col 69}{space 3} .2468597
{txt}{space 14} {c |}
{space 7}bmi_cat {c |}
Normal Weight  {c |}{col 16}{res}{space 2} .9956567{col 28}{space 2} .1494901{col 39}{space 1}   -0.03{col 48}{space 3}0.977{col 56}{space 4} .7418367{col 69}{space 3} 1.336321
{txt}{space 3}Overweight  {c |}{col 16}{res}{space 2} .7939268{col 28}{space 2} .1526684{col 39}{space 1}   -1.20{col 48}{space 3}0.230{col 56}{space 4} .5446261{col 69}{space 3} 1.157344
{txt}{space 8}Obese  {c |}{col 16}{res}{space 2} .5441282{col 28}{space 2}  .129238{col 39}{space 1}   -2.56{col 48}{space 3}0.010{col 56}{space 4} .3416088{col 69}{space 3} .8667092
{txt}{space 14} {c |}
{space 8}1.hiv2 {c |}{col 16}{res}{space 2} .7445554{col 28}{space 2} .1152914{col 39}{space 1}   -1.90{col 48}{space 3}0.057{col 56}{space 4} .5496571{col 69}{space 3} 1.008561
{txt}{space 14} {c |}
{space 1}ever_mal#hiv2 {c |}
{space 9}PM#1  {c |}{col 16}{res}{space 2} .6783558{col 28}{space 2} .1517001{col 39}{space 1}   -1.74{col 48}{space 3}0.083{col 56}{space 4} .4376269{col 69}{space 3} 1.051504
{txt}{space 14} {c |}
{space 11}age {c |}{col 16}{res}{space 2} .9999165{col 28}{space 2} .0037902{col 39}{space 1}   -0.02{col 48}{space 3}0.982{col 56}{space 4} .9925154{col 69}{space 3} 1.007373
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1.100575{col 28}{space 2} .2614816{col 39}{space 1}    0.40{col 48}{space 3}0.687{col 56}{space 4} .6908535{col 69}{space 3} 1.753289
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. eststo model5c
{txt}
{com}. estadd local controls "All + HIV Interaction"

{txt}added macro:
           e(controls) : "{res:All + HIV Interaction}"

{com}. 
. * 3. Model Comparisons
. * -------------------
. * Compare models with likelihood ratio tests
. lrtest model5 model5a

{txt}Likelihood-ratio test
Assumption: {res}{stata est replay model5:model5}{txt} nested within {res}{stata est replay model5a:model5a}

{txt}{ralign 11:LR chi2({res:3})} = {res}{ralign 6:2.57}
{txt}{ralign 11:Prob > chi2} = {res}{ralign 6:0.4627}
{txt}
{com}. lrtest model5 model5b

{txt}Likelihood-ratio test
Assumption: {res}{stata est replay model5:model5}{txt} nested within {res}{stata est replay model5b:model5b}

{txt}{ralign 11:LR chi2({res:1})} = {res}{ralign 6:0.48}
{txt}{ralign 11:Prob > chi2} = {res}{ralign 6:0.4901}
{txt}
{com}. lrtest model5 model5c

{txt}Likelihood-ratio test
Assumption: {res}{stata est replay model5:model5}{txt} nested within {res}{stata est replay model5c:model5c}

{txt}{ralign 11:LR chi2({res:1})} = {res}{ralign 6:3.01}
{txt}{ralign 11:Prob > chi2} = {res}{ralign 6:0.0826}
{txt}
{com}. 
. * 4. Detailed Diagnostics for HIV-Malnutrition Interaction
. * --------------------------------------------------
. * Calculate predicted probabilities for each combination
. margins ever_mal#hiv2, atmeans
{res}
{txt}{col 1}Adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(epi_binary), predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 10:1.africa} = {res:{ralign 8:.63596}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.africa} = {res:{ralign 8:.36404}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:age} = {res:{ralign 8:42.43513}} {txt:(mean)}

{res}{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27} Delta-method
{col 15}{c |}     Margin{col 27}   std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
ever_mal#hiv2 {c |}
{space 7}NPM#0  {c |}{col 15}{res}{space 2} .3481199{col 27}{space 2} .0207745{col 38}{space 1}   16.76{col 47}{space 3}0.000{col 55}{space 4} .3074027{col 68}{space 3} .3888371
{txt}{space 7}NPM#1  {c |}{col 15}{res}{space 2} .2844932{col 27}{space 2} .0264588{col 38}{space 1}   10.75{col 47}{space 3}0.000{col 55}{space 4} .2326349{col 68}{space 3} .3363514
{txt}{space 8}PM#0  {c |}{col 15}{res}{space 2} .3686347{col 27}{space 2} .0312475{col 38}{space 1}   11.80{col 47}{space 3}0.000{col 55}{space 4} .3073908{col 68}{space 3} .4298787
{txt}{space 8}PM#1  {c |}{col 15}{res}{space 2} .2277377{col 27}{space 2} .0218005{col 38}{space 1}   10.45{col 47}{space 3}0.000{col 55}{space 4} .1850095{col 68}{space 3} .2704659
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, recast(scatter) ///
>     title("HIV-Malnutrition Interaction", size(medium)) ///
>     ytitle("Predicted Probability of EPI") ///
>     xtitle("HIV Status") ///
>     xlabel(0 "HIV Negative" 1 "HIV Positive", labsize(medsmall)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     note("PM = Previously Malnourished; NPM = Not Previously Malnourished", size(small)) ///
>     plot1opts(msymbol(circle) mcolor(blue) msize(medium)) ///
>     plot2opts(msymbol(square) mcolor(red) msize(medium)) ///
>     ciopts(lcolor(blue red)) ///
>     legend(order(1 "NPM (○)" 2 "PM (■)") rows(1) position(6) size(small))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:ever_mal hiv2}{p_end}
{res}{txt}
{com}. gr save ./figures/hiv_mal_interaction, replace
{txt}{p 0 4 2}
(file {bf}
./figures/hiv_mal_interaction{rm}
not found)
{p_end}
{res}{txt}file {bf:./figures/hiv_mal_interaction} saved as .gph format

{com}. gr export ./figures/hiv_mal_interaction.png, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures/hiv_mal_interaction.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. * Calculate contrasts between PM and NPM within each HIV status
. margins r.ever_mal@hiv2, atmeans
{res}
{txt}{col 1}Contrasts of adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(epi_binary), predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 10:1.africa} = {res:{ralign 8:.63596}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.africa} = {res:{ralign 8:.36404}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:age} = {res:{ralign 8:42.43513}} {txt:(mean)}

{res}{col 1}{text}{hline 15}{c TT}{hline 11}{hline 12}{hline 11}
{col 16}{text}{c |}         df{col 28}        chi2{col 40}     P>chi2
{res}{col 1}{text}{hline 15}{c +}{hline 11}{hline 12}{hline 11}
{space 1}ever_mal@hiv2 {c |}
(PM vs NPM) 0  {res}{col 16}{text}{c |}{result}{space 2}        1{col 28}{space 3}     0.28{col 40}{space 2}   0.5979
{txt}(PM vs NPM) 1  {res}{col 16}{text}{c |}{result}{space 2}        1{col 28}{space 3}     3.25{col 40}{space 2}   0.0716
{col 1}{text}        Joint {col 16}{c |}{result}{space 2}        2{col 28}{space 3}     3.78{col 40}{space 2}   0.1508
{col 1}{text}{hline 15}{c BT}{hline 11}{hline 12}{hline 11}
{res}
{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}{col 28} Delta-method
{col 16}{c |}   Contrast{col 28}   std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}ever_mal@hiv2 {c |}
(PM vs NPM) 0  {c |}{col 16}{res}{space 2} .0205148{col 28}{space 2} .0388982{col 39}{space 5}-.0557243{col 53}{space 3}  .096754
{txt}(PM vs NPM) 1  {c |}{col 16}{res}{space 2}-.0567555{col 28}{space 2} .0314993{col 39}{space 5}-.1184929{col 53}{space 3} .0049819
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. marginsplot, recast(scatter) ///
>     title("Contrasts: PM vs NPM by HIV Status", size(medium)) ///
>     ytitle("Difference in Predicted Probability (PM - NPM)") ///
>     xtitle("HIV Status") ///
>     xlabel(0 "HIV Negative" 1 "HIV Positive", labsize(medsmall)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     yline(0, lcolor(red) lpattern(dash)) ///
>     note("Positive values indicate higher probability in PM group", size(small)) ///
>     plot1opts(msymbol(circle) mcolor(blue)) ///
>     ciopts(lcolor(blue))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:hiv2}{p_end}
{res}{txt}
{com}. gr save ./figures/hiv_mal_contrasts, replace
{res}{txt}file {bf:./figures/hiv_mal_contrasts} saved as .gph format

{com}. gr export ./figures/hiv_mal_contrasts.png, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures/hiv_mal_contrasts.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. * Calculate contrasts between HIV positive and negative within each malnutrition status
. margins r.hiv2@ever_mal, atmeans
{res}
{txt}{col 1}Contrasts of adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(epi_binary), predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 10:1.africa} = {res:{ralign 8:.63596}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.africa} = {res:{ralign 8:.36404}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:age} = {res:{ralign 8:42.43513}} {txt:(mean)}

{res}{col 1}{text}{hline 14}{c TT}{hline 11}{hline 12}{hline 11}
{col 15}{text}{c |}         df{col 27}        chi2{col 39}     P>chi2
{res}{col 1}{text}{hline 14}{c +}{hline 11}{hline 12}{hline 11}
hiv2@ever_mal {c |}
(1 vs 0) NPM  {res}{col 15}{text}{c |}{result}{space 2}        1{col 27}{space 3}     3.78{col 39}{space 2}   0.0519
{txt}{space 1}(1 vs 0) PM  {res}{col 15}{text}{c |}{result}{space 2}        1{col 27}{space 3}    12.53{col 39}{space 2}   0.0004
{col 1}{text}       Joint {col 15}{c |}{result}{space 2}        2{col 27}{space 3}    14.45{col 39}{space 2}   0.0007
{col 1}{text}{hline 14}{c BT}{hline 11}{hline 12}{hline 11}
{res}
{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}{col 27} Delta-method
{col 15}{c |}   Contrast{col 27}   std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
hiv2@ever_mal {c |}
(1 vs 0) NPM  {c |}{col 15}{res}{space 2}-.0636267{col 27}{space 2} .0327362{col 38}{space 5}-.1277885{col 52}{space 3} .0005351
{txt}{space 1}(1 vs 0) PM  {c |}{col 15}{res}{space 2} -.140897{col 27}{space 2} .0397997{col 38}{space 5}-.2189031{col 52}{space 3} -.062891
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. marginsplot, recast(scatter) ///
>     title("Contrasts: HIV+ vs HIV- by Malnutrition Status", size(medium)) ///
>     ytitle("Difference in Predicted Probability (HIV+ - HIV-)") ///
>     xtitle("Malnutrition Status") ///
>     xlabel(0 "NPM" 1 "PM", labsize(medsmall)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     yline(0, lcolor(red) lpattern(dash)) ///
>     note("Negative values indicate lower probability in HIV+ group", size(small)) ///
>     plot1opts(msymbol(circle) mcolor(blue)) ///
>     ciopts(lcolor(blue))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:ever_mal}{p_end}
{res}{txt}
{com}. gr save ./figures/hiv_mal_contrasts2, replace
{res}{txt}file {bf:./figures/hiv_mal_contrasts2} saved as .gph format

{com}. gr export ./figures/hiv_mal_contrasts2.png, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures/hiv_mal_contrasts2.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. * Combine all HIV-malnutrition visualizations
. graph combine "./figures/hiv_mal_interaction.gph" "./figures/hiv_mal_contrasts.gph" "./figures/hiv_mal_contrasts2.gph", ///
>     title("HIV-Malnutrition Interaction Analysis", size(medium)) ///
>     rows(3) cols(1) ///
>     ycommon ///
>     note("Top: Predicted Probabilities" "Middle: PM vs NPM Contrasts" "Bottom: HIV+ vs HIV- Contrasts", size(vsmall))
{err}{p 0 4 2}
file {bf:{err}./figures/hiv_mal_interaction.gph}
not found
{p_end}
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. 
. 
. * 4a. Detailed Diagnostics for Africa-Malnutrition Interaction
. * ------------------------------------------------------
. * Calculate predicted probabilities for each combination
. margins ever_mal#africa, atmeans
{res}
{txt}{col 1}Adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(epi_binary), predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 10:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:0.hiv2} = {res:{ralign 8:.6104329}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:1.hiv2} = {res:{ralign 8:.3895671}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:age} = {res:{ralign 8:42.43513}} {txt:(mean)}

{res}{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29} Delta-method
{col 17}{c |}     Margin{col 29}   std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
ever_mal#africa {c |}
{space 4}NPM#Africa  {c |}{col 17}{res}{space 2} .4683002{col 29}{space 2} .0200382{col 40}{space 1}   23.37{col 49}{space 3}0.000{col 57}{space 4} .4290261{col 70}{space 3} .5075743
{txt}{space 6}NPM#Asia  {c |}{col 17}{res}{space 2} .1397891{col 29}{space 2}  .016657{col 40}{space 1}    8.39{col 49}{space 3}0.000{col 57}{space 4}  .107142{col 70}{space 3} .1724362
{txt}{space 5}PM#Africa  {c |}{col 17}{res}{space 2} .4529103{col 29}{space 2} .0265134{col 40}{space 1}   17.08{col 49}{space 3}0.000{col 57}{space 4}  .400945{col 70}{space 3} .5048757
{txt}{space 7}PM#Asia  {c |}{col 17}{res}{space 2} .1325047{col 29}{space 2} .0148874{col 40}{space 1}    8.90{col 49}{space 3}0.000{col 57}{space 4}  .103326{col 70}{space 3} .1616835
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, recast(scatter) ///
>     title("Africa-Malnutrition Interaction", size(medium)) ///
>     ytitle("Predicted Probability of EPI") ///
>     xtitle("Region") ///
>     xlabel(0 "Africa" 1 "Asia", labsize(medsmall)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     note("PM = Previously Malnourished; NPM = Not Previously Malnourished", size(small)) ///
>     plot1opts(msymbol(circle) mcolor(blue) msize(medium)) ///
>     plot2opts(msymbol(square) mcolor(red) msize(medium)) ///
>     ciopts(lcolor(blue red)) ///
>     legend(order(1 "NPM (○)" 2 "PM (■)") rows(1) position(6) size(small))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:ever_mal africa}{p_end}
{res}{txt}
{com}. gr save ./figures/africa_mal_interaction, replace
{txt}{p 0 4 2}
(file {bf}
./figures/africa_mal_interaction{rm}
not found)
{p_end}
{res}{txt}file {bf:./figures/africa_mal_interaction} saved as .gph format

{com}. gr export ./figures/africa_mal_interaction.png, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures/africa_mal_interaction.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. * Calculate contrasts between PM and NPM within each region
. margins r.ever_mal@africa, atmeans
{res}
{txt}{col 1}Contrasts of adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(epi_binary), predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 10:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:0.hiv2} = {res:{ralign 8:.6104329}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:1.hiv2} = {res:{ralign 8:.3895671}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:age} = {res:{ralign 8:42.43513}} {txt:(mean)}

{res}{col 1}{text}{hline 20}{c TT}{hline 11}{hline 12}{hline 11}
{col 21}{text}{c |}         df{col 33}        chi2{col 45}     P>chi2
{res}{col 1}{text}{hline 20}{c +}{hline 11}{hline 12}{hline 11}
{space 4}ever_mal@africa {c |}
(PM vs NPM) Africa  {res}{col 21}{text}{c |}{result}{space 2}        1{col 33}{space 3}     0.24{col 45}{space 2}   0.6242
{txt}{space 2}(PM vs NPM) Asia  {res}{col 21}{text}{c |}{result}{space 2}        1{col 33}{space 3}     0.24{col 45}{space 2}   0.6260
{col 1}{text}             Joint {col 21}{c |}{result}{space 2}        2{col 33}{space 3}     0.24{col 45}{space 2}   0.8858
{col 1}{text}{hline 20}{c BT}{hline 11}{hline 12}{hline 11}
{res}
{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 21}{c |}{col 33} Delta-method
{col 21}{c |}   Contrast{col 33}   std. err.{col 45}     [95% con{col 58}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}ever_mal@africa {c |}
(PM vs NPM) Africa  {c |}{col 21}{res}{space 2}-.0153899{col 33}{space 2} .0314106{col 44}{space 5}-.0769535{col 58}{space 3} .0461737
{txt}{space 2}(PM vs NPM) Asia  {c |}{col 21}{res}{space 2}-.0072844{col 33}{space 2} .0149459{col 44}{space 5}-.0365779{col 58}{space 3} .0220091
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. marginsplot, recast(scatter) ///
>     title("Contrasts: PM vs NPM by Region", size(medium)) ///
>     ytitle("Difference in Predicted Probability (PM - NPM)") ///
>     xtitle("Region") ///
>     xlabel(0 "Africa" 1 "Asia", labsize(medsmall)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     yline(0, lcolor(red) lpattern(dash)) ///
>     note("Positive values indicate higher probability in PM group", size(small)) ///
>     plot1opts(msymbol(circle) mcolor(blue)) ///
>     ciopts(lcolor(blue))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:africa}{p_end}
{res}{txt}
{com}. gr save ./figures/africa_mal_contrasts, replace
{txt}{p 0 4 2}
(file {bf}
./figures/africa_mal_contrasts{rm}
not found)
{p_end}
{res}{txt}file {bf:./figures/africa_mal_contrasts} saved as .gph format

{com}. gr export ./figures/africa_mal_contrasts.png, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures/africa_mal_contrasts.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. * Calculate contrasts between Asia and Africa within each malnutrition status
. margins r.africa@ever_mal, atmeans
{res}
{txt}{col 1}Contrasts of adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:1,802}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(epi_binary), predict()}{p_end}
{p2colreset}{...}
{lalign 4:At: }{space 0}{lalign 10:1.bmi_cat} = {res:{ralign 8:.1870144}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:2.bmi_cat} = {res:{ralign 8:.5288568}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:3.bmi_cat} = {res:{ralign 8:.1875694}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:4.bmi_cat} = {res:{ralign 8:.0965594}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:0.hiv2} = {res:{ralign 8:.6104329}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:1.hiv2} = {res:{ralign 8:.3895671}} {txt:(mean)}
{lalign 4:}{space 0}{lalign 10:age} = {res:{ralign 8:42.43513}} {txt:(mean)}

{res}{col 1}{text}{hline 22}{c TT}{hline 11}{hline 12}{hline 11}
{col 23}{text}{c |}         df{col 35}        chi2{col 47}     P>chi2
{res}{col 1}{text}{hline 22}{c +}{hline 11}{hline 12}{hline 11}
{space 6}africa@ever_mal {c |}
(Asia vs Africa) NPM  {res}{col 23}{text}{c |}{result}{space 2}        1{col 35}{space 3}   188.93{col 47}{space 2}   0.0000
{txt}{space 1}(Asia vs Africa) PM  {res}{col 23}{text}{c |}{result}{space 2}        1{col 35}{space 3}   137.03{col 47}{space 2}   0.0000
{col 1}{text}               Joint {col 23}{c |}{result}{space 2}        2{col 35}{space 3}   190.27{col 47}{space 2}   0.0000
{col 1}{text}{hline 22}{c BT}{hline 11}{hline 12}{hline 11}
{res}
{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}{col 35} Delta-method
{col 23}{c |}   Contrast{col 35}   std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}africa@ever_mal {c |}
(Asia vs Africa) NPM  {c |}{col 23}{res}{space 2}-.3285111{col 35}{space 2} .0238998{col 46}{space 5}-.3753539{col 60}{space 3}-.2816683
{txt}{space 1}(Asia vs Africa) PM  {c |}{col 23}{res}{space 2}-.3204056{col 35}{space 2} .0273712{col 46}{space 5}-.3740521{col 60}{space 3}-.2667591
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. marginsplot, recast(scatter) ///
>     title("Contrasts: Asia vs Africa by Malnutrition Status", size(medium)) ///
>     ytitle("Difference in Predicted Probability (Asia - Africa)") ///
>     xtitle("Malnutrition Status") ///
>     xlabel(0 "NPM" 1 "PM", labsize(medsmall)) ///
>     graphregion(margin(vsmall)) ///
>     plotregion(margin(vlarge)) ///
>     yline(0, lcolor(red) lpattern(dash)) ///
>     note("Positive values indicate higher probability in Asia", size(small)) ///
>     plot1opts(msymbol(circle) mcolor(blue)) ///
>     ciopts(lcolor(blue))
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:ever_mal}{p_end}
{res}{txt}
{com}. gr save ./figures/africa_mal_contrasts2, replace
{txt}{p 0 4 2}
(file {bf}
./figures/africa_mal_contrasts2{rm}
not found)
{p_end}
{res}{txt}file {bf:./figures/africa_mal_contrasts2} saved as .gph format

{com}. gr export ./figures/africa_mal_contrasts2.png, as(png) replace
{txt}{p 0 4 2}
file {bf}
/Users/juansolon/Documents/GitHub/sampa-radio/figures/africa_mal_contrasts2.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. 
. table ()(ever_mal), statistic(frequency) ///
> statistic(p50 pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(iqr pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) 
{res}
{smcl}
{reset}{...}
{hline 79}{c -}{c TT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
{space 79} {c |}  {space 2}Ever experience malnutrition?{space 2}
{space 79} {c |}  {space 6}NPM   {space 7}PM   {space 4}Total
{hline 79}{c -}{c +}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
Frequency{space 70} {c |}  {space 4}{result:1,181}   {space 4}{result:1,097}   {space 4}{result:2,278}
50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 5}{result:2.09}   {space 5}{result:2.07}   {space 5}{result:2.08}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 6}{result:2.1}   {space 5}{result:1.82}   {space 5}{result:1.98}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:1.24}   {space 5}{result:1.23}   {space 5}{result:1.23}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 5}{result:1.23}   {space 5}{result:1.42}   {space 5}{result:1.33}
Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4899999}   {space 1}{result:.6100001}   {space 1}{result:.5600001}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.4899999}   {space 6}{result:.74}   {space 1}{result:.7199999}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.4299999}   {space 6}{result:.46}   {space 1}{result:.4400001}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:.52}   {space 5}{result:.575}   {space 1}{result:.5599999}
{hline 79}{c -}{c BT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}

{com}. 
{txt}end of do-file

{com}. tab subset

   {txt}Analysis {c |}
     Subset {c |}
 (With Fe-1 {c |}
    or USS) {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        154        6.76        6.76
{txt}          1 {c |}{res}      2,124       93.24      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,278      100.00

{com}. tab radio3

   {txt}USS Scans {c |}
  Visualized {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
          No {c |}{res}        655       28.75       28.75
{txt}         Yes {c |}{res}      1,623       71.25      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}      2,278      100.00

{com}. tab radio3 radio2

   {txt}USS Scans {c |}      Ultrasound
  Visualized {c |}        No        Yes {c |}     Total
{hline 13}{c +}{hline 22}{c +}{hline 10}
          No {c |}{res}       513        142 {txt}{c |}{res}       655 
{txt}         Yes {c |}{res}         0      1,623 {txt}{c |}{res}     1,623 
{txt}{hline 13}{c +}{hline 22}{c +}{hline 10}
       Total {c |}{res}       513      1,765 {txt}{c |}{res}     2,278 

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. 
. table ()(ever_mal) if radio3 ==1 , statistic(frequency) ///
> statistic(p50 pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(iqr pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) 
{res}
{smcl}
{reset}{...}
{hline 79}{c -}{c TT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
{space 79} {c |}  {space 2}Ever experience malnutrition?{space 2}
{space 79} {c |}  {space 6}NPM   {space 7}PM   {space 4}Total
{hline 79}{c -}{c +}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
Frequency{space 70} {c |}  {space 6}{result:752}   {space 6}{result:871}   {space 4}{result:1,623}
50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 5}{result:2.09}   {space 5}{result:2.07}   {space 5}{result:2.08}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 6}{result:2.1}   {space 5}{result:1.82}   {space 5}{result:1.98}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:1.24}   {space 5}{result:1.23}   {space 5}{result:1.23}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 5}{result:1.23}   {space 5}{result:1.42}   {space 5}{result:1.33}
Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4899999}   {space 1}{result:.6100001}   {space 1}{result:.5600001}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.4899999}   {space 6}{result:.74}   {space 1}{result:.7199999}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.4299999}   {space 6}{result:.46}   {space 1}{result:.4400001}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:.52}   {space 5}{result:.575}   {space 1}{result:.5599999}
{hline 79}{c -}{c BT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. table ()(ever_mal) if radio3 ==1 , statistic(frequency) ///
> statistic(p50 pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(iqr pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(mean pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(sd pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) 
{res}
{smcl}
{reset}{...}
{hline 79}{c -}{c TT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
{space 79} {c |}  {space 2}Ever experience malnutrition?{space 2}
{space 79} {c |}  {space 6}NPM   {space 7}PM   {space 4}Total
{hline 79}{c -}{c +}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
Frequency{space 70} {c |}  {space 6}{result:752}   {space 6}{result:871}   {space 4}{result:1,623}
50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 5}{result:2.09}   {space 5}{result:2.07}   {space 5}{result:2.08}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 6}{result:2.1}   {space 5}{result:1.82}   {space 5}{result:1.98}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:1.24}   {space 5}{result:1.23}   {space 5}{result:1.23}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 5}{result:1.23}   {space 5}{result:1.42}   {space 5}{result:1.33}
Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4899999}   {space 1}{result:.6100001}   {space 1}{result:.5600001}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.4899999}   {space 6}{result:.74}   {space 1}{result:.7199999}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.4299999}   {space 6}{result:.46}   {space 1}{result:.4400001}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:.52}   {space 5}{result:.575}   {space 1}{result:.5599999}
Mean{space 75} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:2.116951}   {space 1}{result:2.067712}   {space 1}{result:2.090367}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:2.086882}   {space 1}{result:1.840574}   {space 1}{result:1.952213}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:1.293732}   {space 1}{result:1.254601}   {space 1}{result:1.272708}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:1.360629}   {space 1}{result:1.466532}   {space 1}{result:1.421649}
Standard deviation{space 61} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4445615}   {space 1}{result:.5101254}   {space 2}{result:.481545}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 2}{result:.475776}   {space 1}{result:.5248397}   {space 1}{result:.5177571}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.3642824}   {space 1}{result:.3939063}   {space 1}{result:.3808686}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.3969301}   {space 1}{result:.4123721}   {space 1}{result:.4090961}
{hline 79}{c -}{c BT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dotplot pan_head_ap, over(ever_mal)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dotplot pan_head_ap, over(ever_mal), center median mean
{err}invalid 'center' 
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dotplot pan_head_ap, over(ever_mal) center median mean
{err}invalid syntax
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dotplot pan_head_ap, over(ever_mal) center median 
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. table ()(ever_mal) if radio3 ==1 , statistic(frequency) ///
> statistic(p50 pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(iqr pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(mean pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(sd pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) 
{res}
{smcl}
{reset}{...}
{hline 79}{c -}{c TT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
{space 79} {c |}  {space 2}Ever experience malnutrition?{space 2}
{space 79} {c |}  {space 6}NPM   {space 7}PM   {space 4}Total
{hline 79}{c -}{c +}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
Frequency{space 70} {c |}  {space 6}{result:752}   {space 6}{result:871}   {space 4}{result:1,623}
50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 5}{result:2.09}   {space 5}{result:2.07}   {space 5}{result:2.08}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 6}{result:2.1}   {space 5}{result:1.82}   {space 5}{result:1.98}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:1.24}   {space 5}{result:1.23}   {space 5}{result:1.23}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 5}{result:1.23}   {space 5}{result:1.42}   {space 5}{result:1.33}
Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4899999}   {space 1}{result:.6100001}   {space 1}{result:.5600001}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.4899999}   {space 6}{result:.74}   {space 1}{result:.7199999}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.4299999}   {space 6}{result:.46}   {space 1}{result:.4400001}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:.52}   {space 5}{result:.575}   {space 1}{result:.5599999}
Mean{space 75} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:2.116951}   {space 1}{result:2.067712}   {space 1}{result:2.090367}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:2.086882}   {space 1}{result:1.840574}   {space 1}{result:1.952213}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:1.293732}   {space 1}{result:1.254601}   {space 1}{result:1.272708}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:1.360629}   {space 1}{result:1.466532}   {space 1}{result:1.421649}
Standard deviation{space 61} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4445615}   {space 1}{result:.5101254}   {space 2}{result:.481545}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 2}{result:.475776}   {space 1}{result:.5248397}   {space 1}{result:.5177571}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.3642824}   {space 1}{result:.3939063}   {space 1}{result:.3808686}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.3969301}   {space 1}{result:.4123721}   {space 1}{result:.4090961}
{hline 79}{c -}{c BT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}

{com}. 
. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. table ()(ever_mal) , statistic(frequency) ///
> statistic(p50 pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(iqr pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(mean pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(sd pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) 
{res}
{smcl}
{reset}{...}
{hline 79}{c -}{c TT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
{space 79} {c |}  {space 2}Ever experience malnutrition?{space 2}
{space 79} {c |}  {space 6}NPM   {space 7}PM   {space 4}Total
{hline 79}{c -}{c +}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
Frequency{space 70} {c |}  {space 4}{result:1,181}   {space 4}{result:1,097}   {space 4}{result:2,278}
50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 5}{result:2.09}   {space 5}{result:2.07}   {space 5}{result:2.08}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 6}{result:2.1}   {space 5}{result:1.82}   {space 5}{result:1.98}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:1.24}   {space 5}{result:1.23}   {space 5}{result:1.23}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 5}{result:1.23}   {space 5}{result:1.42}   {space 5}{result:1.33}
Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4899999}   {space 1}{result:.6100001}   {space 1}{result:.5600001}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.4899999}   {space 6}{result:.74}   {space 1}{result:.7199999}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.4299999}   {space 6}{result:.46}   {space 1}{result:.4400001}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:.52}   {space 5}{result:.575}   {space 1}{result:.5599999}
Mean{space 75} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:2.116951}   {space 1}{result:2.067712}   {space 1}{result:2.090367}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:2.086882}   {space 1}{result:1.840574}   {space 1}{result:1.952213}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:1.293732}   {space 1}{result:1.254601}   {space 1}{result:1.272708}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:1.360629}   {space 1}{result:1.466532}   {space 1}{result:1.421649}
Standard deviation{space 61} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4445615}   {space 1}{result:.5101254}   {space 2}{result:.481545}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 2}{result:.475776}   {space 1}{result:.5248397}   {space 1}{result:.5177571}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.3642824}   {space 1}{result:.3939063}   {space 1}{result:.3808686}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.3969301}   {space 1}{result:.4123721}   {space 1}{result:.4090961}
{hline 79}{c -}{c BT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. table (pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans), statistic(frequency)
{res}{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. missings report pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans

{p 0 4}{txt}Checking missings in {res} pan_head_ap pan_head_trans pan_body_trans pan_tail_trans:{txt}{p_end}
1273 observations with missing values

{res}{col 1}{text}{hline 16}{c TT}{hline 8}
{col 1}{text}               {col 17}{c |}      #
{res}{col 1}{text}{hline 16}{c +}{hline 8}
{res}{col 1}{text}    pan_head_ap{col 17}{c |}    724
{res}{col 1}{text} pan_head_trans{col 17}{c |}    877
{res}{col 1}{text} pan_body_trans{col 17}{c |}    668
{res}{col 1}{text} pan_tail_trans{col 17}{c |}   1077
{res}{col 1}{text}{hline 16}{c BT}{hline 8}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. count if pan_head_ap !=.
  {res}1,554

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. table ()(ever_mal) if radio3 ==1 , statistic(frequency) ///
> statistic(p50 pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(iqr pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(mean pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(sd pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) 
{res}
{smcl}
{reset}{...}
{hline 79}{c -}{c TT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
{space 79} {c |}  {space 2}Ever experience malnutrition?{space 2}
{space 79} {c |}  {space 6}NPM   {space 7}PM   {space 4}Total
{hline 79}{c -}{c +}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
Frequency{space 70} {c |}  {space 6}{result:752}   {space 6}{result:871}   {space 4}{result:1,623}
50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 5}{result:2.09}   {space 5}{result:2.07}   {space 5}{result:2.08}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 6}{result:2.1}   {space 5}{result:1.82}   {space 5}{result:1.98}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:1.24}   {space 5}{result:1.23}   {space 5}{result:1.23}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 5}{result:1.23}   {space 5}{result:1.42}   {space 5}{result:1.33}
Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4899999}   {space 1}{result:.6100001}   {space 1}{result:.5600001}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.4899999}   {space 6}{result:.74}   {space 1}{result:.7199999}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.4299999}   {space 6}{result:.46}   {space 1}{result:.4400001}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:.52}   {space 5}{result:.575}   {space 1}{result:.5599999}
Mean{space 75} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:2.116951}   {space 1}{result:2.067712}   {space 1}{result:2.090367}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:2.086882}   {space 1}{result:1.840574}   {space 1}{result:1.952213}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:1.293732}   {space 1}{result:1.254601}   {space 1}{result:1.272708}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:1.360629}   {space 1}{result:1.466532}   {space 1}{result:1.421649}
Standard deviation{space 61} {c |}  {space 9}   {space 9}   {space 9}
  Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4445615}   {space 1}{result:.5101254}   {space 2}{result:.481545}
  Pancreas head size measured in transverse dimension{space 26} {c |}  {space 2}{result:.475776}   {space 1}{result:.5248397}   {space 1}{result:.5177571}
  Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.3642824}   {space 1}{result:.3939063}   {space 1}{result:.3808686}
  Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.3969301}   {space 1}{result:.4123721}   {space 1}{result:.4090961}
{hline 79}{c -}{c BT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}

{com}. 
{txt}end of do-file

{com}. help dtable

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dtable  pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans, by(ever_mal)
{res}
{smcl}
{reset}{...}
{hline 77}{c -}{hline 13}{c -}{hline 13}{c -}{hline 14}
{space 77} {space 7}Ever experience malnutrition?{space 6}
{space 77} {space 5}NPM{space 5} {space 6}PM{space 5} {space 5}Total{space 4}
{hline 77}{c -}{hline 13}{c -}{hline 13}{c -}{hline 14}
N{space 76} {result:1,181 (51.8%)} {result:1,097 (48.2%)} {result:2,278 (100.0%)}
Pancreas head size measured in anterior/posterior dimension{space 18} {result:2.117 (0.445)} {result:2.068 (0.510)} {space 1}{result:2.090 (0.482)}
Pancreas head size measured in transverse dimension{space 26} {result:2.087 (0.476)} {result:1.841 (0.525)} {space 1}{result:1.952 (0.518)}
Pancreas body size measures in anterior/posterior dimension; maximum diameter {result:1.294 (0.364)} {result:1.255 (0.394)} {space 1}{result:1.273 (0.381)}
Pancreas tail size measure in anterior/posterior dimension{space 19} {result:1.361 (0.397)} {result:1.467 (0.412)} {space 1}{result:1.422 (0.409)}
{hline 77}{c -}{hline 13}{c -}{hline 13}{c -}{hline 14}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. 
. dtable  pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans, ///
>                 by(ever_mal) ///
>                 continuous(pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans, statistic(p50 iqr)) 
{res}
{smcl}
{reset}{...}
{hline 77}{c -}{hline 13}{c -}{hline 13}{c -}{hline 14}
{space 77} {space 7}Ever experience malnutrition?{space 6}
{space 77} {space 5}NPM{space 5} {space 6}PM{space 5} {space 5}Total{space 4}
{hline 77}{c -}{hline 13}{c -}{hline 13}{c -}{hline 14}
N{space 76} {result:1,181 (51.8%)} {result:1,097 (48.2%)} {result:2,278 (100.0%)}
Pancreas head size measured in anterior/posterior dimension{space 18} {space 2}{result:2.090 0.490} {space 2}{result:2.070 0.610} {space 3}{result:2.080 0.560}
Pancreas head size measured in transverse dimension{space 26} {space 2}{result:2.100 0.490} {space 2}{result:1.820 0.740} {space 3}{result:1.980 0.720}
Pancreas body size measures in anterior/posterior dimension; maximum diameter {space 2}{result:1.240 0.430} {space 2}{result:1.230 0.460} {space 3}{result:1.230 0.440}
Pancreas tail size measure in anterior/posterior dimension{space 19} {space 2}{result:1.230 0.520} {space 2}{result:1.420 0.575} {space 3}{result:1.330 0.560}
{hline 77}{c -}{hline 13}{c -}{hline 13}{c -}{hline 14}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dtable  pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans if radio3==1, ///
>                 by(ever_mal) ///
>                 continuous(pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans, statistic(p50 iqr)) 
{res}
{smcl}
{reset}{...}
{hline 77}{c -}{hline 11}{c -}{hline 11}{c -}{hline 14}
{space 77} {space 5}Ever experience malnutrition?{space 4}
{space 77} {space 4}NPM{space 4} {space 5}PM{space 4} {space 5}Total{space 4}
{hline 77}{c -}{hline 11}{c -}{hline 11}{c -}{hline 14}
N{space 76} {result:752 (46.3%)} {result:871 (53.7%)} {result:1,623 (100.0%)}
Pancreas head size measured in anterior/posterior dimension{space 18} {result:2.090 0.490} {result:2.070 0.610} {space 3}{result:2.080 0.560}
Pancreas head size measured in transverse dimension{space 26} {result:2.100 0.490} {result:1.820 0.740} {space 3}{result:1.980 0.720}
Pancreas body size measures in anterior/posterior dimension; maximum diameter {result:1.240 0.430} {result:1.230 0.460} {space 3}{result:1.230 0.440}
Pancreas tail size measure in anterior/posterior dimension{space 19} {result:1.230 0.520} {result:1.420 0.575} {space 3}{result:1.330 0.560}
{hline 77}{c -}{hline 11}{c -}{hline 11}{c -}{hline 14}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dtable  ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans if radio3==1, ///
>                 by(ever_mal) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans, statistic(p50 iqr)) 
{res}
{smcl}
{reset}{...}
{hline 77}{c -}{hline 11}{c -}{hline 11}{c -}{hline 14}
{space 77} {space 5}Ever experience malnutrition?{space 4}
{space 77} {space 4}NPM{space 4} {space 5}PM{space 4} {space 5}Total{space 4}
{hline 77}{c -}{hline 11}{c -}{hline 11}{c -}{hline 14}
N{space 76} {result:752 (46.3%)} {result:871 (53.7%)} {result:1,623 (100.0%)}
Pancreas head size measured in anterior/posterior dimension{space 18} {result:2.570 0.520} {result:2.470 0.640} {space 3}{result:2.530 0.600}
Pancreas head size measured in transverse dimension{space 26} {result:2.600 0.510} {result:2.630 0.590} {space 3}{result:2.620 0.555}
Pancreas body size measures in anterior/posterior dimension; maximum diameter {result:2.060 0.620} {result:2.080 0.700} {space 3}{result:2.080 0.670}
Pancreas tail size measure in anterior/posterior dimension{space 19} {result:1.760 0.530} {result:1.760 0.550} {space 3}{result:1.760 0.510}
{hline 77}{c -}{hline 11}{c -}{hline 11}{c -}{hline 14}

{com}. 
{txt}end of do-file

{com}. d ct_
{bf}{err}ct_{sf} ambiguous abbreviation
{txt}{search r(111), local:r(111);}

{com}. c dt_*
{err}command {bf}c{sf} is unrecognized
{txt}{search r(199), local:r(199);}

{com}. d ct_*

{txt}Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:ct_sample      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}ct_sample{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Are they in the CT scan subsample?{p_end}
{p 0 48}{bind:ct_scan        }{txt}{bind: byte    }{bind:%12.0g    }{space 1}{bind:ct_scan  }{bind:  }{res}{res}Was a CT scan performed?{p_end}
{p 0 48}{bind:ct_date        }{txt}{bind: str10   }{bind:%10s      }{space 1}{bind:         }{bind:  }{res}{res}Date of Examination{p_end}
{p 0 48}{bind:ct_time        }{txt}{bind: str8    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}Time of Examination{p_end}
{p 0 48}{bind:ct_pan_size_q~l}{txt}{bind: byte    }{bind:%29.0g    }{space 1}{txt}ct_pan_size_qual{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Qualitative indicator of pancreas size{p_end}
{p 0 48}{bind:ct_pan_head_t~s}{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Pancreas head size measured in transverse dimension{p_end}
{p 0 48}{bind:ct_pan_head_ap }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Pancreas head size measured in anterior/posterior dimension{p_end}
{p 0 48}{bind:ct_pan_body_t~s}{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Pancreas body size measures in anterior/posterior dimension; maximum diameter{p_end}
{p 0 48}{bind:ct_pan_tail_t~s}{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Pancreas tail size measure in anterior/posterior dimension{p_end}
{p 0 48}{bind:ct_pan_body_t~l}{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Length of Pancreas body and tail size measured in anterior/posterior dimension{p_end}
{p 0 48}{bind:ct_pan_cc_body }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Diameter of Pancreas body measured in Cranial-Caudal{p_end}
{p 0 48}{bind:ct_pan_cc_head }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Diameter of Pancreas head measured in Cranial-Caudal{p_end}
{p 0 48}{bind:ct_pan_shape   }{txt}{bind: byte    }{bind:%29.0g    }{space 1}{txt}ct_pan_shape{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Pancreas shape{p_end}
{p 0 48}{bind:ct_pan_shape_~m}{txt}{bind: byte    }{bind:%42.0g    }{space 1}{txt}ct_pan_shape_problem{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}For abnormal shape, specify the problem{p_end}
{p 0 48}{bind:ct_pan_shape_~c}{txt}{bind: str27   }{bind:%27s      }{space 1}{bind:         }{bind:  }{res}{res}Other shape abnormality, specify{p_end}
{p 0 48}{bind:ct_pan_contour }{txt}{bind: byte    }{bind:%29.0g    }{space 1}{txt}ct_pan_contour{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Pancreas contour{p_end}
{p 0 48}{bind:ct_pan_contou~m}{txt}{bind: byte    }{bind:%30.0g    }{space 1}{txt}ct_pan_contour_problem{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}For abnormal contour, specify the problem{p_end}
{p 0 48}{bind:ct_pan_contou~c}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Other contour problem, specify{p_end}
{p 0 48}{bind:ct_pan_parenc~a}{txt}{bind: byte    }{bind:%29.0g    }{space 1}{txt}ct_pan_parenchyma{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Pancreatic Parenchyma{p_end}
{p 0 48}{bind:ct_pan_paren_~m}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}ct_pan_paren_inflam{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Pancreas shows signs of inflammation of edema{p_end}
{p 0 48}{bind:ct_pan_pa~rosis}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}ct_pan_paren_fibrosis{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Pancreas shows signs of fibrosis{p_end}
{p 0 48}{bind:ct_pan_pa~tosis}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}ct_pan_paren_steatosis{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Pancreas shows signs of steatosis{p_end}
{p 0 48}{bind:ct_pan_duct    }{txt}{bind: byte    }{bind:%29.0g    }{space 1}{txt}ct_pan_duct{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Pancreas Duct{p_end}
{p 0 48}{bind:ct_pan_duct_s~s}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}ct_pan_duct_stones{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Stones detected in the duct{p_end}
{p 0 48}{bind:ct_pan_duct_m~s}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}ct_pan_duct_mass{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Mass detected in the duct{p_end}
{p 0 48}{bind:ct_pan_calci   }{txt}{bind: byte    }{bind:%29.0g    }{space 1}{txt}ct_pan_calci{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Calcifications{p_end}
{p 0 48}{bind:ct_pan_calci_~e}{txt}{bind: byte    }{bind:%12.0g    }{space 1}{txt}ct_pan_calci_place{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}If calcification is present, indicate where it is{p_end}
{p 0 48}{bind:ct_pan_oth_ab~l}{txt}{bind: byte    }{bind:%12.0g    }{space 1}{txt}ct_pan_oth_abnormal{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Any other abnormalities detected?{p_end}
{p 0 48}{bind:ct_pan_oth_ab~c}{txt}{bind: strL    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}Specify other abnormalities detected{p_end}
{p 0 48}{bind:ct_image_qual  }{txt}{bind: byte    }{bind:%11.0g    }{space 1}{txt}ct_image_qual{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Was the CT scan optimal for obtaining the required information?{p_end}
{p 0 48}{bind:ct_problem     }{txt}{bind: byte    }{bind:%25.0g    }{space 1}{txt}ct_problem{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Indicate why the CT scan not optimal{p_end}
{p 0 48}{bind:ct_problem_why }{txt}{bind: str26   }{bind:%26s      }{space 1}{bind:         }{bind:  }{res}{res}If non-optimal specify why{p_end}
{p 0 48}{bind:ct_pan_vol     }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Calculated Pancreatic Volume; Study{p_end}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dtable  ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail if radio3==1, ///
>                 by(ever_mal) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail, statistic(p50 iqr)) 
{res}
{smcl}
{reset}{...}
{hline 78}{c -}{hline 12}{c -}{hline 12}{c -}{hline 14}
{space 78} {space 6}Ever experience malnutrition?{space 5}
{space 78} {space 5}NPM{space 4} {space 5}PM{space 5} {space 5}Total{space 4}
{hline 78}{c -}{hline 12}{c -}{hline 12}{c -}{hline 14}
N{space 77} {space 1}{result:752 (46.3%)} {space 1}{result:871 (53.7%)} {result:1,623 (100.0%)}
Pancreas head size measured in anterior/posterior dimension{space 19} {space 1}{result:2.570 0.520} {space 1}{result:2.470 0.640} {space 3}{result:2.530 0.600}
Pancreas head size measured in transverse dimension{space 27} {space 1}{result:2.600 0.510} {space 1}{result:2.630 0.590} {space 3}{result:2.620 0.555}
Pancreas body size measures in anterior/posterior dimension; maximum diameter{space 1} {space 1}{result:2.060 0.620} {space 1}{result:2.080 0.700} {space 3}{result:2.080 0.670}
Pancreas tail size measure in anterior/posterior dimension{space 20} {space 1}{result:1.760 0.530} {space 1}{result:1.760 0.550} {space 3}{result:1.760 0.510}
Length of Pancreas body and tail size measured in anterior/posterior dimension {result:10.650 2.190} {result:10.000 1.780} {space 2}{result:10.310 1.920}
{hline 78}{c -}{hline 12}{c -}{hline 12}{c -}{hline 14}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dtable  ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail if radio3==1, ///
>                 by(ever_mal) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail, statistic(p50 iqr)) 
{res}
{smcl}
{reset}{...}
{hline 78}{c -}{hline 12}{c -}{hline 12}{c -}{hline 14}
{space 78} {space 6}Ever experience malnutrition?{space 5}
{space 78} {space 5}NPM{space 4} {space 5}PM{space 5} {space 5}Total{space 4}
{hline 78}{c -}{hline 12}{c -}{hline 12}{c -}{hline 14}
N{space 77} {space 1}{result:752 (46.3%)} {space 1}{result:871 (53.7%)} {result:1,623 (100.0%)}
Pancreas head size measured in anterior/posterior dimension{space 19} {space 1}{result:2.570 0.520} {space 1}{result:2.470 0.640} {space 3}{result:2.530 0.600}
Pancreas head size measured in transverse dimension{space 27} {space 1}{result:2.600 0.510} {space 1}{result:2.630 0.590} {space 3}{result:2.620 0.555}
Pancreas body size measures in anterior/posterior dimension; maximum diameter{space 1} {space 1}{result:2.060 0.620} {space 1}{result:2.080 0.700} {space 3}{result:2.080 0.670}
Pancreas tail size measure in anterior/posterior dimension{space 20} {space 1}{result:1.760 0.530} {space 1}{result:1.760 0.550} {space 3}{result:1.760 0.510}
Length of Pancreas body and tail size measured in anterior/posterior dimension {result:10.650 2.190} {result:10.000 1.780} {space 2}{result:10.310 1.920}
{hline 78}{c -}{hline 12}{c -}{hline 12}{c -}{hline 14}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dtable  ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail if radio3==1, ///
>                 by(ever_mal) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail, statistic(p50 iqr)) ///
>                 test(kwallis)
{res}{err}option {bf:test()} not allowed
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dtable  ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail if radio3==1, ///
>                 by(ever_mal) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail, statistic(p50 iqr)) ///
>                 tests(kwallis)
{res}{err}option {bf:tests()} not allowed
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}.                 
. dtable  ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail if radio3==1, ///
>                 by(ever_mal) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail, statistic(p50 iqr) tests(kwallis))
{res}{err}option {bf:tests()} not allowed
in option {bf:continuous()}
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dtable  ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail if radio3==1, ///
>                 by(ever_mal) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail, statistic(p50 iqr) test(kwallis))
{res}
{smcl}
{reset}{...}
{hline 78}{c -}{hline 12}{c -}{hline 12}{c -}{hline 14}
{space 78} {space 6}Ever experience malnutrition?{space 5}
{space 78} {space 5}NPM{space 4} {space 5}PM{space 5} {space 5}Total{space 4}
{hline 78}{c -}{hline 12}{c -}{hline 12}{c -}{hline 14}
N{space 77} {space 1}{result:752 (46.3%)} {space 1}{result:871 (53.7%)} {result:1,623 (100.0%)}
Pancreas head size measured in anterior/posterior dimension{space 19} {space 1}{result:2.570 0.520} {space 1}{result:2.470 0.640} {space 3}{result:2.530 0.600}
Pancreas head size measured in transverse dimension{space 27} {space 1}{result:2.600 0.510} {space 1}{result:2.630 0.590} {space 3}{result:2.620 0.555}
Pancreas body size measures in anterior/posterior dimension; maximum diameter{space 1} {space 1}{result:2.060 0.620} {space 1}{result:2.080 0.700} {space 3}{result:2.080 0.670}
Pancreas tail size measure in anterior/posterior dimension{space 20} {space 1}{result:1.760 0.530} {space 1}{result:1.760 0.550} {space 3}{result:1.760 0.510}
Length of Pancreas body and tail size measured in anterior/posterior dimension {result:10.650 2.190} {result:10.000 1.780} {space 2}{result:10.310 1.920}
{hline 78}{c -}{hline 12}{c -}{hline 12}{c -}{hline 14}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dtable  ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail if radio3==1, ///
>                 by(ever_mal) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail, statistic(p50 iqr) test(kwallis))
{res}
{smcl}
{reset}{...}
{hline 78}{c -}{hline 12}{c -}{hline 12}{c -}{hline 14}
{space 78} {space 6}Ever experience malnutrition?{space 5}
{space 78} {space 5}NPM{space 4} {space 5}PM{space 5} {space 5}Total{space 4}
{hline 78}{c -}{hline 12}{c -}{hline 12}{c -}{hline 14}
N{space 77} {space 1}{result:752 (46.3%)} {space 1}{result:871 (53.7%)} {result:1,623 (100.0%)}
Pancreas head size measured in anterior/posterior dimension{space 19} {space 1}{result:2.570 0.520} {space 1}{result:2.470 0.640} {space 3}{result:2.530 0.600}
Pancreas head size measured in transverse dimension{space 27} {space 1}{result:2.600 0.510} {space 1}{result:2.630 0.590} {space 3}{result:2.620 0.555}
Pancreas body size measures in anterior/posterior dimension; maximum diameter{space 1} {space 1}{result:2.060 0.620} {space 1}{result:2.080 0.700} {space 3}{result:2.080 0.670}
Pancreas tail size measure in anterior/posterior dimension{space 20} {space 1}{result:1.760 0.530} {space 1}{result:1.760 0.550} {space 3}{result:1.760 0.510}
Length of Pancreas body and tail size measured in anterior/posterior dimension {result:10.650 2.190} {result:10.000 1.780} {space 2}{result:10.310 1.920}
{hline 78}{c -}{hline 12}{c -}{hline 12}{c -}{hline 14}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}.                 
. dtable  ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail if radio3==1, ///
>                 by(ever_mal) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail, statistic(p50 iqr) test(kwallis)) ///
>                 nototals
{res}{err}option {bf:nototals} not allowed
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}.                 
. dtable  ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail if radio3==1, ///
>                 by(ever_mal, nototals) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail, statistic(p50 iqr) test(kwallis)) 
{res}
{smcl}
{reset}{...}
{hline 78}{c -}{hline 14}{c -}{hline 14}
{space 78} Ever experience malnutrition?
{space 78} {space 6}NPM{space 5} {space 6}PM{space 6}
{hline 78}{c -}{hline 14}{c -}{hline 14}
N{space 77} {space 3}{result:752 (46.3%)} {space 3}{result:871 (53.7%)}
Pancreas head size measured in anterior/posterior dimension{space 19} {space 3}{result:2.570 0.520} {space 3}{result:2.470 0.640}
Pancreas head size measured in transverse dimension{space 27} {space 3}{result:2.600 0.510} {space 3}{result:2.630 0.590}
Pancreas body size measures in anterior/posterior dimension; maximum diameter{space 1} {space 3}{result:2.060 0.620} {space 3}{result:2.080 0.700}
Pancreas tail size measure in anterior/posterior dimension{space 20} {space 3}{result:1.760 0.530} {space 3}{result:1.760 0.550}
Length of Pancreas body and tail size measured in anterior/posterior dimension {space 2}{result:10.650 2.190} {space 2}{result:10.000 1.780}
{hline 78}{c -}{hline 14}{c -}{hline 14}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         kwallis `var' ,by(ever_mal)
{txt}  3{com}. {c )-}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 11}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res} Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 11}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}715 {txt}{c |} {res}567515.50 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}839 {txt}{c |} {res}640719.50 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 11}{c BRC}

  chi2(1) = {res}{ralign 6:1.732}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.1882}

{txt}  chi2(1) with ties = {res}{ralign 6:1.732}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.1881}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 11}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res} Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 11}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}635 {txt}{c |} {res}516196.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}766 {txt}{c |} {res}465905.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 11}{c BRC}

  chi2(1) = {res}{ralign 6:88.858}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0001}

{txt}  chi2(1) with ties = {res}{ralign 6:88.862}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0001}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 11}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res} Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 11}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}745 {txt}{c |} {res}616048.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}865 {txt}{c |} {res}680807.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 11}{c BRC}

  chi2(1) = {res}{ralign 6:2.941}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0864}

{txt}  chi2(1) with ties = {res}{ralign 6:2.942}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0863}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 11}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res} Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 11}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}509 {txt}{c |} {res}274082.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}692 {txt}{c |} {res}447719.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 11}{c BRC}

  chi2(1) = {res}{ralign 6:28.711}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0001}

{txt}  chi2(1) with ties = {res}{ralign 6:28.717}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0001}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         kwallis `var' ,by(ever_mal)
{txt}  3{com}. {c )-}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 11}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res} Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 11}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}635 {txt}{c |} {res}516196.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}766 {txt}{c |} {res}465905.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 11}{c BRC}

  chi2(1) = {res}{ralign 6:88.858}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0001}

{txt}  chi2(1) with ties = {res}{ralign 6:88.862}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0001}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 11}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res} Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 11}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}715 {txt}{c |} {res}567515.50 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}839 {txt}{c |} {res}640719.50 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 11}{c BRC}

  chi2(1) = {res}{ralign 6:1.732}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.1882}

{txt}  chi2(1) with ties = {res}{ralign 6:1.732}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.1881}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 11}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res} Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 11}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}745 {txt}{c |} {res}616048.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}865 {txt}{c |} {res}680807.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 11}{c BRC}

  chi2(1) = {res}{ralign 6:2.941}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0864}

{txt}  chi2(1) with ties = {res}{ralign 6:2.942}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0863}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 11}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res} Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 11}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}509 {txt}{c |} {res}274082.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}692 {txt}{c |} {res}447719.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 11}{c BRC}

  chi2(1) = {res}{ralign 6:28.711}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0001}

{txt}  chi2(1) with ties = {res}{ralign 6:28.717}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0001}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dtable  pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans if radio3==1, ///
>                 by(ever_mal) ///
>                 continuous(pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans, statistic(p50 iqr)) 
{res}
{smcl}
{reset}{...}
{hline 77}{c -}{hline 11}{c -}{hline 11}{c -}{hline 14}
{space 77} {space 5}Ever experience malnutrition?{space 4}
{space 77} {space 4}NPM{space 4} {space 5}PM{space 4} {space 5}Total{space 4}
{hline 77}{c -}{hline 11}{c -}{hline 11}{c -}{hline 14}
N{space 76} {result:752 (46.3%)} {result:871 (53.7%)} {result:1,623 (100.0%)}
Pancreas head size measured in transverse dimension{space 26} {result:2.100 0.490} {result:1.820 0.740} {space 3}{result:1.980 0.720}
Pancreas head size measured in anterior/posterior dimension{space 18} {result:2.090 0.490} {result:2.070 0.610} {space 3}{result:2.080 0.560}
Pancreas body size measures in anterior/posterior dimension; maximum diameter {result:1.240 0.430} {result:1.230 0.460} {space 3}{result:1.230 0.440}
Pancreas tail size measure in anterior/posterior dimension{space 19} {result:1.230 0.520} {result:1.420 0.575} {space 3}{result:1.330 0.560}
{hline 77}{c -}{hline 11}{c -}{hline 11}{c -}{hline 14}

{com}.                 
.                 
. dtable  ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail if radio3==1, ///
>                 by(ever_mal, nototals) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail, statistic(p50 iqr) test(kwallis)) 
{res}
{smcl}
{reset}{...}
{hline 78}{c -}{hline 14}{c -}{hline 14}
{space 78} Ever experience malnutrition?
{space 78} {space 6}NPM{space 5} {space 6}PM{space 6}
{hline 78}{c -}{hline 14}{c -}{hline 14}
N{space 77} {space 3}{result:752 (46.3%)} {space 3}{result:871 (53.7%)}
Pancreas head size measured in transverse dimension{space 27} {space 3}{result:2.600 0.510} {space 3}{result:2.630 0.590}
Pancreas head size measured in anterior/posterior dimension{space 19} {space 3}{result:2.570 0.520} {space 3}{result:2.470 0.640}
Pancreas body size measures in anterior/posterior dimension; maximum diameter{space 1} {space 3}{result:2.060 0.620} {space 3}{result:2.080 0.700}
Pancreas tail size measure in anterior/posterior dimension{space 20} {space 3}{result:1.760 0.530} {space 3}{result:1.760 0.550}
Length of Pancreas body and tail size measured in anterior/posterior dimension {space 2}{result:10.650 2.190} {space 2}{result:10.000 1.780}
{hline 78}{c -}{hline 14}{c -}{hline 14}

{com}. 
. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         kwallis `var' ,by(ever_mal)
{txt}  3{com}. {c )-}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 11}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res} Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 11}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}635 {txt}{c |} {res}516196.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}766 {txt}{c |} {res}465905.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 11}{c BRC}

  chi2(1) = {res}{ralign 6:88.858}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0001}

{txt}  chi2(1) with ties = {res}{ralign 6:88.862}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0001}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 11}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res} Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 11}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}715 {txt}{c |} {res}567515.50 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}839 {txt}{c |} {res}640719.50 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 11}{c BRC}

  chi2(1) = {res}{ralign 6:1.732}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.1882}

{txt}  chi2(1) with ties = {res}{ralign 6:1.732}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.1881}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 11}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res} Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 11}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}745 {txt}{c |} {res}616048.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}865 {txt}{c |} {res}680807.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 11}{c BRC}

  chi2(1) = {res}{ralign 6:2.941}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0864}

{txt}  chi2(1) with ties = {res}{ralign 6:2.942}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0863}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 11}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res} Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 11}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}509 {txt}{c |} {res}274082.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}692 {txt}{c |} {res}447719.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 11}{c BRC}

  chi2(1) = {res}{ralign 6:28.711}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0001}

{txt}  chi2(1) with ties = {res}{ralign 6:28.717}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0001}
{txt}
{com}. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail {c -(}
{txt}  2{com}.         kwallis `var' ,by(ever_mal)
{txt}  3{com}. {c )-}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}167 {txt}{c |} {res}27312.50 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}157 {txt}{c |} {res}25337.50 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:0.043}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.8356}

{txt}  chi2(1) with ties = {res}{ralign 6:0.043}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.8356}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}168 {txt}{c |} {res}28731.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}159 {txt}{c |} {res}24897.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:1.904}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.1677}

{txt}  chi2(1) with ties = {res}{ralign 6:1.904}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.1676}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}167 {txt}{c |} {res}26213.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}159 {txt}{c |} {res}27088.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:1.646}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.1994}

{txt}  chi2(1) with ties = {res}{ralign 6:1.647}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.1994}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}168 {txt}{c |} {res}26790.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}157 {txt}{c |} {res}26185.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:0.492}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.4828}

{txt}  chi2(1) with ties = {res}{ralign 6:0.493}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.4828}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}121 {txt}{c |} {res}16852.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}130 {txt}{c |} {res}14774.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:7.808}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0052}

{txt}  chi2(1) with ties = {res}{ralign 6:7.808}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0052}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ctvol {c -(}
{txt}  2{com}.         kwallis `var' ,by(ever_mal)
{txt}  3{com}. {c )-}
{err}variable {bf}ctvol{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_vol {c -(}
{txt}  2{com}.         kwallis `var' ,by(ever_mal)
{txt}  3{com}. {c )-}
{err}variable {bf}ct_vol{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. dtable  ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail if ct2==1, ///
>                 by(ever_mal, nototals) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail, statistic(p50 iqr) test(kwallis)) 
{res}
{smcl}
{reset}{...}
{hline 78}{c -}{hline 15}{c -}{hline 13}
{space 78} Ever experience malnutrition?
{space 78} {space 6}NPM{space 6} {space 6}PM{space 5}
{hline 78}{c -}{hline 15}{c -}{hline 13}
N{space 77} {space 4}{result:168 (51.1%)} {space 2}{result:161 (48.9%)}
Pancreas head size measured in transverse dimension{space 27} {space 4}{result:2.640 0.530} {space 2}{result:2.660 0.640}
Pancreas head size measured in anterior/posterior dimension{space 19} {space 4}{result:2.580 0.525} {space 2}{result:2.500 0.600}
Pancreas body size measures in anterior/posterior dimension; maximum diameter{space 1} {space 4}{result:2.080 0.630} {space 2}{result:2.110 0.690}
Pancreas tail size measure in anterior/posterior dimension{space 20} {space 4}{result:1.765 0.550} {space 2}{result:1.770 0.590}
Length of Pancreas body and tail size measured in anterior/posterior dimension {space 3}{result:10.440 2.070} {space 2}{result:9.855 1.890}
{hline 78}{c -}{hline 15}{c -}{hline 13}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. table (cohort)(ever_mal) if radio3 ==1 , statistic(frequency) ///
> statistic(p50 pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(iqr pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(mean pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) ///
> statistic(sd pan_head_ap pan_head_trans pan_body_trans  pan_tail_trans) 
{res}
{smcl}
{reset}{...}
{hline 83}{c -}{c TT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
{space 83} {c |}  {space 2}Ever experience malnutrition?{space 2}
{space 83} {c |}  {space 6}NPM   {space 7}PM   {space 4}Total
{hline 83}{c -}{c +}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}
Cohort{space 77} {c |}  {space 9}   {space 9}   {space 9}
  DIVIDS{space 75} {c |}  {space 9}   {space 9}   {space 9}
    Frequency{space 70} {c |}  {space 7}{result:54}   {space 6}{result:251}   {space 6}{result:305}
    50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 5}{result:1.97}   {space 5}{result:2.06}   {space 5}{result:2.03}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 4}{result:1.515}   {space 5}{result:1.58}   {space 5}{result:1.57}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:1.29}   {space 6}{result:1.3}   {space 6}{result:1.3}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:1.4}   {space 5}{result:1.45}   {space 5}{result:1.45}
    Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.3300002}   {space 1}{result:.4299999}   {space 6}{result:.42}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.5650001}   {space 1}{result:.4300001}   {space 6}{result:.45}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.3299999}   {space 6}{result:.39}   {space 6}{result:.38}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:.45}   {space 6}{result:.37}   {space 6}{result:.38}
    Mean{space 75} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:1.961667}   {space 1}{result:2.049203}   {space 1}{result:2.033705}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:1.561923}   {space 1}{result:1.609129}   {space 1}{result:1.600751}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:1.271667}   {space 1}{result:1.341004}   {space 1}{result:1.328647}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:1.426038}   {space 2}{result:1.47418}   {space 1}{result:1.465589}
    Standard deviation{space 61} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.2644806}   {space 1}{result:.3275389}   {space 1}{result:.3186542}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.3454809}   {space 1}{result:.3436284}   {space 1}{result:.3438393}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.2614528}   {space 2}{result:.287697}   {space 1}{result:.2840293}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.3397869}   {space 1}{result:.3179263}   {space 1}{result:.3218733}
  SAM{space 78} {c |}  {space 9}   {space 9}   {space 9}
    Frequency{space 70} {c |}  {space 7}{result:36}   {space 7}{result:46}   {space 7}{result:82}
    50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 5}{result:2.11}   {space 5}{result:1.94}   {space 4}{result:2.065}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 5}{result:1.71}   {space 4}{result:1.585}   {space 4}{result:1.615}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:1.29}   {space 5}{result:1.23}   {space 5}{result:1.25}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 5}{result:1.73}   {space 5}{result:1.44}   {space 5}{result:1.49}
    Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4749999}   {space 1}{result:.4299999}   {space 1}{result:.4699999}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.7450001}   {space 6}{result:.61}   {space 6}{result:.64}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 6}{result:.61}   {space 6}{result:.38}   {space 6}{result:.45}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.6700001}   {space 6}{result:.55}   {space 6}{result:.62}
    Mean{space 75} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:2.115556}   {space 1}{result:2.036522}   {space 2}{result:2.07122}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 4}{result:1.795}   {space 1}{result:1.658478}   {space 1}{result:1.718415}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:1.301944}   {space 1}{result:1.255217}   {space 1}{result:1.275732}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:1.665429}   {space 1}{result:1.545778}   {space 1}{result:1.598125}
    Standard deviation{space 61} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 2}{result:.341086}   {space 1}{result:.3497696}   {space 2}{result:.346112}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.5119347}   {space 1}{result:.4279718}   {space 1}{result:.4686636}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.3987826}   {space 1}{result:.3352594}   {space 1}{result:.3629101}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.3971912}   {space 1}{result:.3974778}   {space 1}{result:.3993225}
  CICADA{space 75} {c |}  {space 9}   {space 9}   {space 9}
    Frequency{space 70} {c |}  {space 6}{result:242}   {space 6}{result:174}   {space 6}{result:416}
    50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 5}{result:2.25}   {space 4}{result:2.235}   {space 5}{result:2.25}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 4}{result:2.255}   {space 5}{result:2.23}   {space 5}{result:2.24}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:1.46}   {space 5}{result:1.39}   {space 5}{result:1.43}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:.98}   {space 5}{result:1.09}   {space 5}{result:1.02}
    Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.6099999}   {space 6}{result:.54}   {space 1}{result:.5899999}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 6}{result:.55}   {space 6}{result:.55}   {space 6}{result:.54}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:.535}   {space 7}{result:.5}   {space 6}{result:.51}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:.21}   {space 6}{result:.16}   {space 7}{result:.2}
    Mean{space 75} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:2.307073}   {space 1}{result:2.247817}   {space 1}{result:2.282824}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:2.294167}   {space 2}{result:2.23241}   {space 1}{result:2.268147}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:1.467797}   {space 2}{result:1.39117}   {space 1}{result:1.435602}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 3}{result:.99375}   {space 1}{result:1.033333}   {space 1}{result:1.014706}
    Standard deviation{space 61} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4475853}   {space 1}{result:.4274435}   {space 1}{result:.4397984}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.4349821}   {space 1}{result:.4239271}   {space 1}{result:.4308987}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.3801179}   {space 1}{result:.3695479}   {space 1}{result:.3771602}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.1460858}   {space 1}{result:.2757263}   {space 1}{result:.2185497}
  NUSTART{space 74} {c |}  {space 9}   {space 9}   {space 9}
    Frequency{space 70} {c |}  {space 7}{result:85}   {space 6}{result:185}   {space 6}{result:270}
    50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 5}{result:2.46}   {space 5}{result:2.52}   {space 4}{result:2.495}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 4}{result:2.075}   {space 5}{result:1.89}   {space 5}{result:1.97}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:1.47}   {space 5}{result:1.31}   {space 4}{result:1.355}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 4}{result:1.585}   {space 5}{result:1.71}   {space 5}{result:1.63}
    Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.5699999}   {space 6}{result:.53}   {space 1}{result:.5799999}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 5}{result:.645}   {space 1}{result:.8800001}   {space 6}{result:.84}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:.515}   {space 6}{result:.52}   {space 1}{result:.5549999}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.5699999}   {space 6}{result:.64}   {space 1}{result:.6799999}
    Mean{space 75} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:2.459059}   {space 1}{result:2.475459}   {space 1}{result:2.470296}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 2}{result:2.15119}   {space 1}{result:1.981093}   {space 1}{result:2.034607}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:1.457262}   {space 1}{result:1.365217}   {space 1}{result:1.394067}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:1.644146}   {space 1}{result:1.711285}   {space 1}{result:1.690192}
    Standard deviation{space 61} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.3828173}   {space 1}{result:.4527716}   {space 1}{result:.4313297}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.5203692}   {space 1}{result:.5713171}   {space 1}{result:.5604316}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.3809732}   {space 1}{result:.3942926}   {space 1}{result:.3917963}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.4488943}   {space 1}{result:.4445071}   {space 1}{result:.4461196}
  STATT{space 76} {c |}  {space 9}   {space 9}   {space 9}
    Frequency{space 70} {c |}  {space 6}{result:149}   {space 6}{result:111}   {space 6}{result:260}
    50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 8}{result:2}   {space 6}{result:1.6}   {space 6}{result:1.8}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 5}{result:1.82}   {space 5}{result:1.08}   {space 4}{result:1.175}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:1.03}   {space 6}{result:.95}   {space 4}{result:1.005}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:1.4}   {space 6}{result:1.4}   {space 6}{result:1.4}
    Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 7}{result:.6}   {space 6}{result:.71}   {space 1}{result:.6999999}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.9599999}   {space 6}{result:.87}   {space 6}{result:.96}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.3000001}   {space 6}{result:.35}   {space 5}{result:.315}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:.62}   {space 7}{result:.5}   {space 6}{result:.61}
    Mean{space 75} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:1.858456}   {space 2}{result:1.63973}   {space 1}{result:1.765077}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:1.590612}   {space 5}{result:1.37}   {space 1}{result:1.512237}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:1.037047}   {space 1}{result:.8971171}   {space 1}{result:.9773077}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:1.444828}   {space 1}{result:1.393694}   {space 1}{result:1.422656}
    Standard deviation{space 61} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4703402}   {space 1}{result:.4460992}   {space 1}{result:.4718905}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.4933491}   {space 1}{result:.4537875}   {space 1}{result:.4883185}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.3584303}   {space 1}{result:.3380812}   {space 1}{result:.3560417}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.4131587}   {space 1}{result:.4025101}   {space 2}{result:.408569}
  CLHNS{space 76} {c |}  {space 9}   {space 9}   {space 9}
    Frequency{space 70} {c |}  {space 6}{result:186}   {space 6}{result:104}   {space 6}{result:290}
    50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 8}{result:2}   {space 4}{result:1.755}   {space 5}{result:1.93}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 4}{result:2.115}   {space 5}{result:1.85}   {space 5}{result:2.07}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 4}{result:1.195}   {space 5}{result:1.06}   {space 5}{result:1.16}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:1.1}   {space 5}{result:1.05}   {space 5}{result:1.07}
    Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.2800001}   {space 6}{result:.92}   {space 1}{result:.3899999}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.3099999}   {space 5}{result:1.08}   {space 6}{result:.39}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.1999999}   {space 7}{result:.2}   {space 6}{result:.22}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:.15}   {space 6}{result:.11}   {space 6}{result:.15}
    Mean{space 75} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:2.003495}   {space 1}{result:1.611731}   {space 4}{result:1.863}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:2.137742}   {space 1}{result:1.705631}   {space 1}{result:1.983737}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:1.209462}   {space 2}{result:1.00875}   {space 1}{result:1.137483}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:1.109785}   {space 1}{result:1.108269}   {space 1}{result:1.109241}
    Standard deviation{space 61} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.2977649}   {space 1}{result:.4717525}   {space 1}{result:.4141239}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.2444569}   {space 2}{result:.527117}   {space 1}{result:.4239946}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.1463418}   {space 1}{result:.3998172}   {space 1}{result:.2828064}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.1421722}   {space 2}{result:.236181}   {space 1}{result:.1811634}
  Total{space 76} {c |}  {space 9}   {space 9}   {space 9}
    Frequency{space 70} {c |}  {space 6}{result:752}   {space 6}{result:871}   {space 4}{result:1,623}
    50th percentile{space 64} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 5}{result:2.09}   {space 5}{result:2.07}   {space 5}{result:2.08}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 6}{result:2.1}   {space 5}{result:1.82}   {space 5}{result:1.98}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 5}{result:1.24}   {space 5}{result:1.23}   {space 5}{result:1.23}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 5}{result:1.23}   {space 5}{result:1.42}   {space 5}{result:1.33}
    Interquartile range{space 60} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4899999}   {space 1}{result:.6100001}   {space 1}{result:.5600001}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:.4899999}   {space 6}{result:.74}   {space 1}{result:.7199999}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.4299999}   {space 6}{result:.46}   {space 1}{result:.4400001}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 6}{result:.52}   {space 5}{result:.575}   {space 1}{result:.5599999}
    Mean{space 75} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:2.116951}   {space 1}{result:2.067712}   {space 1}{result:2.090367}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 1}{result:2.086882}   {space 1}{result:1.840574}   {space 1}{result:1.952213}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:1.293732}   {space 1}{result:1.254601}   {space 1}{result:1.272708}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:1.360629}   {space 1}{result:1.466532}   {space 1}{result:1.421649}
    Standard deviation{space 61} {c |}  {space 9}   {space 9}   {space 9}
      Pancreas head size measured in anterior/posterior dimension{space 18} {c |}  {space 1}{result:.4445615}   {space 1}{result:.5101254}   {space 2}{result:.481545}
      Pancreas head size measured in transverse dimension{space 26} {c |}  {space 2}{result:.475776}   {space 1}{result:.5248397}   {space 1}{result:.5177571}
      Pancreas body size measures in anterior/posterior dimension; maximum diameter {c |}  {space 1}{result:.3642824}   {space 1}{result:.3939063}   {space 1}{result:.3808686}
      Pancreas tail size measure in anterior/posterior dimension{space 19} {c |}  {space 1}{result:.3969301}   {space 1}{result:.4123721}   {space 1}{result:.4090961}
{hline 83}{c -}{c BT}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}{c -}{c -}{c -}{hline 9}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         kwallis `var' if cohort==1 ,by(ever_mal)
{txt}  3{com}. {c )-}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 52 {txt}{c |} {res} 7028.50 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}241 {txt}{c |} {res}36042.50 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:1.234}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.2667}

{txt}  chi2(1) with ties = {res}{ralign 6:1.234}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.2666}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 54 {txt}{c |} {res} 6966.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}251 {txt}{c |} {res}39699.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:4.860}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0275}

{txt}  chi2(1) with ties = {res}{ralign 6:4.861}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0275}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 54 {txt}{c |} {res} 7464.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}249 {txt}{c |} {res}38592.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:1.625}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.2024}

{txt}  chi2(1) with ties = {res}{ralign 6:1.625}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.2023}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 53 {txt}{c |} {res} 7366.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}244 {txt}{c |} {res}36887.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:0.878}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.3488}

{txt}  chi2(1) with ties = {res}{ralign 6:0.878}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.3487}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         kwallis `var' if cohort==2 ,by(ever_mal)
{txt}  3{com}. {c )-}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 36 {txt}{c |} {res} 1585.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res} 46 {txt}{c |} {res} 1818.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:0.723}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.3952}

{txt}  chi2(1) with ties = {res}{ralign 6:0.723}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.3951}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 36 {txt}{c |} {res} 1610.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res} 46 {txt}{c |} {res} 1793.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:1.175}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.2784}

{txt}  chi2(1) with ties = {res}{ralign 6:1.175}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.2783}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 36 {txt}{c |} {res} 1563.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res} 46 {txt}{c |} {res} 1840.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:0.416}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.5191}

{txt}  chi2(1) with ties = {res}{ralign 6:0.416}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.5190}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 35 {txt}{c |} {res} 1550.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res} 45 {txt}{c |} {res} 1690.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:1.651}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.1988}

{txt}  chi2(1) with ties = {res}{ralign 6:1.652}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.1987}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         kwallis `var' if cohort==3 ,by(ever_mal)
{txt}  3{com}. {c )-}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}228 {txt}{c |} {res}46364.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}166 {txt}{c |} {res}31451.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:1.428}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.2320}

{txt}  chi2(1) with ties = {res}{ralign 6:1.429}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.2320}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}205 {txt}{c |} {res}36757.50 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}142 {txt}{c |} {res}23620.50 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:1.401}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.2366}

{txt}  chi2(1) with ties = {res}{ralign 6:1.401}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.2365}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}236 {txt}{c |} {res}50281.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}171 {txt}{c |} {res}32747.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:3.328}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0681}

{txt}  chi2(1) with ties = {res}{ralign 6:3.329}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0681}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}  8 {txt}{c |} {res}   63.50 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}  9 {txt}{c |} {res}   89.50 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:0.669}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.4134}

{txt}  chi2(1) with ties = {res}{ralign 6:0.672}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.4123}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         kwallis `var' if cohort==4 ,by(ever_mal)
{txt}  3{com}. {c )-}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 84 {txt}{c |} {res}12713.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}183 {txt}{c |} {res}23065.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:6.184}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0129}

{txt}  chi2(1) with ties = {res}{ralign 6:6.184}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0129}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 85 {txt}{c |} {res}11130.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}185 {txt}{c |} {res}25455.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:0.423}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.5155}

{txt}  chi2(1) with ties = {res}{ralign 6:0.423}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.5155}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 84 {txt}{c |} {res}12547.50 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}184 {txt}{c |} {res}23498.50 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:4.506}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0338}

{txt}  chi2(1) with ties = {res}{ralign 6:4.507}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0338}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 82 {txt}{c |} {res}10021.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}179 {txt}{c |} {res}24170.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:1.622}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.2028}

{txt}  chi2(1) with ties = {res}{ralign 6:1.622}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.2028}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         kwallis `var' if cohort==4 ,by(ever_mal)
{txt}  3{com}. {c )-}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 84 {txt}{c |} {res}12713.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}183 {txt}{c |} {res}23065.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:6.184}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0129}

{txt}  chi2(1) with ties = {res}{ralign 6:6.184}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0129}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 85 {txt}{c |} {res}11130.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}185 {txt}{c |} {res}25455.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:0.423}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.5155}

{txt}  chi2(1) with ties = {res}{ralign 6:0.423}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.5155}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 84 {txt}{c |} {res}12547.50 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}184 {txt}{c |} {res}23498.50 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:4.506}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0338}

{txt}  chi2(1) with ties = {res}{ralign 6:4.507}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0338}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 82 {txt}{c |} {res}10021.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}179 {txt}{c |} {res}24170.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:1.622}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.2028}

{txt}  chi2(1) with ties = {res}{ralign 6:1.622}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.2028}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         kwallis `var' if cohort==5 ,by(ever_mal)
{txt}  3{com}. {c )-}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res} 49 {txt}{c |} {res} 2107.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res} 27 {txt}{c |} {res}  819.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:5.727}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0167}

{txt}  chi2(1) with ties = {res}{ralign 6:5.746}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0165}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}149 {txt}{c |} {res}21724.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}111 {txt}{c |} {res}12206.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:14.445}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0001}

{txt}  chi2(1) with ties = {res}{ralign 6:14.474}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0001}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}149 {txt}{c |} {res}21697.50 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}111 {txt}{c |} {res}12232.50 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:14.111}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0002}

{txt}  chi2(1) with ties = {res}{ralign 6:14.171}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0002}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}145 {txt}{c |} {res}19013.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}111 {txt}{c |} {res}13883.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:0.420}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.5169}

{txt}  chi2(1) with ties = {res}{ralign 6:0.421}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.5162}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         kwallis `var' if cohort==6 ,by(ever_mal)
{txt}  3{com}. {c )-}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}186 {txt}{c |} {res}31313.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}103 {txt}{c |} {res}10592.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:40.739}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0001}

{txt}  chi2(1) with ties = {res}{ralign 6:40.749}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0001}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}186 {txt}{c |} {res}31539.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}104 {txt}{c |} {res}10656.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:42.709}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0001}

{txt}  chi2(1) with ties = {res}{ralign 6:42.719}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0001}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}186 {txt}{c |} {res}30966.00 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}104 {txt}{c |} {res}11229.00 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:32.474}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0001}

{txt}  chi2(1) with ties = {res}{ralign 6:32.498}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0001}

{txt}Kruskal–Wallis equality-of-populations rank test

  {c TLC}{hline 10}{c TT}{hline 5}{c TT}{hline 10}{c TRC}
  {c |} {res}ever_mal {txt}{c |} {res}Obs {txt}{c |} {res}Rank sum {txt}{c |}
  {c LT}{hline 10}{c +}{hline 5}{c +}{hline 10}{c RT}
  {c |} {res}     NPM {txt}{c |} {res}186 {txt}{c |} {res}28680.50 {txt}{c |}
  {c |} {res}      PM {txt}{c |} {res}104 {txt}{c |} {res}13514.50 {txt}{c |}
  {c BLC}{hline 10}{c BT}{hline 5}{c BT}{hline 10}{c BRC}

  chi2(1) = {res}{ralign 6:5.577}
{txt}{ralign 9:Prob} = {res}{ralign 6:0.0182}

{txt}  chi2(1) with ties = {res}{ralign 6:5.587}
{txt}{ralign 19:Prob} = {res}{ralign 6:0.0181}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. regress pan_head_ap ever_mal 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,554
{txt}{hline 13}{c +}{hline 34}   F(1, 1552)      = {res}     4.04
{txt}       Model {c |} {res} .935931381         1  .935931381   {txt}Prob > F        ={res}    0.0445
{txt}    Residual {c |} {res} 359.182362     1,552  .231431935   {txt}R-squared       ={res}    0.0026
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0020
{txt}       Total {c |} {res} 360.118294     1,553  .231885572   {txt}Root MSE        =   {res} .48107

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} pan_head_ap{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.0492395{col 26}{space 2} .0244852{col 37}{space 1}   -2.01{col 46}{space 3}0.044{col 54}{space 4} -.097267{col 67}{space 3} -.001212
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.116951{col 26}{space 2} .0179911{col 37}{space 1}  117.67{col 46}{space 3}0.000{col 54}{space 4} 2.081662{col 67}{space 3} 2.152241
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. regress pan_head_ap ever_mal cohort

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,554
{txt}{hline 13}{c +}{hline 34}   F(2, 1551)      = {res}    33.62
{txt}       Model {c |} {res} 14.9630667         2  7.48153335   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 345.155227     1,551  .222537219   {txt}R-squared       ={res}    0.0416
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0403
{txt}       Total {c |} {res} 360.118294     1,553  .231885572   {txt}Root MSE        =   {res} .47174

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} pan_head_ap{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.1012715{col 26}{space 2} .0248884{col 37}{space 1}   -4.07{col 46}{space 3}0.000{col 54}{space 4}  -.15009{col 67}{space 3} -.052453
{txt}{space 6}cohort {c |}{col 14}{res}{space 2}-.0571234{col 26}{space 2}  .007195{col 37}{space 1}   -7.94{col 46}{space 3}0.000{col 54}{space 4}-.0712363{col 67}{space 3}-.0430104
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.351996{col 26}{space 2} .0344631{col 37}{space 1}   68.25{col 46}{space 3}0.000{col 54}{space 4} 2.284396{col 67}{space 3} 2.419595
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. regress pan_head_ap ever_mal i.cohort

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,554
{txt}{hline 13}{c +}{hline 34}   F(6, 1547)      = {res}    99.83
{txt}       Model {c |} {res} 100.514276         6  16.7523794   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 259.604017     1,547  .167811259   {txt}R-squared       ={res}    0.2791
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2763
{txt}       Total {c |} {res} 360.118294     1,553  .231885572   {txt}Root MSE        =   {res} .40965

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} pan_head_ap{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.1239093{col 26}{space 2} .0223123{col 37}{space 1}   -5.55{col 46}{space 3}0.000{col 54}{space 4}-.1676747{col 67}{space 3}-.0801438
{txt}{space 12} {c |}
{space 6}cohort {c |}
{space 8}SAM  {c |}{col 14}{res}{space 2} .0050534{col 26}{space 2} .0512918{col 37}{space 1}    0.10{col 46}{space 3}0.922{col 54}{space 4}-.0955553{col 67}{space 3} .1056622
{txt}{space 5}CICADA  {c |}{col 14}{res}{space 2} .1978544{col 26}{space 2} .0334518{col 37}{space 1}    5.91{col 46}{space 3}0.000{col 54}{space 4} .1322388{col 67}{space 3} .2634701
{txt}{space 4}NUSTART  {c |}{col 14}{res}{space 2} .4195209{col 26}{space 2} .0343682{col 37}{space 1}   12.21{col 46}{space 3}0.000{col 54}{space 4} .3521078{col 67}{space 3} .4869341
{txt}{space 6}STATT  {c |}{col 14}{res}{space 2}-.3176995{col 26}{space 2} .0356891{col 37}{space 1}   -8.90{col 46}{space 3}0.000{col 54}{space 4}-.3877035{col 67}{space 3}-.2476955
{txt}{space 6}CLHNS  {c |}{col 14}{res}{space 2}-.2282397{col 26}{space 2} .0351596{col 37}{space 1}   -6.49{col 46}{space 3}0.000{col 54}{space 4}-.2972052{col 67}{space 3}-.1592743
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.135676{col 26}{space 2} .0297886{col 37}{space 1}   71.69{col 46}{space 3}0.000{col 54}{space 4} 2.077246{col 67}{space 3} 2.194106
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. regress pan_head_ap ever_mal i.cohort if chid ==1
{err}chid not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. regress pan_head_ap ever_mal i.cohort if child ==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       387
{txt}{hline 13}{c +}{hline 34}   F(2, 384)       = {res}     0.82
{txt}       Model {c |} {res} .172366248         2  .086183124   {txt}Prob > F        ={res}    0.4424
{txt}    Residual {c |} {res} 40.4901748       384  .105443164   {txt}R-squared       ={res}    0.0042
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0009
{txt}       Total {c |} {res} 40.6625411       386  .105343371   {txt}Root MSE        =   {res} .32472

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} pan_head_ap{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} .0354914{col 26}{space 2} .0403903{col 37}{space 1}    0.88{col 46}{space 3}0.380{col 54}{space 4}-.0439224{col 67}{space 3} .1149052
{txt}{space 12} {c |}
{space 6}cohort {c |}
{space 8}SAM  {c |}{col 14}{res}{space 2} .0468125{col 26}{space 2} .0417561{col 37}{space 1}    1.12{col 46}{space 3}0.263{col 54}{space 4}-.0352867{col 67}{space 3} .1289116
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.004497{col 26}{space 2} .0380862{col 37}{space 1}   52.63{col 46}{space 3}0.000{col 54}{space 4} 1.929614{col 67}{space 3} 2.079381
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. regress pan_head_ap ever_mal i.cohort if child ==2

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,167
{txt}{hline 13}{c +}{hline 34}   F(4, 1162)      = {res}   135.36
{txt}       Model {c |} {res} 101.150914         4  25.2877285   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 217.081965     1,162  .186817526   {txt}R-squared       ={res}    0.3179
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3155
{txt}       Total {c |} {res} 318.232879     1,166  .272926997   {txt}Root MSE        =   {res} .43222

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} pan_head_ap{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.1617251{col 26}{space 2}  .026186{col 37}{space 1}   -6.18{col 46}{space 3}0.000{col 54}{space 4}-.2131021{col 67}{space 3}-.1103481
{txt}{space 12} {c |}
{space 6}cohort {c |}
{space 4}NUSTART  {c |}{col 14}{res}{space 2} .2321023{col 26}{space 2} .0358122{col 37}{space 1}    6.48{col 46}{space 3}0.000{col 54}{space 4} .1618384{col 67}{space 3} .3023662
{txt}{space 6}STATT  {c |}{col 14}{res}{space 2}-.5148846{col 26}{space 2} .0354559{col 37}{space 1}  -14.52{col 46}{space 3}0.000{col 54}{space 4}-.5844494{col 67}{space 3}-.4453198
{txt}{space 6}CLHNS  {c |}{col 14}{res}{space 2}-.4280077{col 26}{space 2} .0344141{col 37}{space 1}  -12.44{col 46}{space 3}0.000{col 54}{space 4}-.4955285{col 67}{space 3}-.3604869
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.349006{col 26}{space 2}  .025558{col 37}{space 1}   91.91{col 46}{space 3}0.000{col 54}{space 4} 2.298861{col 67}{space 3} 2.399151
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. regress pan_head_ap ever_mal if child ==2

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,167
{txt}{hline 13}{c +}{hline 34}   F(1, 1165)      = {res}     2.83
{txt}       Model {c |} {res} .770421313         1  .770421313   {txt}Prob > F        ={res}    0.0929
{txt}    Residual {c |} {res} 317.462457     1,165  .272499963   {txt}R-squared       ={res}    0.0024
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0016
{txt}       Total {c |} {res} 318.232879     1,166  .272926997   {txt}Root MSE        =   {res} .52202

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} pan_head_ap{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.0515181{col 26}{space 2} .0306393{col 37}{space 1}   -1.68{col 46}{space 3}0.093{col 54}{space 4}-.1116325{col 67}{space 3} .0085963
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.130448{col 26}{space 2} .0208806{col 37}{space 1}  102.03{col 46}{space 3}0.000{col 54}{space 4}  2.08948{col 67}{space 3} 2.171416
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         regress `var' if child ==2)
{txt}  3{com}. {c )-}
{err}too many ')' or ']'
{txt}{search r(132), local:r(132);}

end of do-file

{search r(132), local:r(132);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}.                 
. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         regress `var' if child ==2
{txt}  3{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,026
{txt}{hline 13}{c +}{hline 34}   F(0, 1025)      = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 267.770555     1,025  .261239566   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 267.770555     1,025  .261239566   {txt}Root MSE        =   {res} .51112

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pan_head_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.071267{col 26}{space 2} .0159568{col 37}{space 1}  129.80{col 46}{space 3}0.000{col 54}{space 4} 2.039955{col 67}{space 3} 2.102579
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,167
{txt}{hline 13}{c +}{hline 34}   F(0, 1166)      = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 318.232879     1,166  .272926997   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 318.232879     1,166  .272926997   {txt}Root MSE        =   {res} .52242

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} pan_head_ap{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.106521{col 26}{space 2} .0152928{col 37}{space 1}  137.75{col 46}{space 3}0.000{col 54}{space 4} 2.076516{col 67}{space 3} 2.136526
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,225
{txt}{hline 13}{c +}{hline 34}   F(0, 1224)      = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res} 197.181532     1,224  .161096023   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 197.181532     1,224  .161096023   {txt}Root MSE        =   {res} .40137

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pan_body_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.258669{col 26}{space 2} .0114676{col 37}{space 1}  109.76{col 46}{space 3}0.000{col 54}{space 4} 1.236171{col 67}{space 3} 1.281168
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       824
{txt}{hline 13}{c +}{hline 34}   F(0, 823)       = {res}     0.00
{txt}       Model {c |} {res}          0         0           .   {txt}Prob > F        ={res}         .
{txt}    Residual {c |} {res}  153.60726       823  .186643086   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}  153.60726       823  .186643086   {txt}Root MSE        =   {res} .43202

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pan_tail_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.388677{col 26}{space 2} .0150502{col 37}{space 1}   92.27{col 46}{space 3}0.000{col 54}{space 4} 1.359136{col 67}{space 3} 1.418218
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         regress `var' ever_mal if child ==2
{txt}  3{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,026
{txt}{hline 13}{c +}{hline 34}   F(1, 1024)      = {res}    33.21
{txt}       Model {c |} {res} 8.41136077         1  8.41136077   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 259.359194     1,024  .253280463   {txt}R-squared       ={res}    0.0314
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0305
{txt}       Total {c |} {res} 267.770555     1,025  .261239566   {txt}Root MSE        =   {res} .50327

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pan_head_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.1814869{col 26}{space 2} .0314929{col 37}{space 1}   -5.76{col 46}{space 3}0.000{col 54}{space 4} -.243285{col 67}{space 3}-.1196889
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.155996{col 26}{space 2} .0215183{col 37}{space 1}  100.19{col 46}{space 3}0.000{col 54}{space 4} 2.113771{col 67}{space 3} 2.198221
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,167
{txt}{hline 13}{c +}{hline 34}   F(1, 1165)      = {res}     2.83
{txt}       Model {c |} {res} .770421313         1  .770421313   {txt}Prob > F        ={res}    0.0929
{txt}    Residual {c |} {res} 317.462457     1,165  .272499963   {txt}R-squared       ={res}    0.0024
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0016
{txt}       Total {c |} {res} 318.232879     1,166  .272926997   {txt}Root MSE        =   {res} .52202

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} pan_head_ap{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.0515181{col 26}{space 2} .0306393{col 37}{space 1}   -1.68{col 46}{space 3}0.093{col 54}{space 4}-.1116325{col 67}{space 3} .0085963
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.130448{col 26}{space 2} .0208806{col 37}{space 1}  102.03{col 46}{space 3}0.000{col 54}{space 4}  2.08948{col 67}{space 3} 2.171416
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,225
{txt}{hline 13}{c +}{hline 34}   F(1, 1223)      = {res}    11.70
{txt}       Model {c |} {res} 1.86817366         1  1.86817366   {txt}Prob > F        ={res}    0.0006
{txt}    Residual {c |} {res} 195.313358     1,223  .159700211   {txt}R-squared       ={res}    0.0095
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0087
{txt}       Total {c |} {res} 197.181532     1,224  .161096023   {txt}Root MSE        =   {res} .39963

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pan_body_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.0782922{col 26}{space 2} .0228909{col 37}{space 1}   -3.42{col 46}{space 3}0.001{col 54}{space 4} -.123202{col 67}{space 3}-.0333824
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.295099{col 26}{space 2} .0156146{col 37}{space 1}   82.94{col 46}{space 3}0.000{col 54}{space 4} 1.264465{col 67}{space 3} 1.325734
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       824
{txt}{hline 13}{c +}{hline 34}   F(1, 822)       = {res}    17.87
{txt}       Model {c |} {res} 3.26876454         1  3.26876454   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 150.338495       822  .182893547   {txt}R-squared       ={res}    0.0213
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0201
{txt}       Total {c |} {res}  153.60726       823  .186643086   {txt}Root MSE        =   {res} .42766

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pan_tail_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} .1259975{col 26}{space 2} .0298036{col 37}{space 1}    4.23{col 46}{space 3}0.000{col 54}{space 4} .0674973{col 67}{space 3} .1844977
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.327055{col 26}{space 2} .0208429{col 37}{space 1}   63.67{col 46}{space 3}0.000{col 54}{space 4} 1.286143{col 67}{space 3} 1.367966
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         regress `var' ever_mal i.cohort if child ==2
{txt}  3{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,026
{txt}{hline 13}{c +}{hline 34}   F(4, 1021)      = {res}    60.62
{txt}       Model {c |} {res} 51.3896334         4  12.8474084   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 216.380921     1,021  .211930383   {txt}R-squared       ={res}    0.1919
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1888
{txt}       Total {c |} {res} 267.770555     1,025  .261239566   {txt}Root MSE        =   {res} .46036

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pan_head_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} -.203136{col 26}{space 2} .0298826{col 37}{space 1}   -6.80{col 46}{space 3}0.000{col 54}{space 4}-.2617743{col 67}{space 3}-.1444977
{txt}{space 12} {c |}
{space 6}cohort {c |}
{space 4}NUSTART  {c |}{col 14}{res}{space 2}-.1798976{col 26}{space 2} .0373351{col 37}{space 1}   -4.82{col 46}{space 3}0.000{col 54}{space 4}  -.25316{col 67}{space 3}-.1066353
{txt}{space 6}STATT  {c |}{col 14}{res}{space 2}-.7693289{col 26}{space 2} .0577092{col 37}{space 1}  -13.33{col 46}{space 3}0.000{col 54}{space 4} -.882571{col 67}{space 3}-.6560867
{txt}{space 6}CLHNS  {c |}{col 14}{res}{space 2}-.2975975{col 26}{space 2} .0357069{col 37}{space 1}   -8.33{col 46}{space 3}0.000{col 54}{space 4}-.3676647{col 67}{space 3}-.2275302
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.353732{col 26}{space 2} .0263895{col 37}{space 1}   89.19{col 46}{space 3}0.000{col 54}{space 4} 2.301949{col 67}{space 3} 2.405516
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,167
{txt}{hline 13}{c +}{hline 34}   F(4, 1162)      = {res}   135.36
{txt}       Model {c |} {res} 101.150914         4  25.2877285   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 217.081965     1,162  .186817526   {txt}R-squared       ={res}    0.3179
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3155
{txt}       Total {c |} {res} 318.232879     1,166  .272926997   {txt}Root MSE        =   {res} .43222

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} pan_head_ap{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.1617251{col 26}{space 2}  .026186{col 37}{space 1}   -6.18{col 46}{space 3}0.000{col 54}{space 4}-.2131021{col 67}{space 3}-.1103481
{txt}{space 12} {c |}
{space 6}cohort {c |}
{space 4}NUSTART  {c |}{col 14}{res}{space 2} .2321023{col 26}{space 2} .0358122{col 37}{space 1}    6.48{col 46}{space 3}0.000{col 54}{space 4} .1618384{col 67}{space 3} .3023662
{txt}{space 6}STATT  {c |}{col 14}{res}{space 2}-.5148846{col 26}{space 2} .0354559{col 37}{space 1}  -14.52{col 46}{space 3}0.000{col 54}{space 4}-.5844494{col 67}{space 3}-.4453198
{txt}{space 6}CLHNS  {c |}{col 14}{res}{space 2}-.4280077{col 26}{space 2} .0344141{col 37}{space 1}  -12.44{col 46}{space 3}0.000{col 54}{space 4}-.4955285{col 67}{space 3}-.3604869
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.349006{col 26}{space 2}  .025558{col 37}{space 1}   91.91{col 46}{space 3}0.000{col 54}{space 4} 2.298861{col 67}{space 3} 2.399151
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,225
{txt}{hline 13}{c +}{hline 34}   F(4, 1220)      = {res}    94.95
{txt}       Model {c |} {res} 46.8100806         4  11.7025201   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 150.371451     1,220  .123255288   {txt}R-squared       ={res}    0.2374
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2349
{txt}       Total {c |} {res} 197.181532     1,224  .161096023   {txt}Root MSE        =   {res} .35108

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pan_body_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.1225725{col 26}{space 2} .0207183{col 37}{space 1}   -5.92{col 46}{space 3}0.000{col 54}{space 4}-.1632201{col 67}{space 3} -.081925
{txt}{space 12} {c |}
{space 6}cohort {c |}
{space 4}NUSTART  {c |}{col 14}{res}{space 2}-.0088791{col 26}{space 2} .0281641{col 37}{space 1}   -0.32{col 46}{space 3}0.753{col 54}{space 4}-.0641344{col 67}{space 3} .0463763
{txt}{space 6}STATT  {c |}{col 14}{res}{space 2}-.4574638{col 26}{space 2} .0278732{col 37}{space 1}  -16.41{col 46}{space 3}0.000{col 54}{space 4}-.5121485{col 67}{space 3} -.402779
{txt}{space 6}CLHNS  {c |}{col 14}{res}{space 2}-.3056607{col 26}{space 2} .0270089{col 37}{space 1}  -11.32{col 46}{space 3}0.000{col 54}{space 4}-.3586498{col 67}{space 3}-.2526716
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.487101{col 26}{space 2} .0194579{col 37}{space 1}   76.43{col 46}{space 3}0.000{col 54}{space 4} 1.448926{col 67}{space 3} 1.525275
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       824
{txt}{hline 13}{c +}{hline 34}   F(4, 819)       = {res}    96.05
{txt}       Model {c |} {res} 49.0473897         4  12.2618474   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  104.55987       819  .127667729   {txt}R-squared       ={res}    0.3193
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3160
{txt}       Total {c |} {res}  153.60726       823  .186643086   {txt}Root MSE        =   {res} .35731

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pan_tail_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} .0033013{col 26}{space 2} .0259185{col 37}{space 1}    0.13{col 46}{space 3}0.899{col 54}{space 4}-.0475732{col 67}{space 3} .0541758
{txt}{space 12} {c |}
{space 6}cohort {c |}
{space 4}NUSTART  {c |}{col 14}{res}{space 2} .6749693{col 26}{space 2}  .089529{col 37}{space 1}    7.54{col 46}{space 3}0.000{col 54}{space 4} .4992359{col 67}{space 3} .8507027
{txt}{space 6}STATT  {c |}{col 14}{res}{space 2} .4082667{col 26}{space 2} .0895251{col 37}{space 1}    4.56{col 46}{space 3}0.000{col 54}{space 4} .2325411{col 67}{space 3} .5839923
{txt}{space 6}CLHNS  {c |}{col 14}{res}{space 2} .0950993{col 26}{space 2} .0892731{col 37}{space 1}    1.07{col 46}{space 3}0.287{col 54}{space 4}-.0801318{col 67}{space 3} .2703304
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.012958{col 26}{space 2} .0877391{col 37}{space 1}   11.55{col 46}{space 3}0.000{col 54}{space 4} .8407382{col 67}{space 3} 1.185178
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. foreach var of varlist pan_head_trans pan_head_ap  pan_body_trans  pan_tail_trans {c -(}
{txt}  2{com}.         regress `var' ever_mal i.cohort bmi_cat if child ==2
{txt}  3{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,026
{txt}{hline 13}{c +}{hline 34}   F(5, 1020)      = {res}    52.07
{txt}       Model {c |} {res} 54.4524775         5  10.8904955   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 213.318077     1,020   .20913537   {txt}R-squared       ={res}    0.2034
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1994
{txt}       Total {c |} {res} 267.770555     1,025  .261239566   {txt}Root MSE        =   {res} .45731

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pan_head_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.1497031{col 26}{space 2} .0328046{col 37}{space 1}   -4.56{col 46}{space 3}0.000{col 54}{space 4}-.2140753{col 67}{space 3} -.085331
{txt}{space 12} {c |}
{space 6}cohort {c |}
{space 4}NUSTART  {c |}{col 14}{res}{space 2}-.1927579{col 26}{space 2} .0372401{col 37}{space 1}   -5.18{col 46}{space 3}0.000{col 54}{space 4}-.2658338{col 67}{space 3} -.119682
{txt}{space 6}STATT  {c |}{col 14}{res}{space 2}-.7558577{col 26}{space 2} .0574353{col 37}{space 1}  -13.16{col 46}{space 3}0.000{col 54}{space 4}-.8685626{col 67}{space 3}-.6431528
{txt}{space 6}CLHNS  {c |}{col 14}{res}{space 2}-.3472349{col 26}{space 2} .0377677{col 37}{space 1}   -9.19{col 46}{space 3}0.000{col 54}{space 4}-.4213462{col 67}{space 3}-.2731235
{txt}{space 12} {c |}
{space 5}bmi_cat {c |}{col 14}{res}{space 2} .0747964{col 26}{space 2} .0195448{col 37}{space 1}    3.83{col 46}{space 3}0.000{col 54}{space 4} .0364437{col 67}{space 3} .1131491
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.173654{col 26}{space 2} .0538653{col 37}{space 1}   40.35{col 46}{space 3}0.000{col 54}{space 4} 2.067955{col 67}{space 3} 2.279353
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,167
{txt}{hline 13}{c +}{hline 34}   F(5, 1161)      = {res}   113.35
{txt}       Model {c |} {res} 104.390297         5  20.8780594   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 213.842582     1,161   .18418827   {txt}R-squared       ={res}    0.3280
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3251
{txt}       Total {c |} {res} 318.232879     1,166  .272926997   {txt}Root MSE        =   {res} .42917

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} pan_head_ap{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.1086674{col 26}{space 2} .0289157{col 37}{space 1}   -3.76{col 46}{space 3}0.000{col 54}{space 4}-.1654003{col 67}{space 3}-.0519345
{txt}{space 12} {c |}
{space 6}cohort {c |}
{space 4}NUSTART  {c |}{col 14}{res}{space 2} .2185787{col 26}{space 2} .0357053{col 37}{space 1}    6.12{col 46}{space 3}0.000{col 54}{space 4} .1485246{col 67}{space 3} .2886327
{txt}{space 6}STATT  {c |}{col 14}{res}{space 2}-.4932492{col 26}{space 2} .0355815{col 37}{space 1}  -13.86{col 46}{space 3}0.000{col 54}{space 4}-.5630605{col 67}{space 3}-.4234379
{txt}{space 6}CLHNS  {c |}{col 14}{res}{space 2}-.4787707{col 26}{space 2} .0362517{col 37}{space 1}  -13.21{col 46}{space 3}0.000{col 54}{space 4}-.5498968{col 67}{space 3}-.4076445
{txt}{space 12} {c |}
{space 5}bmi_cat {c |}{col 14}{res}{space 2} .0752736{col 26}{space 2} .0179491{col 37}{space 1}    4.19{col 46}{space 3}0.000{col 54}{space 4} .0400573{col 67}{space 3} .1104898
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.168937{col 26}{space 2} .0498764{col 37}{space 1}   43.49{col 46}{space 3}0.000{col 54}{space 4} 2.071079{col 67}{space 3} 2.266795
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,225
{txt}{hline 13}{c +}{hline 34}   F(5, 1219)      = {res}    82.08
{txt}       Model {c |} {res} 49.6648999         5  9.93297998   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 147.516632     1,219  .121014464   {txt}R-squared       ={res}    0.2519
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2488
{txt}       Total {c |} {res} 197.181532     1,224  .161096023   {txt}Root MSE        =   {res} .34787

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pan_body_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2}-.0734517{col 26}{space 2}  .022885{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-.1183502{col 67}{space 3}-.0285533
{txt}{space 12} {c |}
{space 6}cohort {c |}
{space 4}NUSTART  {c |}{col 14}{res}{space 2}-.0207706{col 26}{space 2} .0280141{col 37}{space 1}   -0.74{col 46}{space 3}0.459{col 54}{space 4}-.0757317{col 67}{space 3} .0341906
{txt}{space 6}STATT  {c |}{col 14}{res}{space 2}-.4365829{col 26}{space 2} .0279513{col 37}{space 1}  -15.62{col 46}{space 3}0.000{col 54}{space 4}-.4914209{col 67}{space 3}-.3817449
{txt}{space 6}CLHNS  {c |}{col 14}{res}{space 2} -.351276{col 26}{space 2} .0283623{col 37}{space 1}  -12.39{col 46}{space 3}0.000{col 54}{space 4}-.4069204{col 67}{space 3}-.2956316
{txt}{space 12} {c |}
{space 5}bmi_cat {c |}{col 14}{res}{space 2} .0691633{col 26}{space 2} .0142398{col 37}{space 1}    4.86{col 46}{space 3}0.000{col 54}{space 4}  .041226{col 67}{space 3} .0971006
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.320489{col 26}{space 2} .0393502{col 37}{space 1}   33.56{col 46}{space 3}0.000{col 54}{space 4} 1.243287{col 67}{space 3}  1.39769
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       824
{txt}{hline 13}{c +}{hline 34}   F(5, 818)       = {res}    77.68
{txt}       Model {c |} {res} 49.4528481         5  9.89056962   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 104.154412       818  .127328132   {txt}R-squared       ={res}    0.3219
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3178
{txt}       Total {c |} {res}  153.60726       823  .186643086   {txt}Root MSE        =   {res} .35683

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pan_tail_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ever_mal {c |}{col 14}{res}{space 2} .0253196{col 26}{space 2} .0286745{col 37}{space 1}    0.88{col 46}{space 3}0.377{col 54}{space 4}-.0309647{col 67}{space 3} .0816038
{txt}{space 12} {c |}
{space 6}cohort {c |}
{space 4}NUSTART  {c |}{col 14}{res}{space 2} .6556451{col 26}{space 2} .0900633{col 37}{space 1}    7.28{col 46}{space 3}0.000{col 54}{space 4} .4788627{col 67}{space 3} .8324275
{txt}{space 6}STATT  {c |}{col 14}{res}{space 2} .4038725{col 26}{space 2} .0894398{col 37}{space 1}    4.52{col 46}{space 3}0.000{col 54}{space 4} .2283139{col 67}{space 3} .5794311
{txt}{space 6}CLHNS  {c |}{col 14}{res}{space 2} .0599266{col 26}{space 2} .0913071{col 37}{space 1}    0.66{col 46}{space 3}0.512{col 54}{space 4}-.1192972{col 67}{space 3} .2391505
{txt}{space 12} {c |}
{space 5}bmi_cat {c |}{col 14}{res}{space 2} .0317677{col 26}{space 2} .0178023{col 37}{space 1}    1.78{col 46}{space 3}0.075{col 54}{space 4}-.0031758{col 67}{space 3} .0667113
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .9508467{col 26}{space 2} .0942824{col 37}{space 1}   10.09{col 46}{space 3}0.000{col 54}{space 4} .7657829{col 67}{space 3} 1.135911
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. hist pan_head_ap
{txt}(bin={res}31{txt}, start={res}.89999998{txt}, width={res}.12{txt})
{res}
{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. scatter pan_head_ap pan_head_trans
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. scatter pan_body_trans pan_tail_trans
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. scatter pan_body_trans pan_tail_trans if radio==3
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. scatter pan_body_trans pan_tail_trans if radio3==1
{res}{txt}
{com}. 
{txt}end of do-file

{com}. d amy*
{err}variable amy* not found
{txt}{search r(111), local:r(111);}

{com}. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"
{txt}
{com}. pca pan_head_ap pan_head_trans pan_body_trans pan_tail_trans

{txt}Principal components/correlation{col 50}Number of obs    = {res}     1,005
{col 50}{txt}Number of comp.  = {res}         4
{col 50}{txt}Trace            {col 67}=  {res}        4
{col 5}{txt}Rotation: (unrotated = principal){col 50}Rho              = {res}    1.0000

{txt}{col 5}{hline 13}{c TT}{hline 60}
{col 5}   Component {c |}   Eigenvalue   Difference         Proportion   Cumulative
{col 5}{hline 13}{c +}{hline 60}
{col 5}{ralign 12:Comp1} {c |}{res}      2.27605      1.41425             0.5690       0.5690
{txt}{col 5}{ralign 12:Comp2} {c |}{res}      .861804      .389723             0.2155       0.7845
{txt}{col 5}{ralign 12:Comp3} {c |}{res}       .47208     .0820182             0.1180       0.9025
{txt}{col 5}{ralign 12:Comp4} {c |}{res}      .390062            .             0.0975       1.0000
{txt}{col 5}{hline 13}{c BT}{hline 60}

Principal components (eigenvectors) 

{space 4}{hline 13}{c  TT}{hline 10}{hline 10}{hline 10}{hline 10}{c  TT}{hline 13}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Comp1}{space 1}{space 1}{ralign 8:Comp2}{space 1}{space 1}{ralign 8:Comp3}{space 1}{space 1}{ralign 8:Comp4}{space 1}{c |}{space 1}{ralign 11:Unexplained}{space 1}
{space 4}{hline 13}{c   +}{hline 10}{hline 10}{hline 10}{hline 10}{c   +}{hline 13}
{space 4}{space 0}{ralign 12:pan_head_ap}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.5640}}}{space 1}{space 1}{ralign 8:{res:{sf: -0.0552}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.3221}}}{space 1}{space 1}{ralign 8:{res:{sf: -0.7583}}}{space 1}{c |}{space 1}{center 11:{res:{sf:          0}}}{space 1}
{space 4}{space 0}{ralign 12:pan_head_t~s}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.4617}}}{space 1}{space 1}{ralign 8:{res:{sf: -0.6518}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.3033}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.5196}}}{space 1}{c |}{space 1}{center 11:{res:{sf:          0}}}{space 1}
{space 4}{space 0}{ralign 12:pan_body_t~s}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.5409}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.0273}}}{space 1}{space 1}{ralign 8:{res:{sf: -0.8395}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.0437}}}{space 1}{c |}{space 1}{center 11:{res:{sf:          0}}}{space 1}
{space 4}{space 0}{ralign 12:pan_tail_t~s}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.4197}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.7559}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.3154}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.3912}}}{space 1}{c |}{space 1}{center 11:{res:{sf:          0}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}{hline 10}{hline 10}{hline 10}{c  BT}{hline 13}

{com}. 
. * Generate the first principal component score
. predict pc1, score
{txt}(3 components skipped)

Scoring coefficients 
{col 5}sum of squares(column-loading) = 1

{space 4}{hline 13}{c  TT}{hline 10}{hline 10}{hline 10}{hline 10}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Comp1}{space 1}{space 1}{ralign 8:Comp2}{space 1}{space 1}{ralign 8:Comp3}{space 1}{space 1}{ralign 8:Comp4}{space 1}
{space 4}{hline 13}{c   +}{hline 10}{hline 10}{hline 10}{hline 10}
{space 4}{space 0}{ralign 12:pan_head_ap}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.5640}}}{space 1}{space 1}{ralign 8:{res:{sf: -0.0552}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.3221}}}{space 1}{space 1}{ralign 8:{res:{sf: -0.7583}}}{space 1}
{space 4}{space 0}{ralign 12:pan_head_t~s}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.4617}}}{space 1}{space 1}{ralign 8:{res:{sf: -0.6518}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.3033}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.5196}}}{space 1}
{space 4}{space 0}{ralign 12:pan_body_t~s}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.5409}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.0273}}}{space 1}{space 1}{ralign 8:{res:{sf: -0.8395}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.0437}}}{space 1}
{space 4}{space 0}{ralign 12:pan_tail_t~s}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.4197}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.7559}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.3154}}}{space 1}{space 1}{ralign 8:{res:{sf:  0.3912}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}{hline 10}{hline 10}{hline 10}

{com}. 
. * Look at the loadings to understand how each measurement contributes
. estat loadings

{txt}Principal component loadings (unrotated)
{col 5}component normalization: sum of squares(column) = 1

{space 4}{hline 13}{c  TT}{hline 10}{hline 10}{hline 10}{hline 10}
{space 4}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 8:Comp1}{space 1}{space 1}{ralign 8:Comp2}{space 1}{space 1}{ralign 8:Comp3}{space 1}{space 1}{ralign 8:Comp4}{space 1}
{space 4}{hline 13}{c   +}{hline 10}{hline 10}{hline 10}{hline 10}
{space 4}{space 0}{ralign 12:pan_head_ap}{space 1}{c |}{space 1}{ralign 8:{res:{sf:    .564}}}{space 1}{space 1}{ralign 8:{res:{sf: -.05517}}}{space 1}{space 1}{ralign 8:{res:{sf:   .3221}}}{space 1}{space 1}{ralign 8:{res:{sf:  -.7583}}}{space 1}
{space 4}{space 0}{ralign 12:pan_head_t~s}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   .4617}}}{space 1}{space 1}{ralign 8:{res:{sf:  -.6518}}}{space 1}{space 1}{ralign 8:{res:{sf:   .3033}}}{space 1}{space 1}{ralign 8:{res:{sf:   .5196}}}{space 1}
{space 4}{space 0}{ralign 12:pan_body_t~s}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   .5409}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02732}}}{space 1}{space 1}{ralign 8:{res:{sf:  -.8395}}}{space 1}{space 1}{ralign 8:{res:{sf:  .04371}}}{space 1}
{space 4}{space 0}{ralign 12:pan_tail_t~s}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   .4197}}}{space 1}{space 1}{ralign 8:{res:{sf:   .7559}}}{space 1}{space 1}{ralign 8:{res:{sf:   .3154}}}{space 1}{space 1}{ralign 8:{res:{sf:   .3912}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}{hline 10}{hline 10}{hline 10}

{com}. 
{txt}end of do-file

{com}. 