
. 
. local dataset "All_combined_sampa_data.dta"

. 
. * CHANGE DIRECTORY TO DROPBOX
. 
. cd "$sampadata"
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data/SAMPA

. 
. use "All_combined_sampa_data.dta", clear

. 
. frame rename default sampa

. cd "$ghsamparadio"
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. 
. 
. 
end of do-file

. 
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. do ./do/cr_flag_elastase.do             // Flags the elastase samples that should not be analyzed bas
> ed on ELISA standards ; n = 90

. /*
> cr_flag_elastase.do                     
> Flags the elastase samples that should not be analyzed based on ELISA standards ; n = 90
> J Solon
> March 3 2025
> 
> Once this flag is made, this has to be added to the analysis dataset
> */
. 
. 
. tempfile 1 2 3

. 
. sort sampa_id

. 
. save `1'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000001 saved as .dta format

. 
. ***  IMPORT ZAMBIA ELISA DATA (PLATE DROPPED)
. 
. frame create plate

. frame change plate

. 
. cd data-temp
/Users/juansolon/Documents/GitHub/sampa-radio/data-temp

. 
. import excel using "Plate 1 results.xlsx" ,cellrange(A2) first   
(6 vars, 90 obs)

. 
. cd ../
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. gen flag_fecal_elastase = 1

. 
. rename SampaID sampa_id

. 
. keep sampa_id flag_fecal_elastase

. 
. sort sampa_id

. 
. save `2'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002 saved as .dta format

. 
. frame change sampa

. 
. merge 1:1 sampa_id using `2', keep(match master)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,188
        from master                     2,188  (_merge==1)
        from using                          0  (_merge==2)

    Matched                                90  (_merge==3)
    -----------------------------------------

. 
. drop _merge

. 
end of do-file

. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. do ./do/cr_trypsin.do 

. /*
> cr_trypsin.do                   
> merges trypsinogen
> J Solon
> March 21 2025
> */
. 
. 
. tempfile 1 2 3

. 
. sort sampa_id

. 
. save `1'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000001 saved as .dta format

. 
. ***  reads trypsin
. 
. frame create trypsin

. frame change trypsin

. 
. use  "~/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data/Copenhagen la
> b/data/cohort_temporary_trypsinogen.dta"

. 
. sort sampa_id

. 
. save `2'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002 saved as .dta format

. 
. frame change sampa

. 
. merge 1:1 sampa_id using `2', keepusing(ngml) 

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,971
        from master                     1,965  (_merge==1)
        from using                          6  (_merge==2)

    Matched                               313  (_merge==3)
    -----------------------------------------

. 
. drop if _merge ==2 // _merge ==2 from lab only.  these are individuals with no bmi and dropped from c
> ombined.
(6 observations deleted)

. 
. rename _merge from_trypsin

. 
. label variable from_trypsin "With Copenhagen Lab Trypsin Data"

. 
. rename ngml_trysinogen ngml_trypsinogen

. 
. replace ngml_trypsinogen = 44.03 if ngml_trypsinogen ==4403 // outlier verified by copenhagen lab
(1 real change made)

. 
end of do-file

. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
.  
. do ./do/cr_sample_binary.do             // Generates or recodes ultrasound ct scan and elisa assays a
> s binary with or without samples

. /* 
> cr_sample_binary.do                             // Generates or recodes ultrasound ct scan and elisa 
> assays as binary with or without samples
>                                                                 // Include here the same for presence
>  or absence of functional enzyme assays 
>                                                                 
> Juan Solon
> March 3 2025
> 
> */
. 
. **# Generate recruitment and sample variables
. 
. gen recruited = 1

.         la var recruited "Recruited"

. 
. gen assay_fecal_elastase = 1 if fecal_elastase !=. & fecal_elastase >0
(476 missing values generated)

.         replace assay_fe = 0 if fecal_elastase==. 
(476 real changes made)

.         la var assay_fe "Fecal Elastase"

. 
. gen assay_lipase = 1 if lipase !=. & lipase >0
(1,956 missing values generated)

.         replace assay_lip = 0 if lipase ==.
(1,956 real changes made)

.         la var assay_lip "Lipase"

. 
. /*
> gen assay_amylase = 1 if amylase !=. & amylase >0
>         *replace assay_amylase = 0 if amylase ==.
>         la var assay_amylase "Amylase"
>         
> gen assay_trypsinogen = 1 if trypsinogen !=. & trypsinogen >0
>         *replace assay_trypsinogen = 0 if trypsinogen ==.
>         la var assay_trypsinogen "Trypsinogen"
> */
. 
. **# Create new variables for imaging presence; Do not replace combined
. 
. 
. clonevar radio2 = radio_exam
(513 missing values generated)

.         replace radio2 = 0 if radio_exam==.
(513 real changes made)

.         la var radio2 "Ultrasound"

. 
. clonevar ct2 = ct_scan
(1,627 missing values generated)

.         replace ct2 = 0 if ct_scan==.
(1,627 real changes made)

.         la var ct2 "CT Scan"

. 
. egen radio_mis_dims = rowmiss(pan_head_ap pan_head_trans pan_body_trans pan_tail_trans)

. 
. 
. egen radio_mis_all = rowmiss(pan_size_qual pan_head_trans pan_head_ap pan_body_trans pan_tail_trans p
> an_shape pan_shape_problem pan_shape_prob_specify pan_contour pan_contour_problem pan_contour_prob_sp
> ecify pan_parenchyma pan_paren_inflam pan_paren_fibrosis pan_paren_steatosis pan_duct pan_duct_stones
>  pan_duct_mass pan_calci pan_calci_place pan_cyst_yes pan_oth_abnormal pan_oth_abn_specify)

. 
. clonevar radio3 = radio2

. replace radio3 = 0 if radio_mis_dims ==4
(142 real changes made)

. la var radio3 "USS Scans Visualized"

. 
.         
. gen subset = 0

. replace subset = 1 if radio3==1 | assay_fecal_elastase ==1
(2,124 real changes made)

. la var subset "Analysis Subset (With Fe-1 or USS)"

. 
. gen subset2 = 0

. replace subset2 = 1 if radio3==1 | assay_fecal_elastase ==1 | ct2==1
(2,162 real changes made)

. la var subset2 "Analysis Subset 2 (With Fe-1 or USS or CT Scan)"

. 
. 
end of do-file

.                                                                                 // Include here the s
> ame for presence or absence of functional enzyme assays 
.                                                                                 // Revise once amylas
> e and trypsinogen 
. 
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_categorical_outcomes.do

. /*
> cr_categorical_outcomes.do              
> Sampa
> Imaging Elastase Paper
> 
> Recodes fecal_elastase to with or without EPI and levels of EPI
> Include here any recoding of other functional enzymes
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         01-data
>         02-data-temp
>         03-tables
>         04-do
>         05-figures
>         log 
> */
. 
. egen epi_binary = cut(fecal_elastase), at(0,200,601) icodes
(476 missing values generated)

.         la var epi_binary "EPI"

.         recode epi_binary 0 = 1 1 = 0
(1,802 changes made to epi_binary)

.         
. 
.         label define epi_binary 0 "Without EPI" 1 "With EPI"

.         label values epi_binary epi_binary

.         
. 
. egen epi_ordinal = cut(fecal_elastase), at(0,100,200, 601) icodes
(476 missing values generated)

.         la var epi_ordinal "EPI Levels"

.         recode epi_ordinal 0 = 3 1 = 2 2 = 1 
(1,802 changes made to epi_ordinal)

. 
.         label define epi_ordinal 1 "Without EPI" 2 "Mild-Moderate EPI" 3 "Severe EPI"

.         label values epi_ordinal epi_ordinal

. 
end of do-file

. 
.                                                                                 // Recodes fecal_elas
> tase to with or without EPI and levels of EPI
.                                                                                 // Include here any r
> ecoding of other functional enzymes once that data is in and cut-offs are known
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_categorical_independent.do

. /*
> SAMPA
> cr_categorical_independent.do
> March 3 2025
> J Solon
> 
> Creates categorical variables for indedpendent variables
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         data
>         data-temp
>         tables
>         do
>         figures
>         log 
>         
> */
. 
. * Any radiology variables
. 
. label variable pan_head_ap "Head, AP"

. label variable pan_head_trans  "Head, Transverse" 

. label variable pan_body_trans  "Body, Transverse"

. label variable pan_tail_trans  "Tail, Transverse"

. 
. 
. 
. * Cohort subcategorizations these are for creating graphs 
. 
. generate child = 1 if cohort ==1 | cohort ==2
(1,848 missing values generated)

.         replace child = 2 if cohort ==3 | cohort ==4 | cohort ==5 | cohort ==6
(1,848 real changes made)

.         la var child "Adult or Child Population"

. 
.         label define child 1 "Child" 2 "Adult"

.     label values child child

. 
.         
. generate africa =1 if cohort == 2 | cohort == 3 | cohort ==4
(905 missing values generated)

.         replace africa =2 if cohort == 1 | cohort == 5 | cohort ==6
(905 real changes made)

.         la var africa "Africa or Asia"

. 
.         label define africa 1 "Africa" 2 "Asia"

.         label values africa africa

. 
. 
. generate exposuretime = 1 if cohort ==1 | cohort ==2 | cohort ==6
(1,540 missing values generated)

.         replace exposuretime = 2 if cohort ==4 | cohort ==5 | cohort ==3
(1,540 real changes made)

.         
.         label define exposuretime 1 "Exposure in Childhood" 2 "Exposure as Adults"

.         label values exposuretime exposuretime

.         
.         la var exposuretime "Exposure Time"

.         
. gen fec_cohort = 1 if cohort ==1
(1,956 missing values generated)

.         replace fec_cohort = 2 if cohort == 5
(275 real changes made)

.         replace fec_cohort = 3 if cohort ==6
(308 real changes made)

.         replace fec_cohort = 4 if cohort == 2
(108 real changes made)

.         replace fec_cohort = 5 if cohort ==3
(976 real changes made)

.         replace fec_cohort = 6 if cohort == 4
(289 real changes made)

. 
.         la var fec_cohort "Cohort"

.         label define fec_cohort 1 "DIVIDS" 2 "St-ATT" 3 "CLHNS" 4 "SAM" 5 "CICADA" 6 "NUSTART"

.         label values fec_cohort fec_cohort

. 
. label define ever_mal 0 "NPM" 1 "PM", modify

. label values ever_mal ever_mal

. 
end of do-file

. 
.                                                                                 // Include here any d
> erived variables for imaging that are categorical
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_continuous_independent.do            // Derived variables for imaging that are continuous 
> ; include transformations / weights

. /*
> SAMPA
> cr_continuous_independent.do
> March 3 2025
> J Solon
> 
> Creates continuous variables for Radiology
> 
> Creates pancreatic volumes based on the formula vy Li.
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         01-data
>         02-data-temp
>         03-tables
>         04-do
>         05-figures
>         log 
>         
>         
> */
. 
. * Pancreatic Volume (CT)
. 
. cap drop ct_pan_vol

.         gen ct_pan_vol=((ct_pan_tail_trans+ct_pan_body_trans)/2)*ct_pan_body_tail*ct_pan_cc_body+((ct
> _pan_head_ap/2)^2)*3.14*ct_pan_cc_head
(2,036 missing values generated)

.         cap label variable ct_pan_vol "Calculated Pancreatic Volume; Study"

. 
.         
. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_bo
> dy_tail ct_pan_cc_body ct_pan_cc_head {
  2.         gen adj_wt_`var' = `var'/weight
  3. }
(1,954 missing values generated)
(1,951 missing values generated)
(1,952 missing values generated)
(1,953 missing values generated)
(2,027 missing values generated)
(2,031 missing values generated)
(2,033 missing values generated)

. 
. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_bo
> dy_tail ct_pan_cc_body ct_pan_cc_head {
  2.         gen adj_sqrt_`var' = sqrt(`var')
  3. }               
(1,954 missing values generated)
(1,951 missing values generated)
(1,952 missing values generated)
(1,953 missing values generated)
(2,027 missing values generated)
(2,031 missing values generated)
(2,033 missing values generated)

.         
. * Derived USS Variables 
. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj_wt_`var' = `var'/weight
  3. }
(729 missing values generated)
(882 missing values generated)
(673 missing values generated)
(1,082 missing values generated)

. 
. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj_sqrt_`var' = sqrt(`var')
  3. }               
(724 missing values generated)
(877 missing values generated)
(668 missing values generated)
(1,077 missing values generated)

.         
. 
. 
end of do-file

. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_keep.do 

. 
. local subj1 "record_id cohort sampa_id orgid sex dob age hiv"

. 
. local nutrition "bmi haz bmiz bmi_cat_child bmi_cat weight height"

. 
. local subj2 "indepth_sample indepth_exp ct_sample ct ivgtt_sample ivgtt uss_sample uss ever_mal degre
> e_mal"

. 
. local ses "ses_tercile1 ses_tercile2 ses_tercile3 ses_tercile4 ses_tercile5 comp1 ses_tercile6 ses_te
> rcile"

. 
. local uss "pan_size_qual pan_head_trans pan_head_ap pan_body_trans pan_tail_trans pan_shape pan_shape
> _problem pan_shape_prob_specify pan_contour pan_contour_problem pan_contour_prob_specify pan_parenchy
> ma pan_paren_inflam pan_paren_fibrosis pan_paren_steatosis pan_duct pan_duct_stones pan_duct_mass pan
> _calci pan_calci_place pan_cyst_yes pan_oth_abnormal pan_oth_abn_specify pancreatic"

. 
. local ct "ct_pan_size_qual ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pa
> n_body_tail ct_pan_cc_body ct_pan_cc_head ct_pan_shape ct_pan_shape_problem ct_pan_shape_prob_spec ct
> _pan_contour ct_pan_contour_problem ct_pan_contour_prob_spec ct_pan_parenchyma ct_pan_paren_inflam ct
> _pan_paren_fibrosis ct_pan_paren_steatosis ct_pan_duct ct_pan_duct_stones ct_pan_duct_mass ct_pan_cal
> ci ct_pan_calci_place ct_pan_oth_abnormal ct_pan_oth_abn_spec"

. 
. local derived1 "ct_pan_vol"

. 
. local derived2 "adj_wt_ct_pan_head_trans adj_wt_ct_pan_head_ap adj_wt_ct_pan_body_trans adj_wt_ct_pan
> _tail_trans adj_wt_ct_pan_body_tail adj_wt_ct_pan_cc_body adj_wt_ct_pan_cc_head adj_sqrt_ct_pan_head_
> trans adj_sqrt_ct_pan_head_ap adj_sqrt_ct_pan_body_trans adj_sqrt_ct_pan_tail_trans adj_sqrt_ct_pan_b
> ody_tail adj_sqrt_ct_pan_cc_body adj_sqrt_ct_pan_cc_head adj_wt_pan_head_ap adj_wt_pan_head_trans adj
> _wt_pan_body_trans adj_wt_pan_tail_trans adj_sqrt_pan_head_ap adj_sqrt_pan_head_trans adj_sqrt_pan_bo
> dy_trans adj_sqrt_pan_tail_trans"

. 
. local derived3 "flag_fecal_elastase ngml_trypsinogen from_trypsin recruited assay_fecal_elastase assa
> y_lipase radio2 ct2 radio_mis_dims radio_mis_all radio3 subset subset2 epi_binary epi_ordinal child a
> frica exposuretime fec_cohort"

. 
. local glucose "metformin insulin ogtt_time0 hba1c gluc_mean_mgdl insulin_mean_mul Matsuda_index insul
> inogenic_index rhba1c" 

. 
. local enzymes "fecal_elastase lipase ngml_trypsinogen mgl_crp mgl_cystatin ul_amylp"

. 
. local body "bia fm_kg fm_per ffm_kg ffm_per fmi ffmi impedance bia_prob bia_comment adp adpfm_kg adpf
> fm_kg adpfm_per adpffm_per adp_prob adp_comment"

. 
. local organs "hepatomegaly splenomegaly cholelithiasis steatosis mass gynecologic atherosclerosis nep
> hrolithiasis pancreatic"

. 
. 
. keep `subj1' `subj2' `ses' `uss' `ct' `derived1' `derived2' `derived3' `glucose' `enzymes' `body' `or
> gans'

. 
end of do-file

. 
. notes drop _dta 
  (15 notes dropped)

. note: Created for Imaging Paper on `c(current_date)' at `c(current_time)' by `c(username)'

. note: Trypsin data inserted from temporary dropbox data 

. note: Selected variables kept for this paper in cr_keep.do 

. describe, simple
record_id     ses_tercile6  impedance     pan_paren_~m  ct_pan_bod~s  ngml_tryps~n  adj_wt_ct_~l
cohort        ses_tercile   bia_prob      pan_pa~rosis  ct_pan_tai~s  from_trypsin  adj_wt_ct_~y
sampa_id      hiv           bia_comment   pan_pa~tosis  ct_pan_bod~l  recruited     adj_wt_ct_~d
orgid         metformin     adp           pan_duct      ct_pan_cc_~y  assay_feca~e  adj_sqrt_c..
sex           insulin       adpfm_kg      pan_duct_s~s  ct_pan_cc_~d  assay_lipase  adj_sqrt_c~p
dob           ogtt_time0    adpffm_kg     pan_duct_m~s  ct_pan_shape  radio2        adj_sqrt_c..
age           hba1c         adpfm_per     pan_calci     ct_pan_sha~m  ct2           adj_sqrt_c..
indepth_sa~e  gluc_mean_~l  adpffm_per    pan_calci_~e  ct_pan_sha~c  radio_mis_~s  adj_sqrt_c~l
indepth_exp   insulin_me~l  adp_prob      pan_cyst_yes  ct_pan_con~r  radio_mis_~l  adj_sqrt_c~y
ct_sample     Matsuda_in~x  adp_comment   pan_oth_ab~l  ct_pan_con~m  radio3        adj_sqrt_c~d
ct            insulinoge~x  fecal_elas~e  pan_oth_ab~y  ct_pan_con~c  subset        adj_wt_pan~p
ivgtt_sample  rhba1c        pan_size_q~l  hepatomegaly  ct_pan_par~a  subset2       adj_wt_pan..
ivgtt         lipase        pan_head_t~s  splenomegaly  ct_pan_par~m  epi_binary    adj_wt_pan..
uss_sample    mgl_crp       pan_head_ap   cholelithi~s  ct_pan~rosis  epi_ordinal   adj_wt_pan..
uss           mgl_cystatin  pan_body_t~s  steatosis     ct_pan~tosis  child         adj_sqrt_p~p
ever_mal      ul_amylp      pan_tail_t~s  mass          ct_pan_duct   africa        adj_sqrt_p..
degree_mal    bia           pan_shape     gynecologic   ct_pan_du~es  exposuretime  adj_sqrt_p..
ses_tercile1  fm_kg         pan_shape_~m  atheroscle~s  ct_pan_du~ss  fec_cohort    adj_sqrt_p..
ses_tercile2  fm_per        pan_shape_~y  nephrolith~s  ct_pan_calci  ct_pan_vol
ses_tercile3  ffm_kg        pan_contour   pancreatic    ct_pan_cal~e  adj_wt_ct_..
ses_tercile4  ffm_per       pan_contou~m  ct_pan_siz~l  ct_pan_oth~l  adj_wt_ct_~p
ses_tercile5  fmi           pan_contou~y  ct_pan_hea~s  ct_pan_oth~c  adj_wt_ct_..
comp1         ffmi          pan_parenc~a  ct_pan_hea~p  flag_fecal~e  adj_wt_ct_..

. notes 

_dta:
  1.  Created for Imaging Paper on 22 Mar 2025 at 13:52:35 by juansolon
  2.  Trypsin data inserted from temporary dropbox data
  3.  Selected variables kept for this paper in cr_keep.do

. 
. save ./data-temp/subset_imaging.dta, replace
file ./data-temp/subset_imaging.dta saved

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. dtable fecal_elastase ul_amylp lipase ngml_trypsinogen if subset==1, by(ever_mal, tests) 
note: using test regress across levels of ever_mal for fecal_elastase, ul_amylp, lipase, and
      ngml_trypsinogen.

--------------------------------------------------------------------------------
                                    Ever experience malnutrition?               
                           NPM                PM              Total        Test 
--------------------------------------------------------------------------------
N                       1,095 (51.6%)     1,029 (48.4%)    2,124 (100.0%)       
Fecal Elastase      332.686 (211.491) 360.990 (215.727) 345.236 (213.783)  0.005
Amylase (U/L)         32.391 (13.742)   35.610 (17.845)   33.772 (15.711) <0.001
Lipase                 31.463 (6.154)    31.241 (7.396)    31.280 (7.184)  0.837
Trypsinogen (ng/ml)   26.675 (14.668)   32.900 (33.882)   29.866 (26.470)  0.050
--------------------------------------------------------------------------------

. 
end of do-file

. help dtable

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. 
. dtable if subset==1, by(ever_mal, tests) ///
> continuous(fecal_elastase ul_amylp lipase ngml_trypsinogen, ///
> statistics(mean) test(kwallis))
note: using test kwallis across levels of ever_mal for fecal_elastase, ul_amylp, lipase, and
      ngml_trypsinogen.

---------------------------------------------------------------------
                              Ever experience malnutrition?          
                         NPM            PM           Total      Test 
---------------------------------------------------------------------
N                   1,095 (51.6%) 1,029 (48.4%) 2,124 (100.0%)       
Fecal Elastase            332.686       360.990        345.236  0.005
Amylase (U/L)              32.391        35.610         33.772 <0.001
Lipase                     31.463        31.241         31.280  0.576
Trypsinogen (ng/ml)        26.675        32.900         29.866  0.286
---------------------------------------------------------------------

. 
end of do-file

. sktest ngml_tryp

Skewness and kurtosis tests for normality
                                                             ----- Joint test -----
        Variable |       Obs   Pr(skewness)   Pr(kurtosis)   Adj chi2(2)  Prob>chi2
-----------------+-----------------------------------------------------------------
ngml_trypsinogen |       313         0.0000         0.0000        292.75     0.0000

. regress trypsinogen ever_mal
variable trypsinogen not found
r(111);

. regress ngml_trypsinogen ever_mal

      Source |       SS           df       MS      Number of obs   =       313
-------------+----------------------------------   F(1, 311)       =      4.37
       Model |  2715.41875         1  2715.41875   Prob > F        =    0.0374
    Residual |  193329.432       311  621.638045   R-squared       =    0.0139
-------------+----------------------------------   Adj R-squared   =    0.0107
       Total |  196044.851       312  628.348881   Root MSE        =    24.933

------------------------------------------------------------------------------
ngml_tryps~n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    ever_mal |     5.8923   2.819261     2.09   0.037     .3450631    11.43954
       _cons |   26.22314   2.015687    13.01   0.000     22.25703    30.18925
------------------------------------------------------------------------------

. regress ngml_trypsinogen ever_mal age bmi
variable bmi not found
r(111);

. regress ngml_trypsinogen ever_mal age sex

      Source |       SS           df       MS      Number of obs   =       313
-------------+----------------------------------   F(3, 309)       =      6.18
       Model |  11102.8444         3  3700.94815   Prob > F        =    0.0004
    Residual |  184942.006       309   598.51782   R-squared       =    0.0566
-------------+----------------------------------   Adj R-squared   =    0.0475
       Total |  196044.851       312  628.348881   Root MSE        =    24.465

------------------------------------------------------------------------------
ngml_tryps~n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    ever_mal |   6.015799   2.781884     2.16   0.031     .5419655    11.48963
         age |    .370531   .1207325     3.07   0.002     .1329692    .6080928
         sex |  -4.828645   2.798988    -1.73   0.086    -10.33613    .6788423
       _cons |   17.02383   7.580853     2.25   0.025      2.10721    31.94046
------------------------------------------------------------------------------

. regress ngml_trypsinogen ever_mal age sex cohort

      Source |       SS           df       MS      Number of obs   =       313
-------------+----------------------------------   F(4, 308)       =      6.38
       Model |  15002.9144         4  3750.72861   Prob > F        =    0.0001
    Residual |  181041.936       308  587.798495   R-squared       =    0.0765
-------------+----------------------------------   Adj R-squared   =    0.0645
       Total |  196044.851       312  628.348881   Root MSE        =    24.245

------------------------------------------------------------------------------
ngml_tryps~n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    ever_mal |   5.258331   2.772499     1.90   0.059    -.1971055    10.71377
         age |   .2750096   .1252615     2.20   0.029     .0285331    .5214862
         sex |  -6.365023   2.837213    -2.24   0.026     -11.9478   -.7822498
      cohort |  -3.418207   1.327017    -2.58   0.010    -6.029373   -.8070415
       _cons |   40.06975   11.68276     3.43   0.001     17.08163    63.05787
------------------------------------------------------------------------------

. regress ngml_trypsinogen ever_mal age sex i.cohort

      Source |       SS           df       MS      Number of obs   =       313
-------------+----------------------------------   F(6, 306)       =     11.04
       Model |  34874.1437         6  5812.35729   Prob > F        =    0.0000
    Residual |  161170.707       306  526.701657   R-squared       =    0.1779
-------------+----------------------------------   Adj R-squared   =    0.1618
       Total |  196044.851       312  628.348881   Root MSE        =     22.95

------------------------------------------------------------------------------
ngml_tryps~n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    ever_mal |   3.841189   2.640927     1.45   0.147    -1.355486    9.037864
         age |   .3154288   .1204727     2.62   0.009     .0783691    .5524886
         sex |  -10.39944   2.769189    -3.76   0.000     -15.8485   -4.950377
             |
      cohort |
    NUSTART  |   20.59947   4.175198     4.93   0.000     12.38374     28.8152
      STATT  |   -1.26972   3.945653    -0.32   0.748    -9.033765    6.494326
      CLHNS  |   -2.45063   3.992541    -0.61   0.540    -10.30694     5.40568
             |
       _cons |   25.44781   8.558902     2.97   0.003     8.606056    42.28956
------------------------------------------------------------------------------

. regress ngml_trypsinogen ever_mal age sex i.child
note: 2.child omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =       313
-------------+----------------------------------   F(3, 309)       =      6.18
       Model |  11102.8444         3  3700.94815   Prob > F        =    0.0004
    Residual |  184942.006       309   598.51782   R-squared       =    0.0566
-------------+----------------------------------   Adj R-squared   =    0.0475
       Total |  196044.851       312  628.348881   Root MSE        =    24.465

------------------------------------------------------------------------------
ngml_tryps~n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    ever_mal |   6.015799   2.781884     2.16   0.031     .5419655    11.48963
         age |    .370531   .1207325     3.07   0.002     .1329692    .6080928
         sex |  -4.828645   2.798988    -1.73   0.086    -10.33613    .6788423
             |
       child |
      Adult  |          0  (omitted)
       _cons |   17.02383   7.580853     2.25   0.025      2.10721    31.94046
------------------------------------------------------------------------------

. regress ngml_trypsinogen ever_mal age sex 

      Source |       SS           df       MS      Number of obs   =       313
-------------+----------------------------------   F(3, 309)       =      6.18
       Model |  11102.8444         3  3700.94815   Prob > F        =    0.0004
    Residual |  184942.006       309   598.51782   R-squared       =    0.0566
-------------+----------------------------------   Adj R-squared   =    0.0475
       Total |  196044.851       312  628.348881   Root MSE        =    24.465

------------------------------------------------------------------------------
ngml_tryps~n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    ever_mal |   6.015799   2.781884     2.16   0.031     .5419655    11.48963
         age |    .370531   .1207325     3.07   0.002     .1329692    .6080928
         sex |  -4.828645   2.798988    -1.73   0.086    -10.33613    .6788423
       _cons |   17.02383   7.580853     2.25   0.025      2.10721    31.94046
------------------------------------------------------------------------------

