
. 
. local dataset "All_combined_sampa_data.dta"

. 
. * CHANGE DIRECTORY TO DROPBOX
. 
. cd "$sampadata"
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data/SAMPA

. 
. use "All_combined_sampa_data.dta", clear

. 
. cd "$ghsamparadio"
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. 
. 
. 
end of do-file

. 
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. do ./do/cr_flag_elastase.do             // Flags the elastase samples that should not be analyzed based on ELISA standards ; n = 9
> 0

. /*
> cr_flag_elastase.do                     
> Flags the elastase samples that should not be analyzed based on ELISA standards ; n = 90
> J Solon
> March 3 2025
> 
> Once this flag is made, this has to be added to the analysis dataset
> */
. 
. 
. tempfile 1 2 3

. 
. frame rename default sampa

. sort sampa_id

. 
. save `1'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000001 saved as .dta format

. 
. ***  IMPORT ZAMBIA ELISA DATA (PLATE DROPPED)
. 
. frame create plate

. frame change plate

. 
. cd data-temp
/Users/juansolon/Documents/GitHub/sampa-radio/data-temp

. 
. import excel using "Plate 1 results.xlsx" ,cellrange(A2) first   
(6 vars, 90 obs)

. 
. cd ../
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. gen flag_fecal_elastase = 1

. 
. rename SampaID sampa_id

. 
. keep sampa_id flag_fecal_elastase

. 
. sort sampa_id

. 
. save `2'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002 saved as .dta format

. 
. frame change sampa

. 
. merge 1:1 sampa_id using `2', keep(match master)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,188
        from master                     2,188  (_merge==1)
        from using                          0  (_merge==2)

    Matched                                90  (_merge==3)
    -----------------------------------------

. 
. 
end of do-file

. 
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

.  
. do ./do/cr_sample_binary.do             // Generates or recodes ultrasound ct scan and elisa assays as binary with or without samp
> les

. /* 
> cr_sample_binary.do                             // Generates or recodes ultrasound ct scan and elisa assays as binary with or with
> out samples
>                                                                 // Include here the same for presence or absence of functional enz
> yme assays 
>                                                                 
> Juan Solon
> March 3 2025
> 
> */
. 
. **# Generate recruitment and sample variables
. 
. gen recruited = 1

.         la var recruited "Recruited"

. 
. gen assay_fecal_elastase = 1 if fecal_elastase !=. & fecal_elastase >0
(476 missing values generated)

.         replace assay_fe = 0 if fecal_elastase==. 
(476 real changes made)

.         la var assay_fe "Fecal Elastase"

. 
. gen assay_lipase = 1 if lipase !=. & lipase >0
(1,956 missing values generated)

.         replace assay_lip = 0 if lipase ==.
(1,956 real changes made)

.         la var assay_lip "Lipase"

. 
. /*
> gen assay_amylase = 1 if amylase !=. & amylase >0
>         *replace assay_amylase = 0 if amylase ==.
>         la var assay_amylase "Amylase"
>         
> gen assay_trypsinogen = 1 if trypsinogen !=. & trypsinogen >0
>         *replace assay_trypsinogen = 0 if trypsinogen ==.
>         la var assay_trypsinogen "Trypsinogen"
> */
. 
. **# Create new variables for imaging presence; Do not replace combined
. 
. 
. clonevar radio2 = radio_exam
(513 missing values generated)

.         replace radio2 = 0 if radio_exam==.
(513 real changes made)

.         la var radio2 "Ultrasound"

. 
. clonevar ct2 = ct_scan
(1,627 missing values generated)

.         replace ct2 = 0 if ct_scan==.
(1,627 real changes made)

.         la var ct2 "CT Scan"

. 
. egen radio_mis_dims = rowmiss(pan_head_ap pan_head_trans pan_body_trans pan_tail_trans)

. 
. 
. egen radio_mis_all = rowmiss(pan_size_qual pan_head_trans pan_head_ap pan_body_trans pan_tail_trans pan_shape pan_shape_problem pa
> n_shape_prob_specify pan_contour pan_contour_problem pan_contour_prob_specify pan_parenchyma pan_paren_inflam pan_paren_fibrosis p
> an_paren_steatosis pan_duct pan_duct_stones pan_duct_mass pan_calci pan_calci_place pan_cyst_yes pan_oth_abnormal pan_oth_abn_spec
> ify)

. 
. clonevar radio3 = radio2

. replace radio3 = 0 if radio_mis_dims ==4
(142 real changes made)

. la var radio3 "USS Scans Visualized"

. 
.         
. gen subset = 0

. replace subset = 1 if radio3==1 | assay_fecal_elastase ==1
(2,124 real changes made)

. la var subset "Analysis Subset (With Fe-1 or USS)"

. 
. gen subset2 = 0

. replace subset2 = 1 if radio3==1 | assay_fecal_elastase ==1 | ct2==1
(2,162 real changes made)

. la var subset2 "Analysis Subset 2 (With Fe-1 or USS or CT Scan)"

. 
. 
end of do-file

.                                                                                 // Include here the same for presence or absence o
> f functional enzyme assays 
.                                                                                 // Revise once amylase and trypsinogen 
. 
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_categorical_outcomes.do

. /*
> cr_categorical_outcomes.do              
> Sampa
> Imaging Elastase Paper
> 
> Recodes fecal_elastase to with or without EPI and levels of EPI
> Include here any recoding of other functional enzymes
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         01-data
>         02-data-temp
>         03-tables
>         04-do
>         05-figures
>         log 
> */
. 
. egen epi_binary = cut(fecal_elastase), at(0,200,601) icodes
(476 missing values generated)

.         la var epi_binary "EPI"

.         recode epi_binary 0 = 1 1 = 0
(1,802 changes made to epi_binary)

.         
. 
.         label define epi_binary 0 "Without EPI" 1 "With EPI"

.         label values epi_binary epi_binary

.         
. 
. egen epi_ordinal = cut(fecal_elastase), at(0,100,200, 601) icodes
(476 missing values generated)

.         la var epi_ordinal "EPI Levels"

.         recode epi_ordinal 0 = 3 1 = 2 2 = 1 
(1,802 changes made to epi_ordinal)

. 
.         label define epi_ordinal 1 "Without EPI" 2 "Mild-Moderate EPI" 3 "Severe EPI"

.         label values epi_ordinal epi_ordinal

. 
end of do-file

. 
.                                                                                 // Recodes fecal_elastase to with or without EPI a
> nd levels of EPI
.                                                                                 // Include here any recoding of other functional e
> nzymes once that data is in and cut-offs are known
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_categorical_independent.do

. /*
> SAMPA
> cr_categorical_independent.do
> March 3 2025
> J Solon
> 
> Creates categorical variables for indedpendent variables
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         data
>         data-temp
>         tables
>         do
>         figures
>         log 
>         
> */
. 
. * Any radiology variables
. 
. 
. * Cohort subcategorizations these are for creating graphs 
. 
. generate child = 1 if cohort ==1 | cohort ==2
(1,848 missing values generated)

.         replace child = 2 if cohort ==3 | cohort ==4 | cohort ==5 | cohort ==6
(1,848 real changes made)

.         la var child "Adult or Child Population"

. 
.         label define child 1 "Child" 2 "Adult"

.     label values child child

. 
.         
. generate africa =1 if cohort == 2 | cohort == 3 | cohort ==4
(905 missing values generated)

.         replace africa =2 if cohort == 1 | cohort == 5 | cohort ==6
(905 real changes made)

.         la var africa "Africa or Asia"

. 
.         label define africa 1 "Africa" 2 "Asia"

.         label values africa africa

. 
. 
. generate exposuretime = 1 if cohort ==1 | cohort ==2 | cohort ==6
(1,540 missing values generated)

.         replace exposuretime = 2 if cohort ==4 | cohort ==5 | cohort ==3
(1,540 real changes made)

.         
.         label define exposuretime 1 "Exposure in Childhood" 2 "Exposure as Adults"

.         label values exposuretime exposuretime

.         
.         la var exposuretime "Exposure Time"

.         
. gen fec_cohort = 1 if cohort ==1
(1,956 missing values generated)

.         replace fec_cohort = 2 if cohort == 5
(275 real changes made)

.         replace fec_cohort = 3 if cohort ==6
(308 real changes made)

.         replace fec_cohort = 4 if cohort == 2
(108 real changes made)

.         replace fec_cohort = 5 if cohort ==3
(976 real changes made)

.         replace fec_cohort = 6 if cohort == 4
(289 real changes made)

. 
.         la var fec_cohort "Cohort"

.         label define fec_cohort 1 "DIVIDS" 2 "St-ATT" 3 "CLHNS" 4 "SAM" 5 "CICADA" 6 "NUSTART"

.         label values fec_cohort fec_cohort

. 
. label define ever_mal 0 "NPM" 1 "PM", modify

. label values ever_mal ever_mal

. 
end of do-file

. 
.                                                                                 // Include here any derived variables for imaging 
> that are categorical
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_continuous_independent.do            // Derived variables for imaging that are continuous ; include transformations / w
> eights

. /*
> SAMPA
> cr_continuous_independent.do
> March 3 2025
> J Solon
> 
> Creates continuous variables for Radiology
> 
> Creates pancreatic volumes based on the formula vy Li.
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         01-data
>         02-data-temp
>         03-tables
>         04-do
>         05-figures
>         log 
>         
>         
> */
. 
. * Pancreatic Volume (CT)
. 
. cap drop ct_pan_vol

.         gen ct_pan_vol=((ct_pan_tail_trans+ct_pan_body_trans)/2)*ct_pan_body_tail*ct_pan_cc_body+((ct_pan_head_ap/2)^2)*3.14*ct_pa
> n_cc_head
(2,036 missing values generated)

.         cap label variable ct_pan_vol "Calculated Pancreatic Volume; Study"

. 
.         
. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_cc_body ct_pan
> _cc_head {
  2.         gen adj_wt_`var' = `var'/weight
  3. }
(1,954 missing values generated)
(1,951 missing values generated)
(1,952 missing values generated)
(1,953 missing values generated)
(2,027 missing values generated)
(2,031 missing values generated)
(2,033 missing values generated)

. 
. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_cc_body ct_pan
> _cc_head {
  2.         gen adj_sqrt_`var' = sqrt(`var')
  3. }               
(1,954 missing values generated)
(1,951 missing values generated)
(1,952 missing values generated)
(1,953 missing values generated)
(2,027 missing values generated)
(2,031 missing values generated)
(2,033 missing values generated)

.         
. * Derived USS Variables 
. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj_wt_`var' = `var'/weight
  3. }
(729 missing values generated)
(882 missing values generated)
(673 missing values generated)
(1,082 missing values generated)

. 
. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj_sqrt_`var' = sqrt(`var')
  3. }               
(724 missing values generated)
(877 missing values generated)
(668 missing values generated)
(1,077 missing values generated)

.         
. 
. 
end of do-file

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. set scheme tab2

. gr bar fecal_elastase, over(ever_mal)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. gr box fecal_elastase, over(ever_mal) over(cohort)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. set scheme stmono
scheme stmono not found
r(111);

end of do-file

r(111);

. schemes dir
command schemes is unrecognized
r(199);

. help set scheme

. query graphics
------------------------------------------------------------------------------------------------------------------------------------
    Graphics settings
      set graphics         on
      set scheme           tab2
      set printcolor       asis       may be automatic, asis, gs1, gs2, gs3
      set copycolor        asis       may be automatic, asis, gs1, gs2, gs3
      set maxbezierpath    0          bezier path elements

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. set scheme stcolor 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. gr box fecal_elastase, over(ever_mal) over(cohort)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. set scheme sj

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. gr box fecal_elastase, over(ever_mal) over(cohort)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. set scheme stsj

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. gr box fecal_elastase, over(ever_mal) over(cohort)

. 
end of do-file

. graph query

Styles used in graph options are

    addedlinestyle      clockposstyle                           linepatternstyle    pstyle              tickstyle
    alignmentstyle      colorstyle          gridstyle           linewidthstyle                           
    anglestyle          compassdirstyle                                             ringposstyle        zyx2style
    areastyle           connectstyle        hrulestyle          marginstyle                             zyx2rulestyle
    arrowstyle                                                  markerstyle         sizetypestyle       zyx2typestyle
    arrowdirstyle       fpcolstyle          justificationstyle  markerlabelstyle    sunflowertypestyle
                        fpcolnamestyle                          markersizestyle     symbolstyle
    bystyle             fpgraphstyle        legendstyle                              
                        functionstyle       linestyle           orientationstyle    textboxstyle
    clegendstyle        functiontypestyle   linealignmentstyle                      textsizestyle

    To find out more about a style, type -graph query <stylename>-; for instance, -graph query alignmentstyle-.  (You may omit the
    "style" on the end.)

. query graph
------------------------------------------------------------------------------------------------------------------------------------
    Graphics settings
      set graphics         on
      set scheme           stsj
      set printcolor       asis       may be automatic, asis, gs1, gs2, gs3
      set copycolor        asis       may be automatic, asis, gs1, gs2, gs3
      set maxbezierpath    0          bezier path elements

. tab cohort

     Cohort |      Freq.     Percent        Cum.
------------+-----------------------------------
     DIVIDS |        322       14.14       14.14
        SAM |        108        4.74       18.88
     CICADA |        976       42.84       61.72
    NUSTART |        289       12.69       74.41
      STATT |        275       12.07       86.48
      CLHNS |        308       13.52      100.00
------------+-----------------------------------
      Total |      2,278      100.00

. d cohort

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------------------
cohort          byte    %8.0g      cohort     Cohort

. label value list cohort
variable list not found
r(111);

. label list cohort
cohort:
           1 DIVIDS
           2 SAM
           3 CICADA
           4 NUSTART
           5 STATT
           6 CLHNS

. pwd
/Users/juansolon/Documents/GitHub/sampa-radio

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. 
. local c "1"

. 
. gr box fecal_elastase if cohort ==`c', over(ever_mal)

. gr save ./figures/ `c'
. invalid name
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. local c "1"

. 
. gr box fecal_elastase if cohort ==`c', over(ever_mal) title(`c')

. gr save ./figures/ `c'
. invalid name
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. 
. forvalues c = 1/6 {
  2.     // Get the label of the value stored in local c
.     local lbl_cohort : label cohort `c'
  3. 
.     // Generate the box plot with the correct title
.     gr box fecal_elastase if cohort == `c', over(ever_mal) title("`lbl_cohort'")
  4. }

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. forvalues c = 1/6 {
  2.     // Get the label of the value stored in local c
.     local grtitle : label cohort `c'
  3. 
.     // Generate the box plot with the correct title
.     gr box fecal_elastase if cohort == `c', over(ever_mal) title("`grtitle'")
  4. 
unexpected end of file
r(612);

end of do-file

r(612);
. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. 
. forvalues c = 1/6 {
  2.     // Get the label of the value stored in local c
.     local grtitle : label cohort `c'
  3. 
.     // Generate the box plot with the correct title
.     gr box fecal_elastase if cohort == `c', over(ever_mal) title("`grtitle'")
  4. }

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. 
. local i = 1 // Initialize a counter for graph positions

. forvalues c = 1/6 {
  2.     // Get the label of the value stored in local c
.     local grtitle : label cohort `c'
  3. 
.     // Generate the box plot with the correct title
.     gr box fecal_elastase if cohort == `c', over(ever_mal) title("`grtitle'")
  4. 
.     // Save the graph to a temporary file
.     tempfile temp_graph_`i'
  5.     gr save "`temp_graph_`i''", replace
  6. 
.     // Append the temporary graph file name to the graphlist
.     local graphlist "`graphlist' `temp_graph_`i''"
  7. 
.     local i = `i' + 1 // Increment the counter
  8. }
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000001 not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000001 saved as .gph format
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002 not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002 saved as .gph format
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003 not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003 saved as .gph format
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004 not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004 saved as .gph format
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005 not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005 saved as .gph format
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006 not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006 saved as .gph format

. 
. // Combine the graphs
. gr combine `graphlist' , rows(2) cols(3) // Adjust rows and columns as needed
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000001 is not a memory graph
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. 
. tempfile graphlist

. 
. local i = 1

. forvalues c = 1/6 {
  2.     local grtitle : label cohort `c'
  3.     gr box fecal_elastase if cohort == `c', over(ever_mal) title("`grtitle'")
  4. 
.     tempfile temp_graph_`i'
  5.     gr save "`temp_graph_`i''.gph", replace // Added .gph extension
  6. 
.     display "`temp_graph_`i''.gph" // Check the file names
  7. 
.     local graphlist "`graphlist' `temp_graph_`i''.gph"
  8. 
.     local i = `i' + 1
  9. }
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph

. 
. display "`graphlist'" // Check the graphlist content
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000001 /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gp
> h /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.0
> 00004.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S
> _77831.000006.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph

. 
. gr combine `graphlist', rows(2) cols(3)
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000001 is not a memory graph
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. tempfile graphlist

. 
. local i = 1

. forvalues c = 0/5 { // start c at 0, and increment to 5.
  2.     local grtitle : label cohort `i'
  3.     gr box fecal_elastase if cohort == `i', over(ever_mal) title("`grtitle'")
  4. 
.     tempfile temp_graph_`i'
  5.     gr save "`temp_graph_`i''.gph", replace
  6. 
.     display "`temp_graph_`i''.gph"
  7. 
.     local graphlist "`graphlist' `temp_graph_`i''.gph"
  8. 
.     local i = `i' + 1
  9. }
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph

. 
. display "`graphlist'"
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000001 /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gp
> h /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.0
> 00004.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S
> _77831.000006.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph

. 
. gr combine `graphlist', rows(2) cols(3)
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000001 is not a memory graph
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. 
. tempfile graphlist

. local graphlist "" // Clear the graphlist

. local i = 1

. forvalues c = 0/5 {
  2.     local grtitle : label cohort `i'
  3.     gr box fecal_elastase if cohort == `i', over(ever_mal) title("`grtitle'")
  4. 
.     tempfile temp_graph_`i'
  5.     gr save "`temp_graph_`i''.gph", replace
  6. 
.     display "`temp_graph_`i''.gph"
  7. 
.     local graphlist "`graphlist' `temp_graph_`i''.gph"
  8. 
.     local i = `i' + 1
  9. }
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph

. 
. display "`graphlist'"
 /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.0000
> 03.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77
> 831.000005.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq
> /T//S_77831.000007.gph

. 
. gr combine `graphlist', rows(2) cols(3)

. gr save "./figures/combined_cohorts", replace
(file ./figures/combined_cohorts not found)
file ./figures/combined_cohorts saved as .gph format

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. gr export ./figures/figc.png, as(png), replace
invalid 'replace' 
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. gr export ./figures/figc.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc.png saved as PNG format

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. 
. tempfile graphlist

. local graphlist ""

. local i = 1

. 
. local cohort_order "2 4 3 1 6 5" // Define the desired order

. 
. foreach c of local cohort_order {
  2.     local grtitle : label cohort `c'
  3.     gr box fecal_elastase if cohort == `c', over(ever_mal) title("`grtitle'")
  4. 
.     tempfile temp_graph_`i'
  5.     gr save "`temp_graph_`i''.gph", replace
  6. 
.     display "`temp_graph_`i''.gph"
  7. 
.     local graphlist "`graphlist' `temp_graph_`i''.gph"
  8. 
.     local i = `i' + 1
  9. }
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph

. 
. display "`graphlist'"
 /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.0000
> 03.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77
> 831.000005.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq
> /T//S_77831.000007.gph

. 
. gr combine `graphlist', rows(2) cols(3)

. gr save "./figures/rearranged_cohorts", replace
(file ./figures/rearranged_cohorts not found)
file ./figures/rearranged_cohorts saved as .gph format

. gr export ./figures/figc.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc.png saved as PNG format

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. table (cohort)(ever_mal), statistic(p50 bmi)

----------------------------------------------
          |    Ever experience malnutrition?  
          |        NPM          PM       Total
----------+-----------------------------------
Cohort    |                                   
  DIVIDS  |   15.80519    16.65415    16.52128
  SAM     |   17.13926    16.04976    16.61598
  CICADA  |   23.78912    19.28991    22.11643
  NUSTART |   24.49827    19.44582    20.66748
  STATT   |   22.33705    17.76748    20.17637
  CLHNS   |   27.53525    24.01217    26.63289
  Total   |     23.749    18.79287    21.17615
----------------------------------------------

. 
end of do-file

. d hba*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------------------
hba1c           float   %9.0g                 Hba1c result [%] from baseline sample In OGTT

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. table (cohort)(ever_mal), statistic(p50 bmi hba1c)

--------------------------------------------------------------------------------------
                                                  |    Ever experience malnutrition?  
                                                  |        NPM          PM       Total
--------------------------------------------------+-----------------------------------
Cohort                                            |                                   
  DIVIDS                                          |                                   
    Body mass index                               |   15.80519    16.65415    16.52128
    Hba1c result [%] from baseline sample In OGTT |        5.3         5.3         5.3
  SAM                                             |                                   
    Body mass index                               |   17.13926    16.04976    16.61598
    Hba1c result [%] from baseline sample In OGTT |        5.3         5.2         5.2
  CICADA                                          |                                   
    Body mass index                               |   23.78912    19.28991    22.11643
    Hba1c result [%] from baseline sample In OGTT |        5.6         5.8         5.7
  NUSTART                                         |                                   
    Body mass index                               |   24.49827    19.44582    20.66748
    Hba1c result [%] from baseline sample In OGTT |        5.4         5.2         5.3
  STATT                                           |                                   
    Body mass index                               |   22.33705    17.76748    20.17637
    Hba1c result [%] from baseline sample In OGTT |          5         4.8         4.9
  CLHNS                                           |                                   
    Body mass index                               |   27.53525    24.01217    26.63289
    Hba1c result [%] from baseline sample In OGTT |        5.6         5.6         5.6
  Total                                           |                                   
    Body mass index                               |     23.749    18.79287    21.17615
    Hba1c result [%] from baseline sample In OGTT |        5.5         5.4         5.4
--------------------------------------------------------------------------------------

. 
end of do-file

. scatter fecal_elastase bmi

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. tempfile graphlist

. local graphlist ""

. local i = 1

. 
. local cohort_order "2 4 3 1 6 5" // Define the desired order

. 
. foreach c of local cohort_order {
  2.     local grtitle : label cohort `c'
  3.     
.         gr box fecal_elastase if cohort == `c', over(ever_mal) title("`grtitle'") ///
>         ytitle("Faecal Elastase (mcg/g)")
  4. 
.     tempfile temp_graph_`i'
  5.     gr save "`temp_graph_`i''.gph", replace
  6. 
.     display "`temp_graph_`i''.gph"
  7. 
.     local graphlist "`graphlist' `temp_graph_`i''.gph"
  8. 
.     local i = `i' + 1
  9. }
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000003.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000005.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000007.gph

. 
. display "`graphlist'"
 /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.0000
> 03.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000004.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77
> 831.000005.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000006.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq
> /T//S_77831.000007.gph

. 
. gr combine `graphlist', rows(2) cols(3)

. 
. gr save "./figures/rearranged_cohorts", replace
file ./figures/rearranged_cohorts saved as .gph format

. 
. gr export ./figures/figc.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc.png saved as PNG format

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. gr box pan_body_trans, over(ever_mal) over(cohort)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. local uss "pan_head_ap pan_head_trans pan_tail_trans pan_body_trans"

. 
. d `uss'

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------------------
pan_head_ap     float   %9.0g                 Pancreas head size measured in anterior/posterior dimension
pan_head_trans  float   %9.0g                 Pancreas head size measured in transverse dimension
pan_tail_trans  float   %9.0g                 Pancreas tail size measure in anterior/posterior dimension
pan_body_trans  float   %9.0g                 Pancreas body size measures in anterior/posterior dimension; maximum diameter

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. label variable pan_head_ap "Head, AP (mm)"

. label variable pan_head_trans  "Head, Transverse (mm)" 

. label variable pan_body_trans  "Body, Transverse (mm)"

. label variable pan_tail_trans  "Tail, Transverse (mm)"

. 
end of do-file

