
. 
. local dataset "All_combined_sampa_data.dta"

. 
. * CHANGE DIRECTORY TO DROPBOX
. 
. cd "$sampadata"
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data/SAMPA

. 
. use "All_combined_sampa_data.dta", clear

. 
. frame rename default sampa

. cd "$ghsamparadio"
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. 
. 
. 
end of do-file

. 
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. do ./do/cr_flag_elastase.do             // Flags the elastase samples that should not be analyzed based on ELISA standards ;
>  n = 90

. /*
> cr_flag_elastase.do                     
> Flags the elastase samples that should not be analyzed based on ELISA standards ; n = 90
> J Solon
> March 3 2025
> 
> Once this flag is made, this has to be added to the analysis dataset
> */
. 
. 
. tempfile 1 2 3

. 
. sort sampa_id

. 
. save `1'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_00730.000001 saved as .dta format

. 
. ***  IMPORT ZAMBIA ELISA DATA (PLATE DROPPED)
. 
. frame create plate

. frame change plate

. 
. cd data-temp
/Users/juansolon/Documents/GitHub/sampa-radio/data-temp

. 
. import excel using "Plate 1 results.xlsx" ,cellrange(A2) first   
(6 vars, 90 obs)

. 
. cd ../
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. gen flag_fecal_elastase = 1

. 
. rename SampaID sampa_id

. 
. keep sampa_id flag_fecal_elastase

. 
. sort sampa_id

. 
. save `2'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_00730.000002 saved as .dta format

. 
. frame change sampa

. 
. merge 1:1 sampa_id using `2', keep(match master)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,186
        from master                     2,186  (_merge==1)
        from using                          0  (_merge==2)

    Matched                                90  (_merge==3)
    -----------------------------------------

. 
. drop _merge

. 
end of do-file

. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. *do ./do/cr_trypsin.do                          // Adds trypsinogen
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

.   
. do ./do/cr_diabetes.do 

. /* 
> cr_diabetes.do
> Creates derived variables for diabetes 
> from hba1c and glucose 120 as reported in the primary paper
> */
. *===== HbA1c =====
. 
. *HbA1c categories for diabetes
. recode hba1c (0/5.6=0) (5.7/6.4=1) (6.5/15=2), gen (hba1c_cat)
(2,245 differences between hba1c and hba1c_cat)

. label define hba1c_cat 0 "Normal" 1 "Prediabetes" 2 "Diabetes"

. label values hba1c_cat hba1c_cat

. 
. *===== Glucose 120 min =====
. 
. * Glucose 120 min categories for diabetes
. recode mmol_glu120 (0/7.79=0) (7.8/11.09=1) (11.1/40.0=2), gen (glu120_cat)
(2,265 differences between mmol_glu120 and glu120_cat)

. label define glu120_cat 0 "Normal" 1 "Prediabetes" 2 "Diabetes"

. label values glu120_cat glu120_cat

. 
. *===== Union =====
. 
. * Either Hba1c or glu_120 categories for diabetes
. gen diab_hb_gl120 = 2 if glu120_cat ==2 | hba1c_cat ==2
(1,910 missing values generated)

. replace diab_hb_gl120 = 1 if glu120_cat ==1 & hba1c_cat ==1
(125 real changes made)

. replace diab_hb_gl120 = 0 if glu120_cat ==0 & hba1c_cat ==0
(1,129 real changes made)

. 
. label define diab_hb_gl120  0 "Normal" 1 "Prediabetes" 2 "Diabetes"

. label values diab_hb_gl120 diab_hb_gl120

. 
. 
. /*
> **# Checking for repeat OGTT
> preserve
> clear
> 
> set more off
> // Set up the working directory
> // Determine if the person running the do-file is in the Dropbox Working Group
> // or using an individual one
> cap confirm file "~/Cox working group Dropbox/"
> if _rc == 0 global dropbox = "~/Cox working group Dropbox/TB Nutrition working group/SAMPA/Data Monitoring"
> else global dropbox = "~/Dropbox/Data Monitoring/"
> 
> cd "$dropbox/data"
> 
> clear
> use "./SAMPA/All_combined_sampa_data.dta"
> 
> *===== HbA1c =====
> *HbA1c categories for diabetes
> recode hba1c (0/5.6=0) (5.7/6.4=1) (6.5/15=2), gen (hba1c_cat)
> label define hba1c_cat 0 "Normal" 1 "Prediabetes" 2 "Diabetes"
> label values hba1c_cat hba1c_cat
> 
> *===== Glucose 120 min =====
> * Glucose 120 min categories for diabetes
> recode mmol_glu120 (0/7.79=0) (7.8/11.09=1) (11.1/40.0=2), gen (glu120_cat)
> label define glu120_cat 0 "Normal" 1 "Prediabetes" 2 "Diabetes"
> label values glu120_cat glu120_cat
> 
> *===== Union =====
> * Either Hba1c or glu_120 categories for diabetes
> gen diab_hb_gl120 = 2 if glu120_cat ==2 | hba1c_cat ==2
> replace diab_hb_gl120 = 1 if glu120_cat ==1 & hba1c_cat ==1
> replace diab_hb_gl120 = 0 if glu120_cat ==0 & hba1c_cat ==0
> 
> label define diab_hb_gl120  0 "Normal" 1 "Prediabetes" 2 "Diabetes"
> label values diab_hb_gl120 diab_hb_gl120
> 
> label define ogttr_confirm  0 "No" 1 "Yes" 
> label values ogttr_confirm ogttr_confirm
> 
> // 4a vs 4b
> tab repeat_test_needed ogttr_confirm, m row col
> bysort cohort: tab repeat_test_needed ogttr_confirm, m row col
> 
> // 4a needs repeat ogtt vs repeat ogtt form 
> tab ogttr_confirm if repeat_test_needed==1, m 
> bysort cohort: tab ogttr_confirm if repeat_test_needed==1, m 
> 
> // Repeat test needed vs diab def 
> tab repeat_test_needed diab_hb_gl120 , m row col
> bysort cohort: tab repeat_test_needed diab_hb_gl120 , m row col
> 
> // Repeat test done vs diab def 
> table (cohort ogttr_confirm) (diab_hb_gl120) ,m nototals
> bysort cohort: tab ogttr_confirm diab_hb_gl120 , m row col
> 
> // Repeat test done vs diab def 
> bysort cohort: tab repeat_test_needed ogttr_confirm if diab_hb_gl120==2, m row col
> 
> // defined as diabetic but did not do a repeat OGTT
> br cohort sampa_id orgid diab rec_diab hba1c glu0 mmol_glu0 repeat_test_needed if diab_hb_gl120==2 & repeat_test_needed==0 
> 
> // defined as diabetic but did not do a repeat OGTT
> br cohort sampa_id orgid diab rec_diab hba1c glu0 mmol_glu0 repeat_test_needed if diab_hb_gl120==2 & repeat_test_needed==1
> tab rec_diab diab if diab_hb_gl120==2 & repeat_test_needed==1 & ogttr_confirm==., m
> 
> 
> restore
> 
> 
> 

end of do-file

.  
. *do ./do/cr_amylase.do                          // Adds amylase
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
.  
. do ./do/cr_sample_binary.do             // Generates or recodes ultrasound ct scan and elisa assays as binary with or withou
> t samples

. /* 
> cr_sample_binary.do                             // Generates or recodes ultrasound ct scan and elisa assays as binary with o
> r without samples
>                                                                 // Include here the same for presence or absence of function
> al enzyme assays 
>                                                                 
> Juan Solon
> March 3 2025
> 
> */
. 
. **# Generate recruitment and sample variables
. 
. gen recruited = 1

.         la var recruited "Recruited"

. 
. gen assay_fecal_elastase = 1 if fecal_elastase !=. & fecal_elastase >0
(476 missing values generated)

.         replace assay_fe = 0 if fecal_elastase==. 
(476 real changes made)

.         la var assay_fe "Fecal Elastase Assay"

. 
. gen assay_lipase = 1 if lipase !=. & lipase >0
(1,954 missing values generated)

.         replace assay_lip = 0 if lipase ==.
(1,954 real changes made)

.         la var assay_lip "Lipase Assay"

. 
. gen assay_amylase = 1 if ul_amylp   !=. & ul_amylp   >0
(375 missing values generated)

.         *replace assay_amylase = 0 if amylase ==.
.         la var assay_amylase "Amylase Assay"

.         
. gen assay_trypsinogen = 1 if ngml_trypsinogen !=. & ngml_trypsinogen >0
(1,963 missing values generated)

.         *replace assay_trypsinogen = 0 if trypsinogen ==.
.         la var assay_trypsinogen "Trypsinogen Assay"

. */
. 
. **# Create new variables for imaging presence; Do not replace combined
. 
. 
. clonevar radio2 = radio_exam
(513 missing values generated)

.         replace radio2 = 0 if radio_exam==.
(513 real changes made)

.         la var radio2 "Ultrasound"

. 
. clonevar ct2 = ct_scan
(1,625 missing values generated)

.         replace ct2 = 0 if ct_scan==.
(1,625 real changes made)

.         la var ct2 "CT Scan"

. 
. egen radio_mis_dims = rowmiss(pan_head_ap pan_head_trans pan_body_trans pan_tail_trans)

. 
. 
. egen radio_mis_all = rowmiss(pan_size_qual pan_head_trans pan_head_ap pan_body_trans pan_tail_trans pan_shape pan_shape_prob
> lem pan_shape_prob_specify pan_contour pan_contour_problem pan_contour_prob_specify pan_parenchyma pan_paren_inflam pan_pare
> n_fibrosis pan_paren_steatosis pan_duct pan_duct_stones pan_duct_mass pan_calci pan_calci_place pan_cyst_yes pan_oth_abnorma
> l pan_oth_abn_specify)

. 
. clonevar radio3 = radio2

. replace radio3 = 0 if radio_mis_dims ==4
(142 real changes made)

. la var radio3 "USS Scans Visualized"

. 
.         
. gen subset = 0

. replace subset = 1 if radio3==1 | assay_fecal_elastase ==1
(2,122 real changes made)

. la var subset "Analysis Subset (With Fe-1 or USS)"

. 
. gen subset2 = 0

. replace subset2 = 1 if radio3==1 | assay_fecal_elastase ==1 | ct2==1
(2,160 real changes made)

. la var subset2 "Analysis Subset 2 (With Fe-1 or USS or CT Scan)"

. 
. 
end of do-file

.                                                                                 // Include here the same for presence or abs
> ence of functional enzyme assays 
.                                                                                 // Revise once amylase and trypsinogen 
. 
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_categorical_outcomes.do

. /*
> cr_categorical_outcomes.do              
> Sampa
> Imaging Elastase Paper
> 
> Recodes fecal_elastase to with or without EPI and levels of EPI
> Include here any recoding of other functional enzymes
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         01-data
>         02-data-temp
>         03-tables
>         04-do
>         05-figures
>         log 
> */
. 
. egen epi_binary = cut(fecal_elastase), at(0,200,601) icodes
(476 missing values generated)

.         la var epi_binary "EPI"

.         recode epi_binary 0 = 1 1 = 0
(1,800 changes made to epi_binary)

.         
. 
.         label define epi_binary 0 "Without EPI" 1 "With EPI"

.         label values epi_binary epi_binary

.         
. 
. egen epi_ordinal = cut(fecal_elastase), at(0,100,200, 601) icodes
(476 missing values generated)

.         la var epi_ordinal "EPI Levels"

.         recode epi_ordinal 0 = 3 1 = 2 2 = 1 
(1,800 changes made to epi_ordinal)

. 
.         label define epi_ordinal 1 "Without EPI" 2 "Mild-Moderate EPI" 3 "Severe EPI"

.         label values epi_ordinal epi_ordinal

. 
end of do-file

. 
.                                                                                 // Recodes fecal_elastase to with or without
>  EPI and levels of EPI
.                                                                                 // Include here any recoding of other functi
> onal enzymes once that data is in and cut-offs are known
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_categorical_independent.do

. /*
> SAMPA
> cr_categorical_independent.do
> March 3 2025
> J Solon
> 
> Creates categorical variables for indedpendent variables
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         data
>         data-temp
>         tables
>         do
>         figures
>         log 
>         
> */
. 
. * Any radiology variables
. 
. label variable pan_head_ap "Head, AP"

. label variable pan_head_trans  "Head, Transverse" 

. label variable pan_body_trans  "Body, Transverse"

. label variable pan_tail_trans  "Tail, Transverse"

. 
. 
. 
. * Cohort subcategorizations these are for creating graphs 
. 
. generate child = 1 if cohort ==1 | cohort ==2
(1,846 missing values generated)

.         replace child = 2 if cohort ==3 | cohort ==4 | cohort ==5 | cohort ==6
(1,846 real changes made)

.         la var child "Adult or Child Population"

. 
.         label define child 1 "Child" 2 "Adult"

.     label values child child

. 
.         
. generate africa =1 if cohort == 2 | cohort == 3 | cohort ==4
(905 missing values generated)

.         replace africa =2 if cohort == 1 | cohort == 5 | cohort ==6
(905 real changes made)

.         la var africa "Africa or Asia"

. 
.         label define africa 1 "Africa" 2 "Asia"

.         label values africa africa

. 
. 
. generate exposuretime = 1 if cohort ==1 | cohort ==2 | cohort ==6
(1,538 missing values generated)

.         replace exposuretime = 2 if cohort ==4 | cohort ==5 | cohort ==3
(1,538 real changes made)

.         
.         label define exposuretime 1 "Exposure in Childhood" 2 "Exposure as Adults"

.         label values exposuretime exposuretime

.         
.         la var exposuretime "Exposure Time"

.         
. gen fec_cohort = 1 if cohort ==1
(1,954 missing values generated)

.         replace fec_cohort = 2 if cohort == 5
(275 real changes made)

.         replace fec_cohort = 3 if cohort ==6
(308 real changes made)

.         replace fec_cohort = 4 if cohort == 2
(108 real changes made)

.         replace fec_cohort = 5 if cohort ==3
(974 real changes made)

.         replace fec_cohort = 6 if cohort == 4
(289 real changes made)

. 
.         la var fec_cohort "Cohort"

.         label define fec_cohort 1 "DIVIDS" 2 "St-ATT" 3 "CLHNS" 4 "SAM" 5 "CICADA" 6 "NUSTART"

.         label values fec_cohort fec_cohort

. 
. label define ever_mal 0 "NPM" 1 "PM", modify

. label values ever_mal ever_mal

. 
end of do-file

. 
.                                                                                 // Include here any derived variables for im
> aging that are categorical
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_continuous_independent.do            // Derived variables for imaging that are continuous ; include transformatio
> ns / weights

. /*
> SAMPA
> cr_continuous_independent.do
> March 3 2025
> J Solon
> 
> Creates continuous variables for Radiology
> 
> Creates pancreatic volumes based on the formula vy Li.
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         01-data
>         02-data-temp
>         03-tables
>         04-do
>         05-figures
>         log 
>         
>         
> */
. 
. * Pancreatic Volume (CT)
. 
. cap drop ct_pan_vol

.         gen ct_pan_vol=((ct_pan_tail_trans+ct_pan_body_trans)/2)*ct_pan_body_tail*ct_pan_cc_body+((ct_pan_head_ap/2)^2)*3.14
> *ct_pan_cc_head
(2,034 missing values generated)

.         cap label variable ct_pan_vol "Calculated Pancreatic Volume; Study"

. 
.         
. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_cc_body 
> ct_pan_cc_head ct_pan_vol {
  2.         gen adj_wt_`var' = `var'/weight
  3. }
(1,952 missing values generated)
(1,949 missing values generated)
(1,950 missing values generated)
(1,951 missing values generated)
(2,025 missing values generated)
(2,029 missing values generated)
(2,031 missing values generated)
(2,034 missing values generated)

. 
. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_cc_body 
> ct_pan_cc_head ct_pan_vol {
  2.         gen adj_sqrt_`var' = sqrt(`var')
  3. }               
(1,952 missing values generated)
(1,949 missing values generated)
(1,950 missing values generated)
(1,951 missing values generated)
(2,025 missing values generated)
(2,029 missing values generated)
(2,031 missing values generated)
(2,034 missing values generated)

.         
. * Derived USS Variables 
. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj_wt_`var' = `var'/weight
  3. }
(729 missing values generated)
(882 missing values generated)
(673 missing values generated)
(1,080 missing values generated)

. 
. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj_sqrt_`var' = sqrt(`var')
  3. }               
(724 missing values generated)
(877 missing values generated)
(668 missing values generated)
(1,075 missing values generated)

.         
. 
. 
end of do-file

. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_labels.do                                    // Adds additional labels

. /* cr_labels.do 
> Sampa 
> March 25 2025
> 
> Juan Solon
> 
> */
. 
. label variable fecal_elastase "Fecal Elastase (ug/g)"

. label variable lipase "Lipase (U/L)"

. 
end of do-file

. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_keep.do 

. 
. local subj1 "record_id cohort sampa_id orgid sex dob age hiv"

. 
. local nutrition "bmi haz bmiz bmi_cat_child bmi_cat weight height muac waist hip"

. 
. local subj2 "indepth_sample indepth_exp ct_sample ct ivgtt_sample ivgtt uss_sample uss ever_mal degree_mal"

. 
. local ses "ses_tercile"

. 
. local uss "radio_exam pan_size_qual pan_head_trans pan_head_ap pan_body_trans pan_tail_trans pan_shape pan_shape_problem pan
> _shape_prob_specify pan_contour pan_contour_problem pan_contour_prob_specify pan_parenchyma pan_paren_inflam pan_paren_fibro
> sis pan_paren_steatosis pan_duct pan_duct_stones pan_duct_mass pan_calci pan_calci_place pan_cyst_yes pan_oth_abnormal pan_o
> th_abn_specify pancreatic"

. 
. local ct "ct_pan_size_qual ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_cc_b
> ody ct_pan_cc_head ct_pan_shape ct_pan_shape_problem ct_pan_shape_prob_spec ct_pan_contour ct_pan_contour_problem ct_pan_con
> tour_prob_spec ct_pan_parenchyma ct_pan_paren_inflam ct_pan_paren_fibrosis ct_pan_paren_steatosis ct_pan_duct ct_pan_duct_st
> ones ct_pan_duct_mass ct_pan_calci ct_pan_calci_place ct_pan_oth_abnormal ct_pan_oth_abn_spec"

. 
. local derived1 "ct_pan_vol"

. 
. local adjwt_uss "adj_wt_pan_head_ap adj_wt_pan_head_trans adj_wt_pan_body_trans adj_wt_pan_tail_trans"  

. 
. local adjsq_uss "adj_sqrt_pan_head_ap adj_sqrt_pan_head_trans adj_sqrt_pan_body_trans adj_sqrt_pan_tail_trans"  

. 
. local adjwt_ct "adj_wt_ct_pan_head_ap adj_wt_ct_pan_head_trans adj_wt_ct_pan_body_trans adj_wt_ct_pan_tail_trans adj_wt_ct_p
> an_body_tail adj_wt_ct_pan_vol"  

. 
. local adjsq_ct "adj_sqrt_ct_pan_head_ap adj_sqrt_ct_pan_head_trans adj_sqrt_ct_pan_body_trans adj_sqrt_ct_pan_tail_trans adj
> _sqrt_ct_pan_body_tail adj_sqrt_ct_pan_vol"  

. 
. 
. 
. 
. /*local derived2 "adj_wt_ct_pan_head_trans adj_wt_ct_pan_head_ap adj_wt_ct_pan_body_trans adj_wt_ct_pan_tail_trans adj_wt_ct
> _pan_body_tail adj_wt_ct_pan_cc_body adj_wt_ct_pan_cc_head adj_sqrt_ct_pan_head_trans adj_sqrt_ct_pan_head_ap adj_sqrt_ct_pa
> n_body_trans adj_sqrt_ct_pan_tail_trans adj_sqrt_ct_pan_body_tail adj_sqrt_ct_pan_cc_body adj_sqrt_ct_pan_cc_head adj_wt_pan
> _head_ap adj_wt_pan_head_trans adj_wt_pan_body_trans adj_wt_pan_tail_trans adj_sqrt_pan_head_ap adj_sqrt_pan_head_trans adj_
> sqrt_pan_body_trans adj_sqrt_pan_tail_trans"
> */
. 
. 
. local derived3 "flag_fecal_elastase recruited assay_fecal_elastase assay_lipase assay_trypsinogen assay_amylase radio2 ct2 r
> adio_mis_dims radio_mis_all radio3 subset subset2 epi_binary epi_ordinal child africa exposuretime fec_cohort"

. 
. local glucose "metformin insulin ogttr_confirm hba1c glu0 mmol_glu0 ogtt_time0 hba1c mmol_glu120 gluc_mean_mgdl insulin_mean
> _mul Matsuda_index insulinogenic_index rhba1c diab_hb_gl120" 

. 
. local enzymes "fecal_elastase lipase ngml_trypsinogen mgl_crp mgl_cystatin ul_amylp"

. 
. local body "bia fm_kg fm_per ffm_kg ffm_per fmi ffmi impedance bia_prob bia_comment adp adpfm_kg adpffm_kg adpfm_per adpffm_
> per adp_prob adp_comment"

. 
. local organs "hepatomegaly splenomegaly cholelithiasis steatosis mass gynecologic atherosclerosis nephrolithiasis pancreatic
> "

. 
. 
. keep `subj1' `subj2' `nutrition' `ses' `uss' `ct' `derived1' `adjwt_uss' `adjsq_uss' `adjwt_ct' `adjsq_ct' `derived3' `gluco
> se' `enzymes' `body' `organs'

. 
. keep if subset==1
(154 observations deleted)

. 
end of do-file

. 
. local obs = _N

. notes drop _dta 
  (15 notes dropped)

. note: Subset Created for Imaging Paper on `c(current_date)' at `c(current_time)' by `c(username)'

. note: Keeps only participants with Fecal Elastase or Visible Ultrasound Scans; N=`obs'

. note: Data read from ~/Cox working group Dropbox/TB Nutrition working group/Sampa/DATA Monitoring/data/sampa/All_combined_sa
> mpa_data.dta

. note: Selected variables kept for this paper in cr_keep.do 

. describe, simple
record_id     metformin     muac          adp           pan_contou~y  atheroscle~s  ct_pan~rosis  radio_mis_~l  adj_sqrt_c..
cohort        insulin       waist         adpfm_kg      pan_parenc~a  nephrolith~s  ct_pan~tosis  radio3        adj_sqrt_c..
sampa_id      ogtt_time0    hip           adpffm_kg     pan_paren_~m  pancreatic    ct_pan_duct   subset        adj_sqrt_~il
orgid         hba1c         height        adpfm_per     pan_pa~rosis  ct_pan_siz~l  ct_pan_du~es  subset2       adj_sqrt_~ol
sex           glu0          bmi           adpffm_per    pan_pa~tosis  ct_pan_hea~s  ct_pan_du~ss  epi_binary    adj_wt_pan~p
dob           mmol_glu0     haz           adp_prob      pan_duct      ct_pan_hea~p  ct_pan_calci  epi_ordinal   adj_wt_pan..
age           mmol_glu120   bmiz          adp_comment   pan_duct_s~s  ct_pan_bod~s  ct_pan_cal~e  child         adj_wt_pan..
indepth_sa~e  mgl_crp       bmi_cat_ch~d  fecal_elas~e  pan_duct_m~s  ct_pan_tai~s  ct_pan_oth~l  africa        adj_wt_pan..
indepth_exp   mgl_cystatin  bmi_cat       radio_exam    pan_calci     ct_pan_bod~l  ct_pan_oth~c  exposuretime  adj_sqrt_p~p
ct_sample     ul_amylp      bia           pan_size_q~l  pan_calci_~e  ct_pan_cc_~y  flag_fecal~e  fec_cohort    adj_sqrt_p..
ct            ngml_tryps~n  fm_kg         pan_head_t~s  pan_cyst_yes  ct_pan_cc_~d  diab_hb_~120  ct_pan_vol    adj_sqrt_p..
ivgtt_sample  gluc_mean_~l  fm_per        pan_head_ap   pan_oth_ab~l  ct_pan_shape  recruited     adj_wt_ct_..  adj_sqrt_p..
ivgtt         insulin_me~l  ffm_kg        pan_body_t~s  pan_oth_ab~y  ct_pan_sha~m  assay_feca~e  adj_wt_ct_~p
uss_sample    Matsuda_in~x  ffm_per       pan_tail_t~s  hepatomegaly  ct_pan_sha~c  assay_lipase  adj_wt_ct_..
uss           insulinoge~x  fmi           pan_shape     splenomegaly  ct_pan_con~r  assay_amyl~e  adj_wt_ct_..
ever_mal      ogttr_conf~m  ffmi          pan_shape_~m  cholelithi~s  ct_pan_con~m  assay_tryp~n  adj_wt_ct~il
degree_mal    rhba1c        impedance     pan_shape_~y  steatosis     ct_pan_con~c  radio2        adj_wt_ct~ol
ses_tercile   lipase        bia_prob      pan_contour   mass          ct_pan_par~a  ct2           adj_sqrt_c..
hiv           weight        bia_comment   pan_contou~m  gynecologic   ct_pan_par~m  radio_mis_~s  adj_sqrt_c~p

. notes 

_dta:
  1.  Subset Created for Imaging Paper on 27 Mar 2025 at 11:30:39 by juansolon
  2.  Keeps only participants with Fecal Elastase or Visible Ultrasound Scans; N=2122
  3.  Data read from ~/Cox working group Dropbox/TB Nutrition working group/Sampa/DATA
      Monitoring/data/sampa/All_combined_sampa_data.dta
  4.  Selected variables kept for this paper in cr_keep.do

. 
. save ./data-temp/subset_imaging.dta, replace
file ./data-temp/subset_imaging.dta saved

. 
. /*
> ************  This is the analysis dataset 
> 
> do ./do/an_samples_images_counts.do                                             //  What is the proportion of samples per MN
>  and cohort
> 
> an_images_mn.do                                                 //. What is the proportion of samples with CT and USS per MN
>  and cohort
> 
> 
> an__bivariate_assays.do // bivariate anaysis - of all lab assays by mn 
> 
> an_cont_asays.do // tabulate mean p50 of levels per mn and cohort; tobit regression
> 
> 
> 
> *********************
> 
> 
> tab_assays.do // tabulate levels of EPI by cohort; by mn
> 
> an_bivariate_dimensions.do // bivaraite analysis of all relevant  by mn
> 
> tab_dimensions.do // bivaraite analysis of all image sizes by mn
> 
> an_regression_assays.do // 
> 
> an_regression_dimensions.do //
>  
> tab_image_findings.do // 

end of do-file

. tab radio_exam radio2

       Was a |
radiological |
 examination | Ultrasound
  performed? |       Yes |     Total
-------------+-----------+----------
         Yes |     1,740 |     1,740 
-------------+-----------+----------
       Total |     1,740 |     1,740 

. tab radio_exam radio3

       Was a |
radiological |
 examination | USS Scans Visualized
  performed? |        No        Yes |     Total
-------------+----------------------+----------
         Yes |       119      1,621 |     1,740 
-------------+----------------------+----------
       Total |       119      1,621 |     1,740 

. tab ct2

     CT Scan |      Freq.     Percent        Cum.
-------------+-----------------------------------
          No |      1,831       86.29       86.29
         Yes |        291       13.71      100.00
-------------+-----------------------------------
       Total |      2,122      100.00

. tab ct2 radio3

             | USS Scans Visualized
     CT Scan |        No        Yes |     Total
-------------+----------------------+----------
          No |       498      1,333 |     1,831 
         Yes |         3        288 |       291 
-------------+----------------------+----------
       Total |       501      1,621 |     2,122 

. tab epi_bin

        EPI |      Freq.     Percent        Cum.
------------+-----------------------------------
Without EPI |      1,202       66.78       66.78
   With EPI |        598       33.22      100.00
------------+-----------------------------------
      Total |      1,800      100.00

. tab epi*

            |            EPI Levels
        EPI | Without E  Mild-Mode  Severe EP |     Total
------------+---------------------------------+----------
Without EPI |     1,202          0          0 |     1,202 
   With EPI |         0        274        324 |       598 
------------+---------------------------------+----------
      Total |     1,202        274        324 |     1,800 

. d epi*

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------------
epi_binary      float   %11.0g     epi_binary
                                              EPI
epi_ordinal     float   %17.0g     epi_ordinal
                                              EPI Levels

. tab epi_ordinal

       EPI Levels |      Freq.     Percent        Cum.
------------------+-----------------------------------
      Without EPI |      1,202       66.78       66.78
Mild-Moderate EPI |        274       15.22       82.00
       Severe EPI |        324       18.00      100.00
------------------+-----------------------------------
            Total |      1,800      100.00

. tab epi_ordinal ever_mal

                  |    Ever experience
                  |     malnutrition?
       EPI Levels |       NPM         PM |     Total
------------------+----------------------+----------
      Without EPI |       662        540 |     1,202 
Mild-Moderate EPI |       149        125 |       274 
       Severe EPI |       197        127 |       324 
------------------+----------------------+----------
            Total |     1,008        792 |     1,800 

. tab epi_bin ever_mal, col chi

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

            |    Ever experience
            |     malnutrition?
        EPI |       NPM         PM |     Total
------------+----------------------+----------
Without EPI |       662        540 |     1,202 
            |     65.67      68.18 |     66.78 
------------+----------------------+----------
   With EPI |       346        252 |       598 
            |     34.33      31.82 |     33.22 
------------+----------------------+----------
      Total |     1,008        792 |     1,800 
            |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   1.2567   Pr = 0.262

. logistica epi_bin africa
command logistica is unrecognized
r(199);

. logistic epi_bin africa

Logistic regression                                     Number of obs =  1,800
                                                        LR chi2(1)    = 147.66
                                                        Prob > chi2   = 0.0000
Log likelihood = -1070.5043                             Pseudo R2     = 0.0645

------------------------------------------------------------------------------
  epi_binary | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      africa |   .2516354   .0307193   -11.30   0.000      .198088    .3196578
       _cons |   3.009499   .4814885     6.89   0.000     2.199433    4.117917
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. tab africa

  Africa or |
       Asia |      Freq.     Percent        Cum.
------------+-----------------------------------
     Africa |      1,252       59.00       59.00
       Asia |        870       41.00      100.00
------------+-----------------------------------
      Total |      2,122      100.00

. gen africa2 = africa

. d africa

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------------
africa          float   %9.0g      africa     Africa or Asia

. label list values africa
value label values not found
r(111);

. label list africa
africa:
           1 Africa
           2 Asia

. recode africa2 2=0
(870 changes made to africa2)

. label list africa2
value label africa2 not found
r(111);

. d africa2

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------------
africa2         float   %9.0g                 

. tab africa2

    africa2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        870       41.00       41.00
          1 |      1,252       59.00      100.00
------------+-----------------------------------
      Total |      2,122      100.00

. label define africa2 0 "Asia" 1 "Africa"

. label values africa2 africa2

. logistic epi_bin africa

Logistic regression                                     Number of obs =  1,800
                                                        LR chi2(1)    = 147.66
                                                        Prob > chi2   = 0.0000
Log likelihood = -1070.5043                             Pseudo R2     = 0.0645

------------------------------------------------------------------------------
  epi_binary | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      africa |   .2516354   .0307193   -11.30   0.000      .198088    .3196578
       _cons |   3.009499   .4814885     6.89   0.000     2.199433    4.117917
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. logistic epi_bin africa2

Logistic regression                                     Number of obs =  1,800
                                                        LR chi2(1)    = 147.66
                                                        Prob > chi2   = 0.0000
Log likelihood = -1070.5043                             Pseudo R2     = 0.0645

------------------------------------------------------------------------------
  epi_binary | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     africa2 |   3.974003   .4851408    11.30   0.000     3.128346     5.04826
       _cons |   .1905626   .0202917   -15.57   0.000     .1546675    .2347883
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. logistic epi_ord africa2
outcome does not vary; remember:
                                  0 = negative outcome,
        all other nonmissing values = positive outcome
r(2000);

. ologistic epi_ord africa2
command ologistic is unrecognized
r(199);

. ologit epi_ord africa2

Iteration 0:  Log likelihood = -1556.7435  
Iteration 1:  Log likelihood = -1481.5042  
Iteration 2:  Log likelihood = -1479.9138  
Iteration 3:  Log likelihood = -1479.9132  
Iteration 4:  Log likelihood = -1479.9132  

Ordered logistic regression                             Number of obs =  1,800
                                                        LR chi2(1)    = 153.66
                                                        Prob > chi2   = 0.0000
Log likelihood = -1479.9132                             Pseudo R2     = 0.0494

------------------------------------------------------------------------------
 epi_ordinal | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     africa2 |   1.391242   .1210957    11.49   0.000     1.153898    1.628585
-------------+----------------------------------------------------------------
       /cut1 |   1.663969   .1061085                         1.456    1.871938
       /cut2 |   2.535107   .1153741                      2.308978    2.761236
------------------------------------------------------------------------------

. ologit epi_ord africa2, or

Iteration 0:  Log likelihood = -1556.7435  
Iteration 1:  Log likelihood = -1481.5042  
Iteration 2:  Log likelihood = -1479.9138  
Iteration 3:  Log likelihood = -1479.9132  
Iteration 4:  Log likelihood = -1479.9132  

Ordered logistic regression                             Number of obs =  1,800
                                                        LR chi2(1)    = 153.66
                                                        Prob > chi2   = 0.0000
Log likelihood = -1479.9132                             Pseudo R2     = 0.0494

------------------------------------------------------------------------------
 epi_ordinal | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     africa2 |   4.019838   .4867853    11.49   0.000     3.170528    5.096657
-------------+----------------------------------------------------------------
       /cut1 |   1.663969   .1061085                         1.456    1.871938
       /cut2 |   2.535107   .1153741                      2.308978    2.761236
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. logistic epi_bin ever_mal

Logistic regression                                     Number of obs =  1,800
                                                        LR chi2(1)    =   1.26
                                                        Prob > chi2   = 0.2619
Log likelihood = -1143.7048                             Pseudo R2     = 0.0006

------------------------------------------------------------------------------
  epi_binary | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    ever_mal |    .892871   .0902677    -1.12   0.262     .7323754    1.088538
       _cons |   .5226586   .0346722    -9.78   0.000     .4589348    .5952306
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. graph use "/Users/juansolon/Documents/GitHub/sampa-radio/figures/agreement_ctus_body.gph"

. graph use "/Users/juansolon/Documents/GitHub/sampa-radio/figures/agreement_ctus_head_ap.gph"

. graph use "/Users/juansolon/Documents/GitHub/sampa-radio/figures/baplot_us_ct_combined.gph"

. d ses

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------------
ses_tercile     float   %9.0g      ses_tercile
                                              SES Terciles

. tab ses_tercile

        SES |
   Terciles |      Freq.     Percent        Cum.
------------+-----------------------------------
        low |        715       33.82       33.82
     medium |        707       33.44       67.27
       high |        692       32.73      100.00
------------+-----------------------------------
      Total |      2,114      100.00

. tab ses_tercile cohort

       SES |                              Cohort
  Terciles |    DIVIDS        SAM     CICADA    NUSTART      STATT      CLHNS |     Total
-----------+------------------------------------------------------------------+----------
       low |       102         35        291         96         90        101 |       715 
    medium |       101         35        290         94         86        101 |       707 
      high |        96         33        286         92         85        100 |       692 
-----------+------------------------------------------------------------------+----------
     Total |       299        103        867        282        261        302 |     2,114 

. tab ses_tercile cohort, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       SES |                              Cohort
  Terciles |    DIVIDS        SAM     CICADA    NUSTART      STATT      CLHNS |     Total
-----------+------------------------------------------------------------------+----------
       low |       102         35        291         96         90        101 |       715 
           |     34.11      33.98      33.56      34.04      34.48      33.44 |     33.82 
-----------+------------------------------------------------------------------+----------
    medium |       101         35        290         94         86        101 |       707 
           |     33.78      33.98      33.45      33.33      32.95      33.44 |     33.44 
-----------+------------------------------------------------------------------+----------
      high |        96         33        286         92         85        100 |       692 
           |     32.11      32.04      32.99      32.62      32.57      33.11 |     32.73 
-----------+------------------------------------------------------------------+----------
     Total |       299        103        867        282        261        302 |     2,114 
           |    100.00     100.00     100.00     100.00     100.00     100.00 |    100.00 

. help collect style cell 

