
. 
. local dataset "All_combined_sampa_data.dta"

. 
. * CHANGE DIRECTORY TO DROPBOX
. 
. cd "$sampadata"
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data/SAMPA

. 
. use "All_combined_sampa_data.dta", clear

. 
. frame rename default sampa

. cd "$ghsamparadio"
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. 
. 
. 
end of do-file

. 
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. do ./do/cr_flag_elastase.do             // Flags the elastase samples that should not be analyzed bas
> ed on ELISA standards ; n = 90

. /*
> cr_flag_elastase.do                     
> Flags the elastase samples that should not be analyzed based on ELISA standards ; n = 90
> J Solon
> March 3 2025
> 
> Once this flag is made, this has to be added to the analysis dataset
> */
. 
. 
. tempfile 1 2 3

. 
. sort sampa_id

. 
. save `1'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000001 saved as .dta format

. 
. ***  IMPORT ZAMBIA ELISA DATA (PLATE DROPPED)
. 
. frame create plate

. frame change plate

. 
. cd data-temp
/Users/juansolon/Documents/GitHub/sampa-radio/data-temp

. 
. import excel using "Plate 1 results.xlsx" ,cellrange(A2) first   
(6 vars, 90 obs)

. 
. cd ../
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. gen flag_fecal_elastase = 1

. 
. rename SampaID sampa_id

. 
. keep sampa_id flag_fecal_elastase

. 
. sort sampa_id

. 
. save `2'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002 saved as .dta format

. 
. frame change sampa

. 
. merge 1:1 sampa_id using `2', keep(match master)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,188
        from master                     2,188  (_merge==1)
        from using                          0  (_merge==2)

    Matched                                90  (_merge==3)
    -----------------------------------------

. 
. drop _merge

. 
end of do-file

. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. do ./do/cr_trypsin.do 

. /*
> cr_trypsin.do                   
> merges trypsinogen
> J Solon
> March 21 2025
> */
. 
. 
. tempfile 1 2 3

. 
. sort sampa_id

. 
. save `1'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000001 saved as .dta format

. 
. ***  reads trypsin
. 
. frame create trypsin

. frame change trypsin

. 
. use  "~/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data/Copenhagen la
> b/data/cohort_temporary_trypsinogen.dta"

. 
. sort sampa_id

. 
. save `2'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_77831.000002 saved as .dta format

. 
. frame change sampa

. 
. merge 1:1 sampa_id using `2', keepusing(ngml) 

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,971
        from master                     1,965  (_merge==1)
        from using                          6  (_merge==2)

    Matched                               313  (_merge==3)
    -----------------------------------------

. 
. drop if _merge ==2 // _merge ==2 from lab only.  these are individuals with no bmi and dropped from c
> ombined.
(6 observations deleted)

. 
. rename _merge from_trypsin

. 
. label variable from_trypsin "With Copenhagen Lab Trypsin Data"

. 
. rename ngml_trysinogen ngml_trypsinogen

. 
end of do-file

. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
.  
. do ./do/cr_sample_binary.do             // Generates or recodes ultrasound ct scan and elisa assays a
> s binary with or without samples

. /* 
> cr_sample_binary.do                             // Generates or recodes ultrasound ct scan and elisa 
> assays as binary with or without samples
>                                                                 // Include here the same for presence
>  or absence of functional enzyme assays 
>                                                                 
> Juan Solon
> March 3 2025
> 
> */
. 
. **# Generate recruitment and sample variables
. 
. gen recruited = 1

.         la var recruited "Recruited"

. 
. gen assay_fecal_elastase = 1 if fecal_elastase !=. & fecal_elastase >0
(476 missing values generated)

.         replace assay_fe = 0 if fecal_elastase==. 
(476 real changes made)

.         la var assay_fe "Fecal Elastase"

. 
. gen assay_lipase = 1 if lipase !=. & lipase >0
(1,956 missing values generated)

.         replace assay_lip = 0 if lipase ==.
(1,956 real changes made)

.         la var assay_lip "Lipase"

. 
. /*
> gen assay_amylase = 1 if amylase !=. & amylase >0
>         *replace assay_amylase = 0 if amylase ==.
>         la var assay_amylase "Amylase"
>         
> gen assay_trypsinogen = 1 if trypsinogen !=. & trypsinogen >0
>         *replace assay_trypsinogen = 0 if trypsinogen ==.
>         la var assay_trypsinogen "Trypsinogen"
> */
. 
. **# Create new variables for imaging presence; Do not replace combined
. 
. 
. clonevar radio2 = radio_exam
(513 missing values generated)

.         replace radio2 = 0 if radio_exam==.
(513 real changes made)

.         la var radio2 "Ultrasound"

. 
. clonevar ct2 = ct_scan
(1,627 missing values generated)

.         replace ct2 = 0 if ct_scan==.
(1,627 real changes made)

.         la var ct2 "CT Scan"

. 
. egen radio_mis_dims = rowmiss(pan_head_ap pan_head_trans pan_body_trans pan_tail_trans)

. 
. 
. egen radio_mis_all = rowmiss(pan_size_qual pan_head_trans pan_head_ap pan_body_trans pan_tail_trans p
> an_shape pan_shape_problem pan_shape_prob_specify pan_contour pan_contour_problem pan_contour_prob_sp
> ecify pan_parenchyma pan_paren_inflam pan_paren_fibrosis pan_paren_steatosis pan_duct pan_duct_stones
>  pan_duct_mass pan_calci pan_calci_place pan_cyst_yes pan_oth_abnormal pan_oth_abn_specify)

. 
. clonevar radio3 = radio2

. replace radio3 = 0 if radio_mis_dims ==4
(142 real changes made)

. la var radio3 "USS Scans Visualized"

. 
.         
. gen subset = 0

. replace subset = 1 if radio3==1 | assay_fecal_elastase ==1
(2,124 real changes made)

. la var subset "Analysis Subset (With Fe-1 or USS)"

. 
. gen subset2 = 0

. replace subset2 = 1 if radio3==1 | assay_fecal_elastase ==1 | ct2==1
(2,162 real changes made)

. la var subset2 "Analysis Subset 2 (With Fe-1 or USS or CT Scan)"

. 
. 
end of do-file

.                                                                                 // Include here the s
> ame for presence or absence of functional enzyme assays 
.                                                                                 // Revise once amylas
> e and trypsinogen 
. 
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_categorical_outcomes.do

. /*
> cr_categorical_outcomes.do              
> Sampa
> Imaging Elastase Paper
> 
> Recodes fecal_elastase to with or without EPI and levels of EPI
> Include here any recoding of other functional enzymes
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         01-data
>         02-data-temp
>         03-tables
>         04-do
>         05-figures
>         log 
> */
. 
. egen epi_binary = cut(fecal_elastase), at(0,200,601) icodes
(476 missing values generated)

.         la var epi_binary "EPI"

.         recode epi_binary 0 = 1 1 = 0
(1,802 changes made to epi_binary)

.         
. 
.         label define epi_binary 0 "Without EPI" 1 "With EPI"

.         label values epi_binary epi_binary

.         
. 
. egen epi_ordinal = cut(fecal_elastase), at(0,100,200, 601) icodes
(476 missing values generated)

.         la var epi_ordinal "EPI Levels"

.         recode epi_ordinal 0 = 3 1 = 2 2 = 1 
(1,802 changes made to epi_ordinal)

. 
.         label define epi_ordinal 1 "Without EPI" 2 "Mild-Moderate EPI" 3 "Severe EPI"

.         label values epi_ordinal epi_ordinal

. 
end of do-file

. 
.                                                                                 // Recodes fecal_elas
> tase to with or without EPI and levels of EPI
.                                                                                 // Include here any r
> ecoding of other functional enzymes once that data is in and cut-offs are known
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_categorical_independent.do

. /*
> SAMPA
> cr_categorical_independent.do
> March 3 2025
> J Solon
> 
> Creates categorical variables for indedpendent variables
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         data
>         data-temp
>         tables
>         do
>         figures
>         log 
>         
> */
. 
. * Any radiology variables
. 
. label variable pan_head_ap "Head, AP"

. label variable pan_head_trans  "Head, Transverse" 

. label variable pan_body_trans  "Body, Transverse"

. label variable pan_tail_trans  "Tail, Transverse"

. 
. 
. 
. * Cohort subcategorizations these are for creating graphs 
. 
. generate child = 1 if cohort ==1 | cohort ==2
(1,848 missing values generated)

.         replace child = 2 if cohort ==3 | cohort ==4 | cohort ==5 | cohort ==6
(1,848 real changes made)

.         la var child "Adult or Child Population"

. 
.         label define child 1 "Child" 2 "Adult"

.     label values child child

. 
.         
. generate africa =1 if cohort == 2 | cohort == 3 | cohort ==4
(905 missing values generated)

.         replace africa =2 if cohort == 1 | cohort == 5 | cohort ==6
(905 real changes made)

.         la var africa "Africa or Asia"

. 
.         label define africa 1 "Africa" 2 "Asia"

.         label values africa africa

. 
. 
. generate exposuretime = 1 if cohort ==1 | cohort ==2 | cohort ==6
(1,540 missing values generated)

.         replace exposuretime = 2 if cohort ==4 | cohort ==5 | cohort ==3
(1,540 real changes made)

.         
.         label define exposuretime 1 "Exposure in Childhood" 2 "Exposure as Adults"

.         label values exposuretime exposuretime

.         
.         la var exposuretime "Exposure Time"

.         
. gen fec_cohort = 1 if cohort ==1
(1,956 missing values generated)

.         replace fec_cohort = 2 if cohort == 5
(275 real changes made)

.         replace fec_cohort = 3 if cohort ==6
(308 real changes made)

.         replace fec_cohort = 4 if cohort == 2
(108 real changes made)

.         replace fec_cohort = 5 if cohort ==3
(976 real changes made)

.         replace fec_cohort = 6 if cohort == 4
(289 real changes made)

. 
.         la var fec_cohort "Cohort"

.         label define fec_cohort 1 "DIVIDS" 2 "St-ATT" 3 "CLHNS" 4 "SAM" 5 "CICADA" 6 "NUSTART"

.         label values fec_cohort fec_cohort

. 
. label define ever_mal 0 "NPM" 1 "PM", modify

. label values ever_mal ever_mal

. 
end of do-file

. 
.                                                                                 // Include here any d
> erived variables for imaging that are categorical
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_continuous_independent.do            // Derived variables for imaging that are continuous 
> ; include transformations / weights

. /*
> SAMPA
> cr_continuous_independent.do
> March 3 2025
> J Solon
> 
> Creates continuous variables for Radiology
> 
> Creates pancreatic volumes based on the formula vy Li.
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         01-data
>         02-data-temp
>         03-tables
>         04-do
>         05-figures
>         log 
>         
>         
> */
. 
. * Pancreatic Volume (CT)
. 
. cap drop ct_pan_vol

.         gen ct_pan_vol=((ct_pan_tail_trans+ct_pan_body_trans)/2)*ct_pan_body_tail*ct_pan_cc_body+((ct
> _pan_head_ap/2)^2)*3.14*ct_pan_cc_head
(2,036 missing values generated)

.         cap label variable ct_pan_vol "Calculated Pancreatic Volume; Study"

. 
.         
. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_bo
> dy_tail ct_pan_cc_body ct_pan_cc_head {
  2.         gen adj_wt_`var' = `var'/weight
  3. }
(1,954 missing values generated)
(1,951 missing values generated)
(1,952 missing values generated)
(1,953 missing values generated)
(2,027 missing values generated)
(2,031 missing values generated)
(2,033 missing values generated)

. 
. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_bo
> dy_tail ct_pan_cc_body ct_pan_cc_head {
  2.         gen adj_sqrt_`var' = sqrt(`var')
  3. }               
(1,954 missing values generated)
(1,951 missing values generated)
(1,952 missing values generated)
(1,953 missing values generated)
(2,027 missing values generated)
(2,031 missing values generated)
(2,033 missing values generated)

.         
. * Derived USS Variables 
. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj_wt_`var' = `var'/weight
  3. }
(729 missing values generated)
(882 missing values generated)
(673 missing values generated)
(1,082 missing values generated)

. 
. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj_sqrt_`var' = sqrt(`var')
  3. }               
(724 missing values generated)
(877 missing values generated)
(668 missing values generated)
(1,077 missing values generated)

.         
. 
. 
end of do-file

. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_keep.do 

. 
. local subj1 "record_id cohort sampa_id orgid sex dob age hiv"

. 
. local nutrition "bmi haz bmiz bmi_cat_child bmi_cat weight height"

. 
. local subj2 "indepth_sample indepth_exp ct_sample ct ivgtt_sample ivgtt uss_sample uss ever_mal degre
> e_mal"

. 
. local ses "ses_tercile1 ses_tercile2 ses_tercile3 ses_tercile4 ses_tercile5 comp1 ses_tercile6 ses_te
> rcile"

. 
. local uss "pan_size_qual pan_head_trans pan_head_ap pan_body_trans pan_tail_trans pan_shape pan_shape
> _problem pan_shape_prob_specify pan_contour pan_contour_problem pan_contour_prob_specify pan_parenchy
> ma pan_paren_inflam pan_paren_fibrosis pan_paren_steatosis pan_duct pan_duct_stones pan_duct_mass pan
> _calci pan_calci_place pan_cyst_yes pan_oth_abnormal pan_oth_abn_specify pancreatic"

. 
. local ct "ct_pan_size_qual ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pa
> n_body_tail ct_pan_cc_body ct_pan_cc_head ct_pan_shape ct_pan_shape_problem ct_pan_shape_prob_spec ct
> _pan_contour ct_pan_contour_problem ct_pan_contour_prob_spec ct_pan_parenchyma ct_pan_paren_inflam ct
> _pan_paren_fibrosis ct_pan_paren_steatosis ct_pan_duct ct_pan_duct_stones ct_pan_duct_mass ct_pan_cal
> ci ct_pan_calci_place ct_pan_oth_abnormal ct_pan_oth_abn_spec"

. 
. local derived1 "ct_pan_vol"

. 
. local derived2 "adj_wt_ct_pan_head_trans adj_wt_ct_pan_head_ap adj_wt_ct_pan_body_trans adj_wt_ct_pan
> _tail_trans adj_wt_ct_pan_body_tail adj_wt_ct_pan_cc_body adj_wt_ct_pan_cc_head adj_sqrt_ct_pan_head_
> trans adj_sqrt_ct_pan_head_ap adj_sqrt_ct_pan_body_trans adj_sqrt_ct_pan_tail_trans adj_sqrt_ct_pan_b
> ody_tail adj_sqrt_ct_pan_cc_body adj_sqrt_ct_pan_cc_head adj_wt_pan_head_ap adj_wt_pan_head_trans adj
> _wt_pan_body_trans adj_wt_pan_tail_trans adj_sqrt_pan_head_ap adj_sqrt_pan_head_trans adj_sqrt_pan_bo
> dy_trans adj_sqrt_pan_tail_trans"

. 
. local derived3 "flag_fecal_elastase ngml_trypsinogen from_trypsin recruited assay_fecal_elastase assa
> y_lipase radio2 ct2 radio_mis_dims radio_mis_all radio3 subset subset2 epi_binary epi_ordinal child a
> frica exposuretime fec_cohort"

. 
. local glucose "metformin insulin ogtt_time0 hba1c gluc_mean_mgdl insulin_mean_mul Matsuda_index insul
> inogenic_index rhba1c" 

. 
. local enzymes "lipase ngml_trypsinogen mgl_crp mgl_cystatin ul_amylp"

. 
. local body "bia fm_kg fm_per ffm_kg ffm_per fmi ffmi impedance bia_prob bia_comment adp adpfm_kg adpf
> fm_kg adpfm_per adpffm_per adp_prob adp_comment"

. 
. local organs "hepatomegaly splenomegaly cholelithiasis steatosis mass gynecologic atherosclerosis nep
> hrolithiasis pancreatic"

. 
. 
. keep `subj1' `subj2' `ses' `uss' `ct' `derived1' `derived2' `derived3' `glucose' `enzymes' `body' `or
> gans'

. 
end of do-file

. 
. notes drop _dta 
  (15 notes dropped)

. note: Created for Imaging Paper on `c(current_date)' at `c(current_time)' by `c(username)'

. note: Trypsin data inserted from temporary dropbox data 

. note: Selected variables kept for this paper in cr_keep.do 

. describe, simple
record_id     ses_tercile6  impedance     pan_pa~rosis  ct_pan_tai~s  from_trypsin  adj_wt_ct_~y
cohort        ses_tercile   bia_prob      pan_pa~tosis  ct_pan_bod~l  recruited     adj_wt_ct_~d
sampa_id      hiv           bia_comment   pan_duct      ct_pan_cc_~y  assay_feca~e  adj_sqrt_c..
orgid         metformin     adp           pan_duct_s~s  ct_pan_cc_~d  assay_lipase  adj_sqrt_c~p
sex           insulin       adpfm_kg      pan_duct_m~s  ct_pan_shape  radio2        adj_sqrt_c..
dob           ogtt_time0    adpffm_kg     pan_calci     ct_pan_sha~m  ct2           adj_sqrt_c..
age           hba1c         adpfm_per     pan_calci_~e  ct_pan_sha~c  radio_mis_~s  adj_sqrt_c~l
indepth_sa~e  gluc_mean_~l  adpffm_per    pan_cyst_yes  ct_pan_con~r  radio_mis_~l  adj_sqrt_c~y
indepth_exp   insulin_me~l  adp_prob      pan_oth_ab~l  ct_pan_con~m  radio3        adj_sqrt_c~d
ct_sample     Matsuda_in~x  adp_comment   pan_oth_ab~y  ct_pan_con~c  subset        adj_wt_pan~p
ct            insulinoge~x  pan_size_q~l  hepatomegaly  ct_pan_par~a  subset2       adj_wt_pan..
ivgtt_sample  rhba1c        pan_head_t~s  splenomegaly  ct_pan_par~m  epi_binary    adj_wt_pan..
ivgtt         lipase        pan_head_ap   cholelithi~s  ct_pan~rosis  epi_ordinal   adj_wt_pan..
uss_sample    mgl_crp       pan_body_t~s  steatosis     ct_pan~tosis  child         adj_sqrt_p~p
uss           mgl_cystatin  pan_tail_t~s  mass          ct_pan_duct   africa        adj_sqrt_p..
ever_mal      ul_amylp      pan_shape     gynecologic   ct_pan_du~es  exposuretime  adj_sqrt_p..
degree_mal    bia           pan_shape_~m  atheroscle~s  ct_pan_du~ss  fec_cohort    adj_sqrt_p..
ses_tercile1  fm_kg         pan_shape_~y  nephrolith~s  ct_pan_calci  ct_pan_vol
ses_tercile2  fm_per        pan_contour   pancreatic    ct_pan_cal~e  adj_wt_ct_..
ses_tercile3  ffm_kg        pan_contou~m  ct_pan_siz~l  ct_pan_oth~l  adj_wt_ct_~p
ses_tercile4  ffm_per       pan_contou~y  ct_pan_hea~s  ct_pan_oth~c  adj_wt_ct_..
ses_tercile5  fmi           pan_parenc~a  ct_pan_hea~p  flag_fecal~e  adj_wt_ct_..
comp1         ffmi          pan_paren_~m  ct_pan_bod~s  ngml_tryps~n  adj_wt_ct_~l

. notes 

_dta:
  1.  Created for Imaging Paper on 22 Mar 2025 at 03:27:25 by juansolon
  2.  Trypsin data inserted from temporary dropbox data
  3.  Selected variables kept for this paper in cr_keep.do

. 
. save ./data-temp/subset_imaging.dta, replace
(file ./data-temp/subset_imaging.dta not found)
file ./data-temp/subset_imaging.dta saved

. 
end of do-file

