
. 
. local dataset "All_combined_sampa_data.dta"

. 
. * CHANGE DIRECTORY TO DROPBOX
. 
. cd "$sampadata"
/Users/juansolon/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data/SAMPA

. 
. use "All_combined_sampa_data.dta", clear

. 
. frame rename default sampa

. cd "$ghsamparadio"
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. 
. 
. 
end of do-file

. 
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. do ./do/cr_flag_elastase.do             // Flags the elastase samples that should not be analyzed based on ELISA standards ; n = 90

. /*
> cr_flag_elastase.do                     
> Flags the elastase samples that should not be analyzed based on ELISA standards ; n = 90
> J Solon
> March 3 2025
> 
> Once this flag is made, this has to be added to the analysis dataset
> */
. 
. 
. tempfile 1 2 3

. 
. sort sampa_id

. 
. save `1'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000001 saved as .dta format

. 
. ***  IMPORT ZAMBIA ELISA DATA (PLATE DROPPED)
. 
. frame create plate

. frame change plate

. 
. cd data-temp
/Users/juansolon/Documents/GitHub/sampa-radio/data-temp

. 
. import excel using "Plate 1 results.xlsx" ,cellrange(A2) first   
(6 vars, 90 obs)

. 
. cd ../
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. gen flag_fecal_elastase = 1

. 
. rename SampaID sampa_id

. 
. keep sampa_id flag_fecal_elastase

. 
. sort sampa_id

. 
. save `2'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000002 saved as .dta format

. 
. frame change sampa

. 
. merge 1:1 sampa_id using `2', keep(match master)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,188
        from master                     2,188  (_merge==1)
        from using                          0  (_merge==2)

    Matched                                90  (_merge==3)
    -----------------------------------------

. 
. drop _merge

. 
end of do-file

. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
. do ./do/cr_trypsin.do 

. /*
> cr_trypsin.do                   
> merges trypsinogen
> J Solon
> March 21 2025
> */
. 
. 
. tempfile 1 2 3

. 
. sort sampa_id

. 
. save `1'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000001 saved as .dta format

. 
. ***  reads trypsin
. 
. frame create trypsin

. frame change trypsin

. 
. use  "~/Cox working group Dropbox/TB Nutrition working group/SAMPA/DATA monitoring/Data/Copenhagen lab/data/cohort_temporary_trypsinogen.dta"

. 
. sort sampa_id

. 
. save `2'
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000002 saved as .dta format

. 
. frame change sampa

. 
. merge 1:1 sampa_id using `2', keepusing(ngml) 

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,971
        from master                     1,965  (_merge==1)
        from using                          6  (_merge==2)

    Matched                               313  (_merge==3)
    -----------------------------------------

. 
. drop if _merge ==2 // _merge ==2 from lab only.  these are individuals with no bmi and dropped from combined.
(6 observations deleted)

. 
. rename _merge from_trypsin

. 
. label variable from_trypsin "With Copenhagen Lab Trypsin Data"

. 
. rename ngml_trysinogen ngml_trypsinogen

. 
. replace ngml_trypsinogen = 44.03 if ngml_trypsinogen ==4403 // outlier verified by copenhagen lab
(1 real change made)

. 
end of do-file

. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. 
.  
. do ./do/cr_sample_binary.do             // Generates or recodes ultrasound ct scan and elisa assays as binary with or without samples

. /* 
> cr_sample_binary.do                             // Generates or recodes ultrasound ct scan and elisa assays as binary with or without samples
>                                                                 // Include here the same for presence or absence of functional enzyme assays 
>                                                                 
> Juan Solon
> March 3 2025
> 
> */
. 
. **# Generate recruitment and sample variables
. 
. gen recruited = 1

.         la var recruited "Recruited"

. 
. gen assay_fecal_elastase = 1 if fecal_elastase !=. & fecal_elastase >0
(476 missing values generated)

.         replace assay_fe = 0 if fecal_elastase==. 
(476 real changes made)

.         la var assay_fe "Fecal Elastase"

. 
. gen assay_lipase = 1 if lipase !=. & lipase >0
(1,956 missing values generated)

.         replace assay_lip = 0 if lipase ==.
(1,956 real changes made)

.         la var assay_lip "Lipase"

. 
. /*
> gen assay_amylase = 1 if amylase !=. & amylase >0
>         *replace assay_amylase = 0 if amylase ==.
>         la var assay_amylase "Amylase"
>         
> gen assay_trypsinogen = 1 if trypsinogen !=. & trypsinogen >0
>         *replace assay_trypsinogen = 0 if trypsinogen ==.
>         la var assay_trypsinogen "Trypsinogen"
> */
. 
. **# Create new variables for imaging presence; Do not replace combined
. 
. 
. clonevar radio2 = radio_exam
(513 missing values generated)

.         replace radio2 = 0 if radio_exam==.
(513 real changes made)

.         la var radio2 "Ultrasound"

. 
. clonevar ct2 = ct_scan
(1,627 missing values generated)

.         replace ct2 = 0 if ct_scan==.
(1,627 real changes made)

.         la var ct2 "CT Scan"

. 
. egen radio_mis_dims = rowmiss(pan_head_ap pan_head_trans pan_body_trans pan_tail_trans)

. 
. 
. egen radio_mis_all = rowmiss(pan_size_qual pan_head_trans pan_head_ap pan_body_trans pan_tail_trans pan_shape pan_shape_problem pan_shape_prob_specify pan_contour pan_contour_problem pan_cont
> our_prob_specify pan_parenchyma pan_paren_inflam pan_paren_fibrosis pan_paren_steatosis pan_duct pan_duct_stones pan_duct_mass pan_calci pan_calci_place pan_cyst_yes pan_oth_abnormal pan_oth_
> abn_specify)

. 
. clonevar radio3 = radio2

. replace radio3 = 0 if radio_mis_dims ==4
(142 real changes made)

. la var radio3 "USS Scans Visualized"

. 
.         
. gen subset = 0

. replace subset = 1 if radio3==1 | assay_fecal_elastase ==1
(2,124 real changes made)

. la var subset "Analysis Subset (With Fe-1 or USS)"

. 
. gen subset2 = 0

. replace subset2 = 1 if radio3==1 | assay_fecal_elastase ==1 | ct2==1
(2,162 real changes made)

. la var subset2 "Analysis Subset 2 (With Fe-1 or USS or CT Scan)"

. 
. 
end of do-file

.                                                                                 // Include here the same for presence or absence of functional enzyme assays 
.                                                                                 // Revise once amylase and trypsinogen 
. 
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_categorical_outcomes.do

. /*
> cr_categorical_outcomes.do              
> Sampa
> Imaging Elastase Paper
> 
> Recodes fecal_elastase to with or without EPI and levels of EPI
> Include here any recoding of other functional enzymes
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         01-data
>         02-data-temp
>         03-tables
>         04-do
>         05-figures
>         log 
> */
. 
. egen epi_binary = cut(fecal_elastase), at(0,200,601) icodes
(476 missing values generated)

.         la var epi_binary "EPI"

.         recode epi_binary 0 = 1 1 = 0
(1,802 changes made to epi_binary)

.         
. 
.         label define epi_binary 0 "Without EPI" 1 "With EPI"

.         label values epi_binary epi_binary

.         
. 
. egen epi_ordinal = cut(fecal_elastase), at(0,100,200, 601) icodes
(476 missing values generated)

.         la var epi_ordinal "EPI Levels"

.         recode epi_ordinal 0 = 3 1 = 2 2 = 1 
(1,802 changes made to epi_ordinal)

. 
.         label define epi_ordinal 1 "Without EPI" 2 "Mild-Moderate EPI" 3 "Severe EPI"

.         label values epi_ordinal epi_ordinal

. 
end of do-file

. 
.                                                                                 // Recodes fecal_elastase to with or without EPI and levels of EPI
.                                                                                 // Include here any recoding of other functional enzymes once that data is in and cut-offs are known
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_categorical_independent.do

. /*
> SAMPA
> cr_categorical_independent.do
> March 3 2025
> J Solon
> 
> Creates categorical variables for indedpendent variables
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         data
>         data-temp
>         tables
>         do
>         figures
>         log 
>         
> */
. 
. * Any radiology variables
. 
. label variable pan_head_ap "Head, AP"

. label variable pan_head_trans  "Head, Transverse" 

. label variable pan_body_trans  "Body, Transverse"

. label variable pan_tail_trans  "Tail, Transverse"

. 
. 
. 
. * Cohort subcategorizations these are for creating graphs 
. 
. generate child = 1 if cohort ==1 | cohort ==2
(1,848 missing values generated)

.         replace child = 2 if cohort ==3 | cohort ==4 | cohort ==5 | cohort ==6
(1,848 real changes made)

.         la var child "Adult or Child Population"

. 
.         label define child 1 "Child" 2 "Adult"

.     label values child child

. 
.         
. generate africa =1 if cohort == 2 | cohort == 3 | cohort ==4
(905 missing values generated)

.         replace africa =2 if cohort == 1 | cohort == 5 | cohort ==6
(905 real changes made)

.         la var africa "Africa or Asia"

. 
.         label define africa 1 "Africa" 2 "Asia"

.         label values africa africa

. 
. 
. generate exposuretime = 1 if cohort ==1 | cohort ==2 | cohort ==6
(1,540 missing values generated)

.         replace exposuretime = 2 if cohort ==4 | cohort ==5 | cohort ==3
(1,540 real changes made)

.         
.         label define exposuretime 1 "Exposure in Childhood" 2 "Exposure as Adults"

.         label values exposuretime exposuretime

.         
.         la var exposuretime "Exposure Time"

.         
. gen fec_cohort = 1 if cohort ==1
(1,956 missing values generated)

.         replace fec_cohort = 2 if cohort == 5
(275 real changes made)

.         replace fec_cohort = 3 if cohort ==6
(308 real changes made)

.         replace fec_cohort = 4 if cohort == 2
(108 real changes made)

.         replace fec_cohort = 5 if cohort ==3
(976 real changes made)

.         replace fec_cohort = 6 if cohort == 4
(289 real changes made)

. 
.         la var fec_cohort "Cohort"

.         label define fec_cohort 1 "DIVIDS" 2 "St-ATT" 3 "CLHNS" 4 "SAM" 5 "CICADA" 6 "NUSTART"

.         label values fec_cohort fec_cohort

. 
. label define ever_mal 0 "NPM" 1 "PM", modify

. label values ever_mal ever_mal

. 
end of do-file

. 
.                                                                                 // Include here any derived variables for imaging that are categorical
. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_continuous_independent.do            // Derived variables for imaging that are continuous ; include transformations / weights

. /*
> SAMPA
> cr_continuous_independent.do
> March 3 2025
> J Solon
> 
> Creates continuous variables for Radiology
> 
> Creates pancreatic volumes based on the formula vy Li.
> 
> Reusable with
>         1.  Access to Dropbox
>         2.  Define globals and paths
>         3.  A working directory with 
>         01-data
>         02-data-temp
>         03-tables
>         04-do
>         05-figures
>         log 
>         
>         
> */
. 
. * Pancreatic Volume (CT)
. 
. cap drop ct_pan_vol

.         gen ct_pan_vol=((ct_pan_tail_trans+ct_pan_body_trans)/2)*ct_pan_body_tail*ct_pan_cc_body+((ct_pan_head_ap/2)^2)*3.14*ct_pan_cc_head
(2,036 missing values generated)

.         cap label variable ct_pan_vol "Calculated Pancreatic Volume; Study"

. 
.         
. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_cc_body ct_pan_cc_head {
  2.         gen adj_wt_`var' = `var'/weight
  3. }
(1,954 missing values generated)
(1,951 missing values generated)
(1,952 missing values generated)
(1,953 missing values generated)
(2,027 missing values generated)
(2,031 missing values generated)
(2,033 missing values generated)

. 
. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_cc_body ct_pan_cc_head {
  2.         gen adj_sqrt_`var' = sqrt(`var')
  3. }               
(1,954 missing values generated)
(1,951 missing values generated)
(1,952 missing values generated)
(1,953 missing values generated)
(2,027 missing values generated)
(2,031 missing values generated)
(2,033 missing values generated)

.         
. * Derived USS Variables 
. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj_wt_`var' = `var'/weight
  3. }
(729 missing values generated)
(882 missing values generated)
(673 missing values generated)
(1,082 missing values generated)

. 
. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj_sqrt_`var' = sqrt(`var')
  3. }               
(724 missing values generated)
(877 missing values generated)
(668 missing values generated)
(1,077 missing values generated)

.         
. 
. 
end of do-file

. 
.  cd `pwd'
/Users/juansolon/Documents/GitHub/sampa-radio

. do ./do/cr_keep.do 

. 
. local subj1 "record_id cohort sampa_id orgid sex dob age hiv"

. 
. local nutrition "bmi haz bmiz bmi_cat_child bmi_cat weight height"

. 
. local subj2 "indepth_sample indepth_exp ct_sample ct ivgtt_sample ivgtt uss_sample uss ever_mal degree_mal"

. 
. local ses "ses_tercile1 ses_tercile2 ses_tercile3 ses_tercile4 ses_tercile5 comp1 ses_tercile6 ses_tercile"

. 
. local uss "pan_size_qual pan_head_trans pan_head_ap pan_body_trans pan_tail_trans pan_shape pan_shape_problem pan_shape_prob_specify pan_contour pan_contour_problem pan_contour_prob_specify p
> an_parenchyma pan_paren_inflam pan_paren_fibrosis pan_paren_steatosis pan_duct pan_duct_stones pan_duct_mass pan_calci pan_calci_place pan_cyst_yes pan_oth_abnormal pan_oth_abn_specify pancre
> atic"

. 
. local ct "ct_pan_size_qual ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_cc_body ct_pan_cc_head ct_pan_shape ct_pan_shape_problem ct_pan_shape_p
> rob_spec ct_pan_contour ct_pan_contour_problem ct_pan_contour_prob_spec ct_pan_parenchyma ct_pan_paren_inflam ct_pan_paren_fibrosis ct_pan_paren_steatosis ct_pan_duct ct_pan_duct_stones ct_pa
> n_duct_mass ct_pan_calci ct_pan_calci_place ct_pan_oth_abnormal ct_pan_oth_abn_spec"

. 
. local derived1 "ct_pan_vol"

. 
. local derived2 "adj_wt_ct_pan_head_trans adj_wt_ct_pan_head_ap adj_wt_ct_pan_body_trans adj_wt_ct_pan_tail_trans adj_wt_ct_pan_body_tail adj_wt_ct_pan_cc_body adj_wt_ct_pan_cc_head adj_sqrt_c
> t_pan_head_trans adj_sqrt_ct_pan_head_ap adj_sqrt_ct_pan_body_trans adj_sqrt_ct_pan_tail_trans adj_sqrt_ct_pan_body_tail adj_sqrt_ct_pan_cc_body adj_sqrt_ct_pan_cc_head adj_wt_pan_head_ap adj
> _wt_pan_head_trans adj_wt_pan_body_trans adj_wt_pan_tail_trans adj_sqrt_pan_head_ap adj_sqrt_pan_head_trans adj_sqrt_pan_body_trans adj_sqrt_pan_tail_trans"

. 
. local derived3 "flag_fecal_elastase ngml_trypsinogen from_trypsin recruited assay_fecal_elastase assay_lipase radio2 ct2 radio_mis_dims radio_mis_all radio3 subset subset2 epi_binary epi_ordi
> nal child africa exposuretime fec_cohort"

. 
. local glucose "metformin insulin ogtt_time0 hba1c gluc_mean_mgdl insulin_mean_mul Matsuda_index insulinogenic_index rhba1c" 

. 
. local enzymes "fecal_elastase lipase ngml_trypsinogen mgl_crp mgl_cystatin ul_amylp"

. 
. local body "bia fm_kg fm_per ffm_kg ffm_per fmi ffmi impedance bia_prob bia_comment adp adpfm_kg adpffm_kg adpfm_per adpffm_per adp_prob adp_comment"

. 
. local organs "hepatomegaly splenomegaly cholelithiasis steatosis mass gynecologic atherosclerosis nephrolithiasis pancreatic"

. 
. 
. keep `subj1' `subj2' `ses' `uss' `ct' `derived1' `derived2' `derived3' `glucose' `enzymes' `body' `organs'

. 
. keep if subset==1
(154 observations deleted)

. 
end of do-file

. 
. notes drop _dta 
  (15 notes dropped)

. note: Subset Created for Imaging Paper on `c(current_date)' at `c(current_time)' by `c(username)'

. note: Keeps only participants with Fecal Elastse or Visible Ultrasound Scans (N=2124)

. note: Trypsin data inserted from temporary dropbox data 

. note: Selected variables kept for this paper in cr_keep.do 

. describe, simple
record_id     ivgtt         ses_tercile   mgl_crp       bia_comment   pan_body_t~s  pan_duct      mass          ct_pan_cc_~d  ct_pan_du~es  radio2        fec_cohort    adj_sqrt_c..
cohort        uss_sample    hiv           mgl_cystatin  adp           pan_tail_t~s  pan_duct_s~s  gynecologic   ct_pan_shape  ct_pan_du~ss  ct2           ct_pan_vol    adj_sqrt_c~l
sampa_id      uss           metformin     ul_amylp      adpfm_kg      pan_shape     pan_duct_m~s  atheroscle~s  ct_pan_sha~m  ct_pan_calci  radio_mis_~s  adj_wt_ct_..  adj_sqrt_c~y
orgid         ever_mal      insulin       bia           adpffm_kg     pan_shape_~m  pan_calci     nephrolith~s  ct_pan_sha~c  ct_pan_cal~e  radio_mis_~l  adj_wt_ct_~p  adj_sqrt_c~d
sex           degree_mal    ogtt_time0    fm_kg         adpfm_per     pan_shape_~y  pan_calci_~e  pancreatic    ct_pan_con~r  ct_pan_oth~l  radio3        adj_wt_ct_..  adj_wt_pan~p
dob           ses_tercile1  hba1c         fm_per        adpffm_per    pan_contour   pan_cyst_yes  ct_pan_siz~l  ct_pan_con~m  ct_pan_oth~c  subset        adj_wt_ct_..  adj_wt_pan..
age           ses_tercile2  gluc_mean_~l  ffm_kg        adp_prob      pan_contou~m  pan_oth_ab~l  ct_pan_hea~s  ct_pan_con~c  flag_fecal~e  subset2       adj_wt_ct_~l  adj_wt_pan..
indepth_sa~e  ses_tercile3  insulin_me~l  ffm_per       adp_comment   pan_contou~y  pan_oth_ab~y  ct_pan_hea~p  ct_pan_par~a  ngml_tryps~n  epi_binary    adj_wt_ct_~y  adj_wt_pan..
indepth_exp   ses_tercile4  Matsuda_in~x  fmi           fecal_elas~e  pan_parenc~a  hepatomegaly  ct_pan_bod~s  ct_pan_par~m  from_trypsin  epi_ordinal   adj_wt_ct_~d  adj_sqrt_p~p
ct_sample     ses_tercile5  insulinoge~x  ffmi          pan_size_q~l  pan_paren_~m  splenomegaly  ct_pan_tai~s  ct_pan~rosis  recruited     child         adj_sqrt_c..  adj_sqrt_p..
ct            comp1         rhba1c        impedance     pan_head_t~s  pan_pa~rosis  cholelithi~s  ct_pan_bod~l  ct_pan~tosis  assay_feca~e  africa        adj_sqrt_c~p  adj_sqrt_p..
ivgtt_sample  ses_tercile6  lipase        bia_prob      pan_head_ap   pan_pa~tosis  steatosis     ct_pan_cc_~y  ct_pan_duct   assay_lipase  exposuretime  adj_sqrt_c..  adj_sqrt_p..

. notes 

_dta:
  1.  Subset Created for Imaging Paper on 24 Mar 2025 at 10:28:52 by juansolon
  2.  Keeps only participants with Fecal Elastse or Visible Ultrasound Scans (N=2124)
  3.  Trypsin data inserted from temporary dropbox data
  4.  Selected variables kept for this paper in cr_keep.do

. 
. save ./data-temp/subset_imaging.dta, replace
file ./data-temp/subset_imaging.dta saved

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. collect clear

. 
. local col "ever_mal"

. local contmed "fecal_elastase ul_amylp lipase  ngml_trypsinogen"  /*continous variables; median (p25-p75)  will be reported*/

. 
. local colhead2 `"0 "NPM" 1 "PM""'

.                 
. * format median of `contmed'
. local nfrmt_p50 "%5.0f"

. local nfrmt_iqr "%5.0f"

. local sfrmt_p25 "(%s-"

. local sfrmt_p75 "%s)"

. 
. local title "Table . Pancreatic Enzyme Assays"

. 
. local notes1 "Values are [N] median (p25-p50)."

. local notes2 "Faecal elastase values are upper limit of detection is 600."

. local notes3 "Lipase from DIVIDS cohort only."

. local notes4 "Trypsinogen from CT Scan subset only."

. 
. * STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  
. * THERE IS NOTHING TO MODIFY BEYOND THIS LINE UNLESS CHANGING CODE. 
. 
. * GENERATE TABLE STATS 
. 
.         table (var)(`col')  , ///
>                 stat(frequency) ///
>                 stat(count `contmed') ///
>                 stat(p50 `contmed') ///
>                 stat(p25 `contmed') ///
>                 stat(p75 `contmed') ///
>                 nototal

----------------------------------------------------------------
                              |   Ever experience malnutrition? 
                              |             NPM               PM
------------------------------+---------------------------------
Frequency                     |           1,095            1,029
Fecal Elastase                |                                 
  Number of nonmissing values |           1,003              799
  50th percentile             |         313.704          374.824
  25th percentile             |         132.437         146.2165
  75th percentile             |        587.6312              600
Amylase (U/L)                 |                                 
  Number of nonmissing values |           1,008              757
  50th percentile             |            29.6             31.1
  25th percentile             |           23.45             24.4
  75th percentile             |              38               42
Lipase                        |                                 
  Number of nonmissing values |              54              253
  50th percentile             |            30.5               30
  25th percentile             |              26               26
  75th percentile             |              36               35
Trypsinogen (ng/ml)           |                                 
  Number of nonmissing values |             135              142
  50th percentile             |            24.2            25.75
  25th percentile             |            17.2             17.6
  75th percentile             |            32.5             36.1
----------------------------------------------------------------

.                 
. collect rename Table c1
(current collection is c1)

.                 
. *REFORMAT RESULTS TO DESIRED COLUMNS
.                 
.         * recodes median and iqr
.                 collect recode result p50 = column1
(8 items recoded in collection c1)

.                 collect recode result p25 = column2
(8 items recoded in collection c1)

.                 collect recode result p75 = column3
(8 items recoded in collection c1)

.                 
.         * Create composite result : this is needed because 75 is in column3 and we want it in the same column as column 2 .  Use for medians and probably CIs
.                 collect composite define column4 = column2 column3, replace

. 
.         * Calculate p-values from chi2 and df
.         foreach v in `contmed' {
  2.                 quietly kwallis `v', by(`col')
  3.                 collect: mystats
  4.         }

. 
.         
. 
. * CREATE THE TABLE 1 Layout Super column - column 
. 
.         collect layout (var) (ever_mal#result[count column1 column4])

Collection: c1
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 4 x 6

---------------------------------------------------------------------------------------------------------------------------------------------
                    |                                               Ever experience malnutrition?                                            
                    |                             NPM                                                          PM                            
                    |  Number of nonmissing values   column1     column2 column3   Number of nonmissing values   column1      column2 column3
--------------------+------------------------------------------------------------------------------------------------------------------------
Fecal Elastase      |                        1,003   313.704   132.437  587.6312                           799   374.824   146.2165       600
Amylase (U/L)       |                        1,008      29.6     23.45        38                           757      31.1       24.4        42
Lipase              |                           54      30.5        26        36                           253        30         26        35
Trypsinogen (ng/ml) |                          135      24.2      17.2      32.5                           142     25.75       17.6      36.1
---------------------------------------------------------------------------------------------------------------------------------------------

. 
. * Format p-values
.         collect style cell result[p], nformat("%5.3f")

.         collect style cell result[p], sformat("p=%s")

. 
. * CHANGE HEADER TEXT
.         * column
.                 collect label levels `col' `colhead2', modify

. 
. collect preview /* preview changes */

---------------------------------------------------------------------------------------------------------------------------------------------
                    |                                               Ever experience malnutrition?                                            
                    |                             NPM                                                          PM                            
                    |  Number of nonmissing values   column1     column2 column3   Number of nonmissing values   column1      column2 column3
--------------------+------------------------------------------------------------------------------------------------------------------------
Fecal Elastase      |                        1,003   313.704   132.437  587.6312                           799   374.824   146.2165       600
Amylase (U/L)       |                        1,008      29.6     23.45        38                           757      31.1       24.4        42
Lipase              |                           54      30.5        26        36                           253        30         26        35
Trypsinogen (ng/ml) |                          135      24.2      17.2      32.5                           142     25.75       17.6      36.1
---------------------------------------------------------------------------------------------------------------------------------------------

. 
. * HIDE COLUMN HEADERS
. 
.         * Hide supercolumn variable name because it is self-descriptive
.                 
.         *       collect style header `scol', title(hide) /* this removes the column variable name or label by hiding it */
. 
.         * Hide the column variable name 
.                 
.                 collect style header `col', title(hide) /* this removes the column variable name or label by hiding it */

. 
.         * Hide the words column 1 and column 2 for the results 
. 
.                 collect style header result, level(hide) /* this removes column 1 and column2 header names*/

. 
. collect preview /* preview changes */

-----------------------------------------------------------------------------------------------
                    |                  NPM                                   PM                
--------------------+--------------------------------------------------------------------------
Fecal Elastase      |  1,003   313.704   132.437  587.6312   799   374.824   146.2165       600
Amylase (U/L)       |  1,008      29.6     23.45        38   757      31.1       24.4        42
Lipase              |     54      30.5        26        36   253        30         26        35
Trypsinogen (ng/ml) |    135      24.2      17.2      32.5   142     25.75       17.6      36.1
-----------------------------------------------------------------------------------------------

. 
. * MODIFY ROW TEXT
. 
. 
. * REVISE ROW STYLES
. 
. * Stack levels of each variable , place a space between variables (spacer) ; 
. 
.         collect style row stack, nobinder spacer

. 
. * Remove vertical line after variables
. 
.         collect style cell border_block, border(right, pattern(nil))

. 
. * HIDE ROW Text
. 
. * Hide the variable names 
. collect style header `hiderows', title(hide)

. 
. 
. * FORMAT NUMBERS
. 
. * Format median
. 
.         collect style cell result[column1]#var[`contmed'], nformat(`nfrmt_p50')

. 
. * Add IQR formatting to p25 and p75 separately:
.         collect style cell result[column2]#var[`contmed'], nformat(`nfrmt_iqr') sformat("`sfrmt_p25'") /* formats iqr as (p25 - p75)*/

.         collect style cell result[column3]#var[`contmed'], nformat(`nfrmt_iqr') sformat("`sfrmt_p75'") 

. 
. * Format count column
.         collect style cell result[count], nformat("%4.0f") /* Format count as whole number */

.         collect style cell result[count], sformat("[%s]") /* Format count as whole number */

.         
. /* format factor variables (categorical) column 1 and column 2
> 
>         collect style cell var[`frmt_catvar1']#result[column1], nformat(`nfrmt_freq')
> 
>         collect style cell var[`frmt_catvar1']#result[column2], nformat(`nfrmt_perc') sformat("(`sfrmt_perc')") /* Adds (%) to percent */
> 
> * format means variable column 1 and column 2
> 
>         collect style cell var[`contn']#result[column1], nformat(`nfrmt_mean') /* Formats continuous variable to one decimal*/
> 
>         collect style cell var[`contn']#result[column2], nformat(`nfrmt_sd') sformat(`sfrmt_sd') /* Formats continuous variable to one decimal*/
> */
. * Change font of results
.         *collect style cell var[`contn']#result[column1], nformat(`nfrmt_mean') /* Formats continuous variable to one decimal*/
.         
. * Add text
.         collect title `title'

.         collect notes `notes1'

.         collect notes `notes2'

.         collect notes `notes3'

.         collect notes `notes4'

.         
. collect preview

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
. * Save first collection with main stats
. collect layout (var) (ever_mal#result[count column1 column4])

Collection: c1
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 4 x 6

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. collect save ./tables/enzymes1.json, replace
(collection c1 saved to file ./tables/enzymes1.json)

. 
. * Create new collection for p-values
. collect create c2
(current collection is c2)

. foreach v in `contmed' {
  2.     quietly kwallis `v', by(`col')
  3.     collect: mystats
  4. }

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect dir // check collections

Collections in memory
Current: c2
----------------
Name   No. items
----------------
  c1   54       
  c2   20       
----------------

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect remap cmdset[1 2 3 4] = pvals[fecal_elastase ul_amylp lipase ngml_trypsinogen]
(20 items remapped in collection c2)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (pvals) (result[p])

Collection: c2
      Rows: pvals
   Columns: result[p]
   Table 1: 4 x 1

---------------------------
                 |        p
-----------------+---------
fecal_elastase   | .0048937
ul_amylp         | .0005191
lipase           | .5761808
ngml_trypsinogen | .2860171
---------------------------

. 
end of do-file

. collect dims

Collection dimensions
Collection: c2
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
                      cmdset   4         
               program_class   2         
                       pvals   4         
                      result   5         
                 result_type   1         

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. collect levelsof result

Collection: c2
 Dimension: result
    Levels: Chi2 Chi2_adj DF p p_adj

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect combine c3 = c1 c2
(current collection is c3)

. 
end of do-file

. collect dims

Collection dimensions
Collection: c3
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
                      cmdset   4         
                  collection   2         
                     colname   4         
                     command   1         
                    ever_mal   2         
               program_class   2         
                       pvals   4         
                      result   14        
                 result_type   1         
                     statcmd   5         
                         var   5         

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. collect levelsof var

Collection: c3
 Dimension: var
    Levels: _hide fecal_elastase ul_amylp lipase ngml_trypsinogen

. collect levelsof result

Collection: c3
 Dimension: result
    Levels: Chi2 Chi2_adj DF column1 column2 column3 column4 count frequency p p25 p50 p75 p_adj

. collect layout (var) (result)

Collection: c3
      Rows: var
   Columns: result

Your layout specification does not uniquely match any items. One or more of the following dimensions might help uniquely match items: colname, ever_mal, statcmd.

. collect layout (var) (ever_mal#result)

Collection: c3
      Rows: var
   Columns: ever_mal#result
   Table 1: 5 x 4

Table . Pancreatic Enzyme Assays
---------------------------------------------------
                           NPM              PM     
---------------------------------------------------
                     1,095            1,029        
Fecal Elastase               [1003]           [799]
Amylase (U/L)                [1008]           [757]
Lipase                         [54]           [253]
Trypsinogen (ng/ml)           [135]           [142]
---------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. collect layout (var) (ever_mal#result[column1 column4)
invalid something: [ closed by )

r(198);

. collect layout (var) (ever_mal#result[column1 column4])

Collection: c3
      Rows: var
   Columns: ever_mal#result[column1 column4]
   Table 1: 4 x 4

Table . Pancreatic Enzyme Assays
----------------------------------------------------------
                            NPM                  PM       
----------------------------------------------------------
Fecal Elastase       314   (132-  588)   375   (146-  600)
Amylase (U/L)         30    (23-   38)    31    (24-   42)
Lipase                30    (26-   36)    30    (26-   35)
Trypsinogen (ng/ml)   24    (17-   32)    26    (18-   36)
----------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. collect layout (var) (ever_mal#result[column1 column4 p])

Collection: c3
      Rows: var
   Columns: ever_mal#result[column1 column4 p]
   Table 1: 4 x 4

Table . Pancreatic Enzyme Assays
----------------------------------------------------------
                            NPM                  PM       
----------------------------------------------------------
Fecal Elastase       314   (132-  588)   375   (146-  600)
Amylase (U/L)         30    (23-   38)    31    (24-   42)
Lipase                30    (26-   36)    30    (26-   35)
Trypsinogen (ng/ml)   24    (17-   32)    26    (18-   36)
----------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. collect layout (var) (ever_mal#result[column1 column4])

Collection: c3
      Rows: var
   Columns: ever_mal#result[column1 column4]
   Table 1: 4 x 4

Table . Pancreatic Enzyme Assays
----------------------------------------------------------
                            NPM                  PM       
----------------------------------------------------------
Fecal Elastase       314   (132-  588)   375   (146-  600)
Amylase (U/L)         30    (23-   38)    31    (24-   42)
Lipase                30    (26-   36)    30    (26-   35)
Trypsinogen (ng/ml)   24    (17-   32)    26    (18-   36)
----------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. collect layout (cmdset) (ever_mal#result[p])

Collection: c3
      Rows: cmdset
   Columns: ever_mal#result[p]

Your layout specification does not uniquely match any items. One or more of the following dimensions might help uniquely match items: colname, ever_mal, result, statcmd, var.

. collect layout (cmdset) (result[p])

Collection: c3
      Rows: cmdset
   Columns: result[p]
   Table 1: 4 x 1

Table . Pancreatic Enzyme Assays
----------
1  p=0.005
2  p=0.001
3  p=0.576
4  p=0.286
----------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. collect layout (cmdset) (var#result[p])

Collection: c3
      Rows: cmdset
   Columns: var#result[p]
   Table 1: 4 x 1

Table . Pancreatic Enzyme Assays
----------
1  p=0.005
2  p=0.001
3  p=0.576
4  p=0.286
----------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. collect layout (cmdset) (ever_mal#result[count] var#result[p])

Collection: c3
      Rows: cmdset
   Columns: ever_mal#result[count] var#result[p]
   Table 1: 4 x 1

Table . Pancreatic Enzyme Assays
----------
1  p=0.005
2  p=0.001
3  p=0.576
4  p=0.286
----------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. collect layout (var cmdset) (ever_mal#result[count] var#result[p])
invalid layout; dimension var cannot take on levels fecal_elastase and _hide at the same time
r(507);

. collect layout (var#cmdset) (ever_mal#result[count] var#result[p])
invalid layout; dimension var cannot take on levels fecal_elastase and _hide at the same time
r(507);

. collect layout (var) (ever_mal#result[count] var#result[p])
invalid layout; dimension var cannot take on levels fecal_elastase and _hide at the same time
r(507);

. collect layout () (ever_mal#result[count] var#result[p])

Collection: c3
   Columns: ever_mal#result[count] var#result[p]

Your layout specification does not uniquely match any items. One or more of the following dimensions might help uniquely match items: cmdset, colname, var.

. collect layout (cmdset) (ever_mal#result[count])

Collection: c3
      Rows: cmdset
   Columns: ever_mal#result[count]

Your layout specification does not uniquely match any items. One or both of the dimensions colname and var might help uniquely match items.

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var) (ever_mal#result[count column1 column4]) (pvals#result[p])
invalid layout; dimension result cannot take on levels count and p at the same time
r(507);

end of do-file

r(507);

. collect dims

Collection dimensions
Collection: c3
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
                      cmdset   4         
                  collection   2         
                     colname   4         
                     command   1         
                    ever_mal   2         
               program_class   2         
                       pvals   4         
                      result   14        
                 result_type   1         
                     statcmd   5         
                         var   5         

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var[fecal_elastase]) (result[column1])

Collection: c3
      Rows: var[fecal_elastase]
   Columns: result[column1]

Your layout specification does not uniquely match any items. Dimension ever_mal might help uniquely match items.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var) (result[column1])

Collection: c3
      Rows: var
   Columns: result[column1]

Your layout specification does not uniquely match any items. One or both of the dimensions colname and ever_mal might help uniquely match items.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var) (ever_mal#esult[column1])
(dimension esult not found)

Collection: c3
      Rows: var
   Columns: ever_mal#esult[column1]

Your layout specification does not uniquely match any items. One or more of the following dimensions might help uniquely match items: cmdset, colname, ever_mal, result, statcmd.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var) (ever_mal#result[column1])

Collection: c3
      Rows: var
   Columns: ever_mal#result[column1]
   Table 1: 4 x 2

Table . Pancreatic Enzyme Assays
------------------------------
                     NPM    PM
------------------------------
Fecal Elastase       314   375
Amylase (U/L)         30    31
Lipase                30    30
Trypsinogen (ng/ml)   24    26
------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var[fecal_elastase]) (ever_mal#result[column1])

Collection: c3
      Rows: var[fecal_elastase]
   Columns: ever_mal#result[column1]
   Table 1: 1 x 2

Table . Pancreatic Enzyme Assays
-------------------------
                NPM    PM
-------------------------
Fecal Elastase  314   375
-------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var[fecal_elastase] var[lipase]) (ever_mal#result[column1])

Collection: c3
      Rows: var[fecal_elastase] var[lipase]
   Columns: ever_mal#result[column1]
   Table 1: 2 x 2

Table . Pancreatic Enzyme Assays
-------------------------
                NPM    PM
-------------------------
Fecal Elastase  314   375
Lipase           30    30
-------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var[fecal_elastase] var[lipase]) (ever_mal#result[column1] pvals#result[p])

Collection: c3
      Rows: var[fecal_elastase] var[lipase]
   Columns: ever_mal#result[column1] pvals#result[p]
   Table 1: 2 x 2

Table . Pancreatic Enzyme Assays
-------------------------
                NPM    PM
-------------------------
Fecal Elastase  314   375
Lipase           30    30
-------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var[fecal_elastase] var[lipase]) (ever_mal#result[column1] cmdset#result[p])

Collection: c3
      Rows: var[fecal_elastase] var[lipase]
   Columns: ever_mal#result[column1] cmdset#result[p]
   Table 1: 2 x 2

Table . Pancreatic Enzyme Assays
-------------------------
                NPM    PM
-------------------------
Fecal Elastase  314   375
Lipase           30    30
-------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var) (ever_mal#result[count column1 column4] pvals#result[p])

Collection: c3
      Rows: var
   Columns: ever_mal#result[count column1 column4] pvals#result[p]
   Table 1: 4 x 6

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var pvals) (ever_mal#result[count column1 column4] result[p])

Collection: c3
      Rows: var pvals
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 9 x 7

Table . Pancreatic Enzyme Assays
-------------------------------------------------------------------------------------
                                 NPM                          PM                     
-------------------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)          
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)          
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)          
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)          
                                                                                     
fecal_elastase                                                                p=0.005
ul_amylp                                                                      p=0.001
lipase                                                                        p=0.576
ngml_trypsinogen                                                              p=0.286
-------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. collect clear

. 
. local col "ever_mal"

. local contmed "fecal_elastase ul_amylp lipase  ngml_trypsinogen"  /*continous variables; median (p25-p75)  will be reported*/

. 
. local colhead2 `"0 "NPM" 1 "PM""'

.                 
. * format median of `contmed'
. local nfrmt_p50 "%5.0f"

. local nfrmt_iqr "%5.0f"

. local sfrmt_p25 "(%s-"

. local sfrmt_p75 "%s)"

. 
. local title "Table . Pancreatic Enzyme Assays"

. 
. local notes1 "Values are [N] median (p25-p50)."

. local notes2 "Faecal elastase values are upper limit of detection is 600."

. local notes3 "Lipase from DIVIDS cohort only."

. local notes4 "Trypsinogen from CT Scan subset only."

. 
. * STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  
. * THERE IS NOTHING TO MODIFY BEYOND THIS LINE UNLESS CHANGING CODE. 
. 
. * GENERATE TABLE STATS 
. 
.         table (var)(`col')  , ///
>                 stat(frequency) ///
>                 stat(count `contmed') ///
>                 stat(p50 `contmed') ///
>                 stat(p25 `contmed') ///
>                 stat(p75 `contmed') ///
>                 nototal

----------------------------------------------------------------
                              |   Ever experience malnutrition? 
                              |             NPM               PM
------------------------------+---------------------------------
Frequency                     |           1,095            1,029
Fecal Elastase                |                                 
  Number of nonmissing values |           1,003              799
  50th percentile             |         313.704          374.824
  25th percentile             |         132.437         146.2165
  75th percentile             |        587.6312              600
Amylase (U/L)                 |                                 
  Number of nonmissing values |           1,008              757
  50th percentile             |            29.6             31.1
  25th percentile             |           23.45             24.4
  75th percentile             |              38               42
Lipase                        |                                 
  Number of nonmissing values |              54              253
  50th percentile             |            30.5               30
  25th percentile             |              26               26
  75th percentile             |              36               35
Trypsinogen (ng/ml)           |                                 
  Number of nonmissing values |             135              142
  50th percentile             |            24.2            25.75
  25th percentile             |            17.2             17.6
  75th percentile             |            32.5             36.1
----------------------------------------------------------------

.                 
. collect rename Table c1
(current collection is c1)

.                 
. *REFORMAT RESULTS TO DESIRED COLUMNS
.                 
.         * recodes median and iqr
.                 collect recode result p50 = column1
(8 items recoded in collection c1)

.                 collect recode result p25 = column2
(8 items recoded in collection c1)

.                 collect recode result p75 = column3
(8 items recoded in collection c1)

.                 
.         * Create composite result : this is needed because 75 is in column3 and we want it in the same column as column 2 .  Use for medians and probably CIs
.                 collect composite define column4 = column2 column3, replace

. 
.         * Calculate p-values from chi2 and df
.         foreach v in `contmed' {
  2.                 quietly kwallis `v', by(`col')
  3.                 collect: mystats
  4.         }

. 
.         
. 
. * CREATE THE TABLE 1 Layout Super column - column 
. 
.         collect layout (var) (ever_mal#result[count column1 column4])

Collection: c1
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 4 x 6

---------------------------------------------------------------------------------------------------------------------------------------------
                    |                                               Ever experience malnutrition?                                            
                    |                             NPM                                                          PM                            
                    |  Number of nonmissing values   column1     column2 column3   Number of nonmissing values   column1      column2 column3
--------------------+------------------------------------------------------------------------------------------------------------------------
Fecal Elastase      |                        1,003   313.704   132.437  587.6312                           799   374.824   146.2165       600
Amylase (U/L)       |                        1,008      29.6     23.45        38                           757      31.1       24.4        42
Lipase              |                           54      30.5        26        36                           253        30         26        35
Trypsinogen (ng/ml) |                          135      24.2      17.2      32.5                           142     25.75       17.6      36.1
---------------------------------------------------------------------------------------------------------------------------------------------

. 
. * Format p-values
.         collect style cell result[p], nformat("%5.3f")

.         collect style cell result[p], sformat("p=%s")

. 
. * CHANGE HEADER TEXT
.         * column
.                 collect label levels `col' `colhead2', modify

. 
. collect preview /* preview changes */

---------------------------------------------------------------------------------------------------------------------------------------------
                    |                                               Ever experience malnutrition?                                            
                    |                             NPM                                                          PM                            
                    |  Number of nonmissing values   column1     column2 column3   Number of nonmissing values   column1      column2 column3
--------------------+------------------------------------------------------------------------------------------------------------------------
Fecal Elastase      |                        1,003   313.704   132.437  587.6312                           799   374.824   146.2165       600
Amylase (U/L)       |                        1,008      29.6     23.45        38                           757      31.1       24.4        42
Lipase              |                           54      30.5        26        36                           253        30         26        35
Trypsinogen (ng/ml) |                          135      24.2      17.2      32.5                           142     25.75       17.6      36.1
---------------------------------------------------------------------------------------------------------------------------------------------

. 
. * HIDE COLUMN HEADERS
. 
.         * Hide supercolumn variable name because it is self-descriptive
.                 
.         *       collect style header `scol', title(hide) /* this removes the column variable name or label by hiding it */
. 
.         * Hide the column variable name 
.                 
.                 collect style header `col', title(hide) /* this removes the column variable name or label by hiding it */

. 
.         * Hide the words column 1 and column 2 for the results 
. 
.                 collect style header result, level(hide) /* this removes column 1 and column2 header names*/

. 
. collect preview /* preview changes */

-----------------------------------------------------------------------------------------------
                    |                  NPM                                   PM                
--------------------+--------------------------------------------------------------------------
Fecal Elastase      |  1,003   313.704   132.437  587.6312   799   374.824   146.2165       600
Amylase (U/L)       |  1,008      29.6     23.45        38   757      31.1       24.4        42
Lipase              |     54      30.5        26        36   253        30         26        35
Trypsinogen (ng/ml) |    135      24.2      17.2      32.5   142     25.75       17.6      36.1
-----------------------------------------------------------------------------------------------

. 
. * MODIFY ROW TEXT
. 
. 
. * REVISE ROW STYLES
. 
. * Stack levels of each variable , place a space between variables (spacer) ; 
. 
.         collect style row stack, nobinder spacer

. 
. * Remove vertical line after variables
. 
.         collect style cell border_block, border(right, pattern(nil))

. 
. * HIDE ROW Text
. 
. * Hide the variable names 
. collect style header `hiderows', title(hide)

. 
. 
. * FORMAT NUMBERS
. 
. * Format median
. 
.         collect style cell result[column1]#var[`contmed'], nformat(`nfrmt_p50')

. 
. * Add IQR formatting to p25 and p75 separately:
.         collect style cell result[column2]#var[`contmed'], nformat(`nfrmt_iqr') sformat("`sfrmt_p25'") /* formats iqr as (p25 - p75)*/

.         collect style cell result[column3]#var[`contmed'], nformat(`nfrmt_iqr') sformat("`sfrmt_p75'") 

. 
. * Format count column
.         collect style cell result[count], nformat("%4.0f") /* Format count as whole number */

.         collect style cell result[count], sformat("[%s]") /* Format count as whole number */

.         
. /* format factor variables (categorical) column 1 and column 2
> 
>         collect style cell var[`frmt_catvar1']#result[column1], nformat(`nfrmt_freq')
> 
>         collect style cell var[`frmt_catvar1']#result[column2], nformat(`nfrmt_perc') sformat("(`sfrmt_perc')") /* Adds (%) to percent */
> 
> * format means variable column 1 and column 2
> 
>         collect style cell var[`contn']#result[column1], nformat(`nfrmt_mean') /* Formats continuous variable to one decimal*/
> 
>         collect style cell var[`contn']#result[column2], nformat(`nfrmt_sd') sformat(`sfrmt_sd') /* Formats continuous variable to one decimal*/
> */
. * Change font of results
.         *collect style cell var[`contn']#result[column1], nformat(`nfrmt_mean') /* Formats continuous variable to one decimal*/
.         
. * Add text
.         collect title `title'

.         collect notes `notes1'

.         collect notes `notes2'

.         collect notes `notes3'

.         collect notes `notes4'

.         
. collect preview

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
. * Save first collection with main stats
. collect layout (var) (ever_mal#result[count column1 column4])

Collection: c1
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 4 x 6

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. collect save ./tables/enzymes1.json, replace
(collection c1 saved to file ./tables/enzymes1.json)

. 
. * Create new collection for p-values
. collect create c2
(current collection is c2)

. foreach v in `contmed' {
  2.     quietly kwallis `v', by(`col')
  3.     collect: mystats
  4. }

. 
. collect dir // check collections

Collections in memory
Current: c2
----------------
Name   No. items
----------------
  c1   54       
  c2   20       
----------------

. 
. * Create p-value layout and remap cmdset to pvals
. collect remap cmdset[1 2 3 4] = pvals[fecal_elastase ul_amylp lipase ngml_trypsinogen]
(20 items remapped in collection c2)

. collect layout (pvals) (result[p])

Collection: c2
      Rows: pvals
   Columns: result[p]
   Table 1: 4 x 1

---------------------------
                 |        p
-----------------+---------
fecal_elastase   | .0048937
ul_amylp         | .0005191
lipase           | .5761808
ngml_trypsinogen | .2860171
---------------------------

. 
. * Combine collections
. collect combine c3 = c1 c2
(current collection is c3)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var pvals) (ever_mal#result[count column1 column4] result[p])

Collection: c3
      Rows: var pvals
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 9 x 7

Table . Pancreatic Enzyme Assays
-------------------------------------------------------------------------------------
                                 NPM                          PM                     
-------------------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)          
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)          
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)          
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)          
                                                                                     
fecal_elastase                                                                p=0.005
ul_amylp                                                                      p=0.001
lipase                                                                        p=0.576
ngml_trypsinogen                                                              p=0.286
-------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (pvals) (result[p])

Collection: c3
      Rows: pvals
   Columns: result[p]
   Table 1: 4 x 1

Table . Pancreatic Enzyme Assays
-------------------------
fecal_elastase    p=0.005
ul_amylp          p=0.001
lipase            p=0.576
ngml_trypsinogen  p=0.286
-------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var) (result[p])

Collection: c3
      Rows: var
   Columns: result[p]

Your layout specification does not uniquely match any items. Dimension cmdset might help uniquely match items.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (cmdset) (result[p])

Collection: c3
      Rows: cmdset
   Columns: result[p]
   Table 1: 4 x 1

Table . Pancreatic Enzyme Assays
----------
1  p=0.005
2  p=0.001
3  p=0.576
4  p=0.286
----------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var pvals) (ever_mal#result[count column1 column4] result[p])

Collection: c3
      Rows: var pvals
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 9 x 7

Table . Pancreatic Enzyme Assays
-------------------------------------------------------------------------------------
                                 NPM                          PM                     
-------------------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)          
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)          
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)          
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)          
                                                                                     
fecal_elastase                                                                p=0.005
ul_amylp                                                                      p=0.001
lipase                                                                        p=0.576
ngml_trypsinogen                                                              p=0.286
-------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout(var) (ever_mal#result[count column1 column4])
collect layout(var) not recognized
r(199);

end of do-file

r(199);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var) (ever_mal#result[count column1 column4])

Collection: c3
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 4 x 6

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (cmdset) (ever_mal#result[count column1 column4])

Collection: c3
      Rows: cmdset
   Columns: ever_mal#result[count column1 column4]

Your layout specification does not uniquely match any items. One or more of the following dimensions might help uniquely match items: colname, statcmd, var.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (cmdset) (result[p])

Collection: c3
      Rows: cmdset
   Columns: result[p]
   Table 1: 4 x 1

Table . Pancreatic Enzyme Assays
----------
1  p=0.005
2  p=0.001
3  p=0.576
4  p=0.286
----------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var cmdset) (ever_mal#result[count column1 column4] result[p])

Collection: c3
      Rows: var cmdset
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 9 x 7

Table . Pancreatic Enzyme Assays
-------------------------------------------------------------------------------------
                                 NPM                          PM                     
-------------------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)          
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)          
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)          
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)          
                                                                                     
1                                                                             p=0.005
2                                                                             p=0.001
3                                                                             p=0.576
4                                                                             p=0.286
-------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect remap cmdset cmdset = var
cmdset cmdset found where dimension name expected
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect remap cmdset = var
dimension var already exists in tag matched with cmdset[1]
r(198);

end of do-file

r(198);

. help collect drop

. help remap

. help collect remap

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect remap cmdset = var2
(54 items remapped in collection c3)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. collect clear

. 
. local col "ever_mal"

. local contmed "fecal_elastase ul_amylp lipase  ngml_trypsinogen"  /*continous variables; median (p25-p75)  will be reported*/

. 
. local colhead2 `"0 "NPM" 1 "PM""'

.                 
. * format median of `contmed'
. local nfrmt_p50 "%5.0f"

. local nfrmt_iqr "%5.0f"

. local sfrmt_p25 "(%s-"

. local sfrmt_p75 "%s)"

. 
. local title "Table . Pancreatic Enzyme Assays"

. 
. local notes1 "Values are [N] median (p25-p50)."

. local notes2 "Faecal elastase values are upper limit of detection is 600."

. local notes3 "Lipase from DIVIDS cohort only."

. local notes4 "Trypsinogen from CT Scan subset only."

. 
. * STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  
. * THERE IS NOTHING TO MODIFY BEYOND THIS LINE UNLESS CHANGING CODE. 
. 
. * GENERATE TABLE STATS 
. 
.         table (var)(`col')  , ///
>                 stat(frequency) ///
>                 stat(count `contmed') ///
>                 stat(p50 `contmed') ///
>                 stat(p25 `contmed') ///
>                 stat(p75 `contmed') ///
>                 nototal

----------------------------------------------------------------
                              |   Ever experience malnutrition? 
                              |             NPM               PM
------------------------------+---------------------------------
Frequency                     |           1,095            1,029
Fecal Elastase                |                                 
  Number of nonmissing values |           1,003              799
  50th percentile             |         313.704          374.824
  25th percentile             |         132.437         146.2165
  75th percentile             |        587.6312              600
Amylase (U/L)                 |                                 
  Number of nonmissing values |           1,008              757
  50th percentile             |            29.6             31.1
  25th percentile             |           23.45             24.4
  75th percentile             |              38               42
Lipase                        |                                 
  Number of nonmissing values |              54              253
  50th percentile             |            30.5               30
  25th percentile             |              26               26
  75th percentile             |              36               35
Trypsinogen (ng/ml)           |                                 
  Number of nonmissing values |             135              142
  50th percentile             |            24.2            25.75
  25th percentile             |            17.2             17.6
  75th percentile             |            32.5             36.1
----------------------------------------------------------------

.                 
. collect rename Table c1
(current collection is c1)

.                 
. *REFORMAT RESULTS TO DESIRED COLUMNS
.                 
.         * recodes median and iqr
.                 collect recode result p50 = column1
(8 items recoded in collection c1)

.                 collect recode result p25 = column2
(8 items recoded in collection c1)

.                 collect recode result p75 = column3
(8 items recoded in collection c1)

.                 
.         * Create composite result : this is needed because 75 is in column3 and we want it in the same column as column 2 .  Use for medians and probably CIs
.                 collect composite define column4 = column2 column3, replace

. 
.         * Calculate p-values from chi2 and df
.         foreach v in `contmed' {
  2.                 quietly kwallis `v', by(`col')
  3.                 collect: mystats
  4.         }

. 
.         
. 
. * CREATE THE TABLE 1 Layout Super column - column 
. 
.         collect layout (var) (ever_mal#result[count column1 column4])

Collection: c1
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 4 x 6

---------------------------------------------------------------------------------------------------------------------------------------------
                    |                                               Ever experience malnutrition?                                            
                    |                             NPM                                                          PM                            
                    |  Number of nonmissing values   column1     column2 column3   Number of nonmissing values   column1      column2 column3
--------------------+------------------------------------------------------------------------------------------------------------------------
Fecal Elastase      |                        1,003   313.704   132.437  587.6312                           799   374.824   146.2165       600
Amylase (U/L)       |                        1,008      29.6     23.45        38                           757      31.1       24.4        42
Lipase              |                           54      30.5        26        36                           253        30         26        35
Trypsinogen (ng/ml) |                          135      24.2      17.2      32.5                           142     25.75       17.6      36.1
---------------------------------------------------------------------------------------------------------------------------------------------

. 
. * Format p-values
.         collect style cell result[p], nformat("%5.3f")

.         collect style cell result[p], sformat("p=%s")

. 
. * CHANGE HEADER TEXT
.         * column
.                 collect label levels `col' `colhead2', modify

. 
. collect preview /* preview changes */

---------------------------------------------------------------------------------------------------------------------------------------------
                    |                                               Ever experience malnutrition?                                            
                    |                             NPM                                                          PM                            
                    |  Number of nonmissing values   column1     column2 column3   Number of nonmissing values   column1      column2 column3
--------------------+------------------------------------------------------------------------------------------------------------------------
Fecal Elastase      |                        1,003   313.704   132.437  587.6312                           799   374.824   146.2165       600
Amylase (U/L)       |                        1,008      29.6     23.45        38                           757      31.1       24.4        42
Lipase              |                           54      30.5        26        36                           253        30         26        35
Trypsinogen (ng/ml) |                          135      24.2      17.2      32.5                           142     25.75       17.6      36.1
---------------------------------------------------------------------------------------------------------------------------------------------

. 
. * HIDE COLUMN HEADERS
. 
.         * Hide supercolumn variable name because it is self-descriptive
.                 
.         *       collect style header `scol', title(hide) /* this removes the column variable name or label by hiding it */
. 
.         * Hide the column variable name 
.                 
.                 collect style header `col', title(hide) /* this removes the column variable name or label by hiding it */

. 
.         * Hide the words column 1 and column 2 for the results 
. 
.                 collect style header result, level(hide) /* this removes column 1 and column2 header names*/

. 
. collect preview /* preview changes */

-----------------------------------------------------------------------------------------------
                    |                  NPM                                   PM                
--------------------+--------------------------------------------------------------------------
Fecal Elastase      |  1,003   313.704   132.437  587.6312   799   374.824   146.2165       600
Amylase (U/L)       |  1,008      29.6     23.45        38   757      31.1       24.4        42
Lipase              |     54      30.5        26        36   253        30         26        35
Trypsinogen (ng/ml) |    135      24.2      17.2      32.5   142     25.75       17.6      36.1
-----------------------------------------------------------------------------------------------

. 
. * MODIFY ROW TEXT
. 
. 
. * REVISE ROW STYLES
. 
. * Stack levels of each variable , place a space between variables (spacer) ; 
. 
.         collect style row stack, nobinder spacer

. 
. * Remove vertical line after variables
. 
.         collect style cell border_block, border(right, pattern(nil))

. 
. * HIDE ROW Text
. 
. * Hide the variable names 
. collect style header `hiderows', title(hide)

. 
. 
. * FORMAT NUMBERS
. 
. * Format median
. 
.         collect style cell result[column1]#var[`contmed'], nformat(`nfrmt_p50')

. 
. * Add IQR formatting to p25 and p75 separately:
.         collect style cell result[column2]#var[`contmed'], nformat(`nfrmt_iqr') sformat("`sfrmt_p25'") /* formats iqr as (p25 - p75)*/

.         collect style cell result[column3]#var[`contmed'], nformat(`nfrmt_iqr') sformat("`sfrmt_p75'") 

. 
. * Format count column
.         collect style cell result[count], nformat("%4.0f") /* Format count as whole number */

.         collect style cell result[count], sformat("[%s]") /* Format count as whole number */

.         
. /* format factor variables (categorical) column 1 and column 2
> 
>         collect style cell var[`frmt_catvar1']#result[column1], nformat(`nfrmt_freq')
> 
>         collect style cell var[`frmt_catvar1']#result[column2], nformat(`nfrmt_perc') sformat("(`sfrmt_perc')") /* Adds (%) to percent */
> 
> * format means variable column 1 and column 2
> 
>         collect style cell var[`contn']#result[column1], nformat(`nfrmt_mean') /* Formats continuous variable to one decimal*/
> 
>         collect style cell var[`contn']#result[column2], nformat(`nfrmt_sd') sformat(`sfrmt_sd') /* Formats continuous variable to one decimal*/
> */
. * Change font of results
.         *collect style cell var[`contn']#result[column1], nformat(`nfrmt_mean') /* Formats continuous variable to one decimal*/
.         
. * Add text
.         collect title `title'

.         collect notes `notes1'

.         collect notes `notes2'

.         collect notes `notes3'

.         collect notes `notes4'

.         
. collect preview

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
. * Save first collection with main stats
. collect layout (var) (ever_mal#result[count column1 column4])

Collection: c1
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 4 x 6

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. collect save ./tables/enzymes1.json, replace
(collection c1 saved to file ./tables/enzymes1.json)

. 
. * Create new collection for p-values
. collect create c2
(current collection is c2)

. foreach v in `contmed' {
  2.     quietly kwallis `v', by(`col')
  3.     collect: mystats
  4. }

. 
. collect dir // check collections

Collections in memory
Current: c2
----------------
Name   No. items
----------------
  c1   54       
  c2   20       
----------------

. 
. * Combine collections
. collect combine c3 = c1 c2
(current collection is c3)

. 
. * Create layout for combined collection
. collect layout (var pvals) (ever_mal#result[count column1 column4] result[p])
(dimension pvals not found)

Collection: c3
      Rows: var pvals
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 4 x 6

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
. collect layout (var) (ever_mal#result[count column1 column4])

Collection: c3
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 4 x 6

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. collect layout (cmdset) (result[p])

Collection: c3
      Rows: cmdset
   Columns: result[p]
   Table 1: 4 x 1

Table . Pancreatic Enzyme Assays
----------
1  p=0.005
2  p=0.001
3  p=0.576
4  p=0.286
----------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
. collect layout (var cmdset) (ever_mal#result[count column1 column4] result[p])

Collection: c3
      Rows: var cmdset
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 9 x 7

Table . Pancreatic Enzyme Assays
-------------------------------------------------------------------------------------
                                 NPM                          PM                     
-------------------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)          
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)          
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)          
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)          
                                                                                     
1                                                                             p=0.005
2                                                                             p=0.001
3                                                                             p=0.576
4                                                                             p=0.286
-------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. kwallis fecal_elastase, by(ever_mal)

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var cmdset) (ever_mal#result[count column1 column4] result[p])

Collection: c3
      Rows: var cmdset
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 9 x 7

Table . Pancreatic Enzyme Assays
-------------------------------------------------------------------------------------
                                 NPM                          PM                     
-------------------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)          
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)          
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)          
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)          
                                                                                     
1                                                                             p=0.005
2                                                                             p=0.001
3                                                                             p=0.576
4                                                                             p=0.286
-------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var pvals) (ever_mal#result[count column1 column4] result[p])

Collection: c3
      Rows: var pvals
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 4 x 6

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect remap cmdset = var
dimension var already exists in tag matched with cmdset[1]
r(198);

end of do-file

r(198);

. help remap

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. collect clear

. 
. local col "ever_mal"

. local contmed "fecal_elastase ul_amylp lipase  ngml_trypsinogen"  /*continous variables; median (p25-p75)  will be reported*/

. 
. local colhead2 `"0 "NPM" 1 "PM""'

.                 
. * format median of `contmed'
. local nfrmt_p50 "%5.0f"

. local nfrmt_iqr "%5.0f"

. local sfrmt_p25 "(%s-"

. local sfrmt_p75 "%s)"

. 
. local title "Table . Pancreatic Enzyme Assays"

. 
. local notes1 "Values are [N] median (p25-p50)."

. local notes2 "Faecal elastase values are upper limit of detection is 600."

. local notes3 "Lipase from DIVIDS cohort only."

. local notes4 "Trypsinogen from CT Scan subset only."

. 
. * STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  STOP !  
. * THERE IS NOTHING TO MODIFY BEYOND THIS LINE UNLESS CHANGING CODE. 
. 
. * GENERATE TABLE STATS 
. 
.         table (var)(`col')  , ///
>                 stat(frequency) ///
>                 stat(count `contmed') ///
>                 stat(p50 `contmed') ///
>                 stat(p25 `contmed') ///
>                 stat(p75 `contmed') ///
>                 nototal

----------------------------------------------------------------
                              |   Ever experience malnutrition? 
                              |             NPM               PM
------------------------------+---------------------------------
Frequency                     |           1,095            1,029
Fecal Elastase                |                                 
  Number of nonmissing values |           1,003              799
  50th percentile             |         313.704          374.824
  25th percentile             |         132.437         146.2165
  75th percentile             |        587.6312              600
Amylase (U/L)                 |                                 
  Number of nonmissing values |           1,008              757
  50th percentile             |            29.6             31.1
  25th percentile             |           23.45             24.4
  75th percentile             |              38               42
Lipase                        |                                 
  Number of nonmissing values |              54              253
  50th percentile             |            30.5               30
  25th percentile             |              26               26
  75th percentile             |              36               35
Trypsinogen (ng/ml)           |                                 
  Number of nonmissing values |             135              142
  50th percentile             |            24.2            25.75
  25th percentile             |            17.2             17.6
  75th percentile             |            32.5             36.1
----------------------------------------------------------------

.                 
. collect rename Table c1
(current collection is c1)

.                 
. *REFORMAT RESULTS TO DESIRED COLUMNS
.                 
.         * recodes median and iqr
.                 collect recode result p50 = column1
(8 items recoded in collection c1)

.                 collect recode result p25 = column2
(8 items recoded in collection c1)

.                 collect recode result p75 = column3
(8 items recoded in collection c1)

.                 
.         * Create composite result : this is needed because 75 is in column3 and we want it in the same column as column 2 .  Use for medians and probably CIs
.                 collect composite define column4 = column2 column3, replace

. 
.         * Calculate p-values from chi2 and df
.         foreach v in `contmed' {
  2.                 quietly kwallis `v', by(`col')
  3.                 collect: mystats
  4.         }

. 
.         
. 
. * CREATE THE TABLE 1 Layout Super column - column 
. 
.         collect layout (var) (ever_mal#result[count column1 column4])

Collection: c1
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 4 x 6

---------------------------------------------------------------------------------------------------------------------------------------------
                    |                                               Ever experience malnutrition?                                            
                    |                             NPM                                                          PM                            
                    |  Number of nonmissing values   column1     column2 column3   Number of nonmissing values   column1      column2 column3
--------------------+------------------------------------------------------------------------------------------------------------------------
Fecal Elastase      |                        1,003   313.704   132.437  587.6312                           799   374.824   146.2165       600
Amylase (U/L)       |                        1,008      29.6     23.45        38                           757      31.1       24.4        42
Lipase              |                           54      30.5        26        36                           253        30         26        35
Trypsinogen (ng/ml) |                          135      24.2      17.2      32.5                           142     25.75       17.6      36.1
---------------------------------------------------------------------------------------------------------------------------------------------

. 
. * Format p-values
.         collect style cell result[p], nformat("%5.3f")

.         collect style cell result[p], sformat("p=%s")

. 
. * CHANGE HEADER TEXT
.         * column
.                 collect label levels `col' `colhead2', modify

. 
. collect preview /* preview changes */

---------------------------------------------------------------------------------------------------------------------------------------------
                    |                                               Ever experience malnutrition?                                            
                    |                             NPM                                                          PM                            
                    |  Number of nonmissing values   column1     column2 column3   Number of nonmissing values   column1      column2 column3
--------------------+------------------------------------------------------------------------------------------------------------------------
Fecal Elastase      |                        1,003   313.704   132.437  587.6312                           799   374.824   146.2165       600
Amylase (U/L)       |                        1,008      29.6     23.45        38                           757      31.1       24.4        42
Lipase              |                           54      30.5        26        36                           253        30         26        35
Trypsinogen (ng/ml) |                          135      24.2      17.2      32.5                           142     25.75       17.6      36.1
---------------------------------------------------------------------------------------------------------------------------------------------

. 
. * HIDE COLUMN HEADERS
. 
.         * Hide supercolumn variable name because it is self-descriptive
.                 
.         *       collect style header `scol', title(hide) /* this removes the column variable name or label by hiding it */
. 
.         * Hide the column variable name 
.                 
.                 collect style header `col', title(hide) /* this removes the column variable name or label by hiding it */

. 
.         * Hide the words column 1 and column 2 for the results 
. 
.                 collect style header result, level(hide) /* this removes column 1 and column2 header names*/

. 
. collect preview /* preview changes */

-----------------------------------------------------------------------------------------------
                    |                  NPM                                   PM                
--------------------+--------------------------------------------------------------------------
Fecal Elastase      |  1,003   313.704   132.437  587.6312   799   374.824   146.2165       600
Amylase (U/L)       |  1,008      29.6     23.45        38   757      31.1       24.4        42
Lipase              |     54      30.5        26        36   253        30         26        35
Trypsinogen (ng/ml) |    135      24.2      17.2      32.5   142     25.75       17.6      36.1
-----------------------------------------------------------------------------------------------

. 
. * MODIFY ROW TEXT
. 
. 
. * REVISE ROW STYLES
. 
. * Stack levels of each variable , place a space between variables (spacer) ; 
. 
.         collect style row stack, nobinder spacer

. 
. * Remove vertical line after variables
. 
.         collect style cell border_block, border(right, pattern(nil))

. 
. * HIDE ROW Text
. 
. * Hide the variable names 
. collect style header `hiderows', title(hide)

. 
. 
. * FORMAT NUMBERS
. 
. * Format median
. 
.         collect style cell result[column1]#var[`contmed'], nformat(`nfrmt_p50')

. 
. * Add IQR formatting to p25 and p75 separately:
.         collect style cell result[column2]#var[`contmed'], nformat(`nfrmt_iqr') sformat("`sfrmt_p25'") /* formats iqr as (p25 - p75)*/

.         collect style cell result[column3]#var[`contmed'], nformat(`nfrmt_iqr') sformat("`sfrmt_p75'") 

. 
. * Format count column
.         collect style cell result[count], nformat("%4.0f") /* Format count as whole number */

.         collect style cell result[count], sformat("[%s]") /* Format count as whole number */

.         
. /* format factor variables (categorical) column 1 and column 2
> 
>         collect style cell var[`frmt_catvar1']#result[column1], nformat(`nfrmt_freq')
> 
>         collect style cell var[`frmt_catvar1']#result[column2], nformat(`nfrmt_perc') sformat("(`sfrmt_perc')") /* Adds (%) to percent */
> 
> * format means variable column 1 and column 2
> 
>         collect style cell var[`contn']#result[column1], nformat(`nfrmt_mean') /* Formats continuous variable to one decimal*/
> 
>         collect style cell var[`contn']#result[column2], nformat(`nfrmt_sd') sformat(`sfrmt_sd') /* Formats continuous variable to one decimal*/
> */
. * Change font of results
.         *collect style cell var[`contn']#result[column1], nformat(`nfrmt_mean') /* Formats continuous variable to one decimal*/
.         
. * Add text
.         collect title `title'

.         collect notes `notes1'

.         collect notes `notes2'

.         collect notes `notes3'

.         collect notes `notes4'

.         
. collect preview

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
. * Save first collection with main stats
. collect layout (var) (ever_mal#result[count column1 column4])

Collection: c1
      Rows: var
   Columns: ever_mal#result[count column1 column4]
   Table 1: 4 x 6

Table . Pancreatic Enzyme Assays
---------------------------------------------------------------------------
                                 NPM                          PM           
---------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)
---------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. collect save ./tables/enzymes1.json, replace
(collection c1 saved to file ./tables/enzymes1.json)

. 
. * Create new collection for p-values
. collect create c2
(current collection is c2)

. foreach v in `contmed' {
  2.     quietly kwallis `v', by(`col')
  3.     collect: mystats
  4. }

. 
. * Remap cmdset to match var levels
. collect recode cmdset 1 = fecal_elastase
(5 items recoded in collection c2)

. collect recode cmdset 2 = ul_amylp
(5 items recoded in collection c2)

. collect recode cmdset 3 = lipase
(5 items recoded in collection c2)

. collect recode cmdset 4 = ngml_trypsinogen
(5 items recoded in collection c2)

. collect remap cmdset = var
(20 items remapped in collection c2)

. 
. * Combine collections
. collect combine c3 = c1 c2
(current collection is c3)

. 
end of do-file

. collect dir

Collections in memory
Current: c3
----------------
Name   No. items
----------------
  c1   54       
  c2   20       
  c3   74       
----------------

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect layout (var) (ever_mal#result[count column1 column4] result[p])

Collection: c3
      Rows: var
   Columns: ever_mal#result[count column1 column4] result[p]
   Table 1: 4 x 7

Table . Pancreatic Enzyme Assays
-------------------------------------------------------------------------------------
                                 NPM                          PM                     
-------------------------------------------------------------------------------------
Fecal Elastase       [1003]   314   (132-  588)   [799]   375   (146-  600)   p=0.005
Amylase (U/L)        [1008]    30    (23-   38)   [757]    31    (24-   42)   p=0.001
Lipase                 [54]    30    (26-   36)   [253]    30    (26-   35)   p=0.576
Trypsinogen (ng/ml)   [135]    24    (17-   32)   [142]    26    (18-   36)   p=0.286
-------------------------------------------------------------------------------------
Values are [N] median (p25-p50).
Faecal elastase values are upper limit of detection is 600.
Lipase from DIVIDS cohort only.
Trypsinogen from CT Scan subset only.

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect export ./tables/enzymes.html, as(html) replace
(collection c3 exported to file ./tables/enzymes.html)

. collect export ./tables/enzymes.docx, as(docx) replace
(collection c3 exported to file ./tables/enzymes.docx)

. 
end of do-file

. collect dims

Collection dimensions
Collection: c3
-----------------------------------------
                   Dimension   No. levels
-----------------------------------------
Layout, style, header, label
                      cmdset   8         
                  collection   2         
                     colname   4         
                     command   1         
                    ever_mal   2         
               program_class   2         
                      result   14        
                 result_type   1         
                     statcmd   5         
                         var   9         

Style only
                border_block   4         
                   cell_type   4         
-----------------------------------------

. collect levelsof var

Collection: c3
 Dimension: var
    Levels: 1 2 _hide 3 fecal_elastase 4 ul_amylp lipase ngml_trypsinogen

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect export ./tables/enzymes.html, as(html) replace
(collection c3 exported to file ./tables/enzymes.html)

. collect export ./tables/enzymes.docx, as(docx) replace
(collection c3 exported to file ./tables/enzymes.docx)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collet save ./tables/enzymes
command collet is unrecognized
r(199);

end of do-file

r(199);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. collect save ./tables/enzymes, replace
(collection c3 saved to file ./tables/enzymes.stjson)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. set scheme stsj

. 
. 
. *--- v4 works. LIPASE 
. 
. tempfile graphlist

. local graphlist "" // Clear the graphlist

. local i = 1

. forvalues c = 0/5 {
  2.     local grtitle : label cohort `i'
  3.     gr box lipase if cohort == `i', over(ever_mal) title("`grtitle'")
  4. 
.     tempfile temp_graph_`i'
  5.     gr save "`temp_graph_`i''.gph", replace
  6. 
.     display "`temp_graph_`i''.gph"
  7. 
.     local graphlist "`graphlist' `temp_graph_`i''.gph"
  8. 
.     local i = `i' + 1
  9. }
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000002.gph not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000002.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000002.gph
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000003.gph not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000003.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000003.gph
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000004.gph not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000004.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000004.gph
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000005.gph not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000005.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000005.gph
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000006.gph not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000006.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000006.gph
(file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000007.gph not found)
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000007.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000007.gph

. 
. display "`graphlist'"
 /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000002.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000003.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51
> 173.000004.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000005.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000006.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr
> 7h0000gq/T//S_51173.000007.gph

. 
. gr combine `graphlist', rows(2) cols(3)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. tempfile graphlist

. local graphlist ""

. local i = 1

. 
. local cohort_order "2 4 3 1 6 5" // Define the desired order

. 
. foreach c of local cohort_order {
  2.     local grtitle : label cohort `c'
  3.     
.         gr box fecal_elastase if cohort == `c', over(ever_mal) title("`grtitle'") ///
>         ytitle("Lipase (units)") ///
>         ylabel(0(1)5, angle(0) format(%2.0f)) ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
> 
  4.     tempfile temp_graph_`i'
  5.     gr save "`temp_graph_`i''.gph", replace
  6. 
.     display "`temp_graph_`i''.gph"
  7. 
.     local graphlist "`graphlist' `temp_graph_`i''.gph"
  8. 
.     local i = `i' + 1
  9. }
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000002.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000002.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000003.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000003.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000004.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000004.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000005.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000005.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000006.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000006.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000007.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000007.gph

. 
. display "`graphlist'"
 /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000002.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000003.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51
> 173.000004.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000005.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000006.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr
> 7h0000gq/T//S_51173.000007.gph

. 
. gr combine `graphlist', rows(2) cols(3)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. tempfile graphlist

. local graphlist "" // Clear the graphlist

. local i = 1

. forvalues c = 0/5 {
  2.     local grtitle : label cohort `i'
  3.     gr box lipase if cohort == `i', over(ever_mal) title("`grtitle'")
  4.         ylabel(0(1)5, angle(0) format(%2.0f)) ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
> 
  5.     tempfile temp_graph_`i'
  6.     gr save "`temp_graph_`i''.gph", replace
  7. 
.     display "`temp_graph_`i''.gph"
  8. 
.     local graphlist "`graphlist' `temp_graph_`i''.gph"
  9. 
.     local i = `i' + 1
 10. }
command ylabel is unrecognized
r(199);

end of do-file

r(199);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. set scheme stsj

. 
. 
. *--- v4 works. LIPASE 
. 
. tempfile graphlist

. local graphlist "" // Clear the graphlist

. local i = 1

. forvalues c = 0/5 {
  2.     local grtitle : label cohort `i'
  3.     gr box lipase if cohort == `i', over(ever_mal) title("`grtitle'") ///
>         ylabel(0(1)5, angle(0) format(%2.0f)) ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
> 
  4.     tempfile temp_graph_`i'
  5.     gr save "`temp_graph_`i''.gph", replace
  6. 
.     display "`temp_graph_`i''.gph"
  7. 
.     local graphlist "`graphlist' `temp_graph_`i''.gph"
  8. 
.     local i = `i' + 1
  9. }
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000002.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000002.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000003.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000003.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000004.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000004.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000005.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000005.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000006.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000006.gph
file /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000007.gph saved
/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000007.gph

. 
. display "`graphlist'"
 /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000002.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000003.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51
> 173.000004.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000005.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//S_51173.000006.gph /var/folders/lh/z7glx7t90sxdbn12r3xcjr
> 7h0000gq/T//S_51173.000007.gph

. 
. gr combine `graphlist', rows(2) cols(3)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local grtitle : label cohort `i'
invalid syntax
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local grtitle : label cohort `i'
invalid syntax
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local grtitle : label cohort 1

. gr box lipase if, over(ever_mal) title("`grtitle'") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) 
invalid syntax
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. gr box lipase if, over(ever_mal) title("Lipase Levels DIVIDS") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) 
invalid syntax
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. gr box lipase, over(ever_mal) title("Lipase Levels DIVIDS") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

.                 
. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
end of do-file

. rest list
command rest is unrecognized
r(199);

. ret list

scalars:
               r(Chi2) =  .3124497652183891
                  r(p) =  .5761807878073121
                 r(DF) =  1
           r(Chi2_adj) =  .3134619085312719
              r(p_adj) =  .5755635489939235

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. set scheme stsj

. 
. 
. *--- v4 works. LIPASE 
. 
.                 
. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box lipase, over(ever_mal) title("Lipase Levels DIVIDS") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(2.5 0.5 "ρ = `chi2'" "p = `p'", size(vsmall) just(left)) ///
> 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box lipase, over(ever_mal) title("Lipase Levels DIVIDS") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(10) 0.5 "ρ = `chi2'" "p = `p'", size(vsmall) just(left)) ///

end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

.                 
. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box lipase, over(ever_mal) title("Lipase Levels DIVIDS") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(10) 0.5 "ρ = `chi2'" "p = `p'", size(vsmall) just(left)) 
invalid 'size' 
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box lipase, over(ever_mal) title("Lipase Levels DIVIDS") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(10 0.5 "ρ = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

.                 
. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box lipase, over(ever_mal) title("Lipase Levels DIVIDS") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(60 1 "ρ = `chi2'" "p = `p'", size(small) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

.                 
. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box lipase, over(ever_mal) title("Lipase Levels DIVIDS") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(60 3 "ρ = `chi2'" "p = `p'", size(small) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

.                 
. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box lipase, over(ever_mal) title("Lipase Levels DIVIDS") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(60 5 "ρ = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

.                 
. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box lipase, over(ever_mal) title("Lipase Levels DIVIDS") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(60 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

.  
. kwallis ngml_trypsinogen, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 135 | 18054.00 |
  |       PM | 142 | 20449.00 |
  +---------------------------+

  chi2(1) =  1.138
     Prob = 0.2860

  chi2(1) with ties =  1.138
               Prob = 0.2860

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box ngml, over(ever_mal) title("Trypsinogen") subtitle("CT Scan subset") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(60 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. kwallis ngml_trypsinogen, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 135 | 18054.00 |
  |       PM | 142 | 20449.00 |
  +---------------------------+

  chi2(1) =  1.138
     Prob = 0.2860

  chi2(1) with ties =  1.138
               Prob = 0.2860

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box ngml, over(ever_mal) title("Trypsinogen") subtitle("CT Scan subset") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(250 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. kwallis fecal_elastase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box fecal_elastase, over(ever_mal) title("Faecal Elastase") subtitle("All cohort") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(250 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. kwallis fecal_elastase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box fecal_elastase, over(ever_mal) title("Faecal Elastase") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(700 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. kwallis fecal_elastase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box fecal_elastase, over(ever_mal) title("Faecal Elastase") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(620 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. kwallis ul_amylp, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,008 | 853284.50 |
  |       PM |   757 | 705210.50 |
  +------------------------------+

  chi2(1) = 12.046
     Prob = 0.0005

  chi2(1) with ties = 12.046
               Prob = 0.0005

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box ul_amylp, over(ever_mal) title("Amylase") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(620 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. kwallis ul_amylp, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,008 | 853284.50 |
  |       PM |   757 | 705210.50 |
  +------------------------------+

  chi2(1) = 12.046
     Prob = 0.0005

  chi2(1) with ties = 12.046
               Prob = 0.0005

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. gr box ul_amylp, over(ever_mal) title("Amylase") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(150 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. spearman ct_pan_vol fecal_elastase

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: ct_pan_vol and fecal_elastase are independent
                  Prob =  0.8291

. spearman fecal_elastase ct_pan_vol 

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. local enzymes "fecal_elastase ul_amylp lipase  ngml_trypsinogen"  /*continous variables; median (p25-p75)  will be reported*/           forea
invalid syntax
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local enzymes "fecal_elastase ul_amylp lipase  ngml_trypsinogen"  

. foreach var of varlist `enzymes' 
{ required
r(100);

end of do-file

r(100);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local enzymes "fecal_elastase ul_amylp lipase  ngml_trypsinogen"  

. foreach var of varlist `enzymes' {}
program error:  code follows on the same line as open brace
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local enzymes "fecal_elastase ul_amylp lipase  ngml_trypsinogen"  

. foreach var of varlist `enzymes' {
  2.         spearman `var' ct_pan_vol
  3. }

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

Number of observations =    206
        Spearman's rho = 0.1811

Test of H0: ul_amylp and ct_pan_vol are independent
                  Prob = 0.0093
no observations
r(2000);

end of do-file

r(2000);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local enzymes "fecal_elastase ul_amylp lipase  ngml_trypsinogen"  

. foreach var of varlist `enzymes' {
  2.         capture spearman `var' ct_pan_vol
  3. }

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

.                 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. foreach var of varlist `enzymes' {
  2.          spearman `var' ct_pan_vol
  3. }

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

Number of observations =    206
        Spearman's rho = 0.1811

Test of H0: ul_amylp and ct_pan_vol are independent
                  Prob = 0.0093

Number of observations =    199
        Spearman's rho = 0.0786

Test of H0: ngml_trypsinogen and ct_pan_vol are independent
                  Prob = 0.2693

. 
. spearman pan_head_ap lipase

Number of observations =    305
        Spearman's rho = 0.0962

Test of H0: pan_head_ap and lipase are independent
                  Prob = 0.0934

. 
end of do-file

. scatter ct_pan_vol ul_amylp

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          spearman `var' ct_pan_vol title(`grtitle')
  4. }
factor-variable and time-series operators not allowed
r(101);

end of do-file

r(101);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          spearman `var' ct_pan_vol, title(`grtitle')
  4. }
option title() not allowed
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          spearman `var' ct_pan_vol, title("`grtitle'")
  4. }
option title() not allowed
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          spearman `var' ct_pan_vol, title("`grtitle'")
  4. }
option title() not allowed
r(198);

end of do-file

r(198);

. d fecal_elastase

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
fecal_elastase  float   %9.0g                 Fecal Elastase

. d amylase
variable amylase not found
r(111);

. d ul

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
ul_amylp        double  %10.0g                Amylase (U/L)

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

.                 
. *--- v4 works. Fecal Elastase
. 
. kwallis fecal_elastase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label fecal_elastase

. 
. gr box fecal_elastase, over(ever_mal) title("`grtitle'") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(620 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
.                 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          spearman `var' ct_pan_vol, title("`grtitle'")
  4. }
option title() not allowed
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

.                 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          spearman `var' ct_pan_vol, title("`grtitle' vs `volabel'")
  5. }
option title() not allowed
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. spearman fecal_elastase ct_pan_vol, title("Fecal Elastase")
option title() not allowed
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          scatter `var' ct_pan_vol, title("`grtitle' vs `volabel'")
  5. }

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          scatter `var' ct_pan_vol, title("`grtitle' vs `volabel'")
  5. }

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. scatter fecal_elastase ct_pan_vol

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. scatter ul_amylp ct_pan_vol

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. scatter ngml_trypsinogen  ct_pan_vol

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. scatter ngml_trypsinogen  ct_pan_vol, mlabel(ever_mal)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. scatter ngml_trypsinogen ct_pan_vol if ever_mal==0 || scatter ngml_trypsinogen ct_pan_vol if evermal==1 
evermal not found
r(111);

end of do-file

r(111);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. scatter ngml_trypsinogen ct_pan_vol if ever_mal==0 || scatter ngml_trypsinogen ct_pan_vol if ever_mal==1 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. scatter ul_amylp ct_pan_vol if ever_mal==0 || scatter ul_amylp ct_pan_vol if ever_mal==1 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. scatter fecal_elastase ct_pan_vol if ever_mal==0 || scatter fecal_elastase ct_pan_vol if ever_mal==1 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. set scheme tab2

. 
. scatter fecal_elastase ct_pan_vol if ever_mal==0 || scatter fecal_elastase ct_pan_vol if ever_mal==1 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. set scheme tab2

. 
. scatter fecal_elastase ct_pan_vol if ever_mal==0, msymbol(circle) || ///
> scatter fecal_elastase ct_pan_vol if ever_mal==1, msymbol(diamond) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'"))

. 
end of do-file

. help schemepack

. set scheme tab2

. set scheme tab2

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. scatter fecal_elastase ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(navy) || ///
> scatter fecal_elastase ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(maroon) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'"))

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. set scheme tab2

. 
. scatter fecal_elastase ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter fecal_elastase ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'"))

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. spearman fecal_elastase ct_pan_vol

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. scatter fecal_elastase ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter fecal_elastase ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>        text(2.5 0.5 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. scatter ul_amylp ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter ul_amylp ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'"))

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. spearman fecal_elastase ct_pan_vol

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. scatter fecal_elastase ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter fecal_elastase ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>        text(2.5 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. scatter ul_amylp ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter ul_amylp ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>        text(2 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. spearman fecal_elastase ct_pan_vol

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. scatter fecal_elastase ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter fecal_elastase ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>        text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. scatter ul_amylp ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter ul_amylp ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>        text(2 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. scatter ngml_trypsinogen ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter ngml_trypsinogen ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'"))

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local liplabel : variable label lipase

. local headlabel : variable label pan_head_ap

. scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red) ///
> title("`liplabel' vs `headlabel'") ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'"))

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. spearman lipase pan_head_ap

Number of observations =    305
        Spearman's rho = 0.0962

Test of H0: lipase and pan_head_ap are independent
                  Prob = 0.0934

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. local liplabel : variable label lipase

. local headlabel : variable label pan_head_ap

. scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red) ///
> title("`liplabel' vs `headlabel'") ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'"))

.        text(60 4 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) 
command text is unrecognized
r(199);

end of do-file

r(199);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. spearman lipase pan_head_ap

Number of observations =    305
        Spearman's rho = 0.0962

Test of H0: lipase and pan_head_ap are independent
                  Prob = 0.0934

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. local liplabel : variable label lipase

. local headlabel : variable label pan_head_ap

. scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red) ///
> title("`liplabel' vs `headlabel'") ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>        text(60 4 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. spearman fecal_elastase ct_pan_vol

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. scatter fecal_elastase ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter fecal_elastase ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>        text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) 

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. spearman ngml_trypsinogen ct_pan_vol

Number of observations =    199
        Spearman's rho = 0.0786

Test of H0: ngml_trypsinogen and ct_pan_vol are independent
                  Prob = 0.2693

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. scatter ngml_trypsinogen ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter ngml_trypsinogen ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
> text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
> ytitle("Trypsinogen ng?ml")

. 
end of do-file

. help gr twoway

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. spearman fecal_elastase ct_pan_vol

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. scatter fecal_elastase ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter fecal_elastase ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>        text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
>            ytitle("Fecal Elastase ng/ml") ///
>            name(g_`1', replace)

. 
. * Amylase scatter
.            
. spearman ul_amylp ct_pan_vol

Number of observations =    206
        Spearman's rho = 0.1811

Test of H0: ul_amylp and ct_pan_vol are independent
                  Prob = 0.0093

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. scatter ul_amylp ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter ul_amylp ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>        text(150 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
>                    ytitle("Amylase U/L") ///
>                            name(g_`2', replace)

.                            
. gr combine g_`1' g_`2'

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. tempfile 1 2 3 4

. 
. spearman fecal_elastase ct_pan_vol

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. scatter fecal_elastase ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter fecal_elastase ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>        text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
>            ytitle("Fecal Elastase ng/ml") ///
>            name(g_`1', replace)
/ invalid name
/ invalid name
/ invalid name
/ invalid name
/ invalid name
/ invalid name
/ invalid name
S_51173.000001 invalid name
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. tempfile g1 g2 g3 g4

. 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. local i = 1

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          
.          spearman `var' ct_pan_vol
  5.          local rho = string(r(rho), "%4.2f")
  6.          local p = string(r(p), "%4.3f")
  7.          
.          scatter `var' ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
>          scatter `var' ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
>          title("`grtitle' vs `volabel'") ///
>          legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>          text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
>          name(g_`i', replace)
  8.          
.          local ++i
  9. }

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

Number of observations =    206
        Spearman's rho = 0.1811

Test of H0: ul_amylp and ct_pan_vol are independent
                  Prob = 0.0093

Number of observations =    199
        Spearman's rho = 0.0786

Test of H0: ngml_trypsinogen and ct_pan_vol are independent
                  Prob = 0.2693

. 
. * Lipase separately since it uses different x variable
. spearman lipase pan_head_ap

Number of observations =    305
        Spearman's rho = 0.0962

Test of H0: lipase and pan_head_ap are independent
                  Prob = 0.0934

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. local liplabel : variable label lipase

. local headlabel : variable label pan_head_ap

. scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red) ///
> title("`liplabel' vs `headlabel'") ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
> text(60 4 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
> name(g_4, replace)

. 
. gr combine g_1 g_2 g_3 g_4, rows(2) cols(2)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. tempfile g1 g2 g3 g4

. 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. local i = 1

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          
.          spearman `var' ct_pan_vol
  5.          local rho = string(r(rho), "%4.2f")
  6.          local p = string(r(p), "%4.3f")
  7.          
.          scatter `var' ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
>          scatter `var' ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
>          title("`grtitle'") ///
>          legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>          text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
>          xtitle("Pancreatic volume, ml") ///
>          name(g_`i', replace)
  8.          
.          local ++i
  9. }

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

Number of observations =    206
        Spearman's rho = 0.1811

Test of H0: ul_amylp and ct_pan_vol are independent
                  Prob = 0.0093

Number of observations =    199
        Spearman's rho = 0.0786

Test of H0: ngml_trypsinogen and ct_pan_vol are independent
                  Prob = 0.2693

. 
. * Lipase separately since it uses different x variable
. spearman lipase pan_head_ap

Number of observations =    305
        Spearman's rho = 0.0962

Test of H0: lipase and pan_head_ap are independent
                  Prob = 0.0934

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. local liplabel : variable label lipase

. local headlabel : variable label pan_head_ap

. scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red) ///
> title("`liplabel' vs `headlabel'") ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
> text(60 4 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
> xtitle("Pancreatic Head AP length, cm") ///
> name(g_4, replace)

. 
. gr combine g_1 g_2 g_3 g_4, rows(2) cols(2)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. tempfile g1 g2 g3 g4

. 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. local i = 1

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          
.          spearman `var' ct_pan_vol
  5.          local rho = string(r(rho), "%4.2f")
  6.          local p = string(r(p), "%4.3f")
  7.          
.          scatter `var' ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue) || ///
>          scatter `var' ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red) ///
>          title("`grtitle'") ///
>          legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>          text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
>          xtitle("Pancreatic volume, ml") ///
>          name(g_`i', replace)
  8.          
.          local ++i
  9. }

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

Number of observations =    206
        Spearman's rho = 0.1811

Test of H0: ul_amylp and ct_pan_vol are independent
                  Prob = 0.0093

Number of observations =    199
        Spearman's rho = 0.0786

Test of H0: ngml_trypsinogen and ct_pan_vol are independent
                  Prob = 0.2693

. 
. * Lipase separately since it uses different x variable
. spearman lipase pan_head_ap

Number of observations =    305
        Spearman's rho = 0.0962

Test of H0: lipase and pan_head_ap are independent
                  Prob = 0.0934

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. local liplabel : variable label lipase

. local headlabel : variable label pan_head_ap

. scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue) || ///
> scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red) ///
> title("`liplabel'") ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
> text(60 4 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
> xtitle("Pancreatic Head AP length, cm") ///
> name(g_4, replace)

. 
. gr combine g_1 g_2 g_3 g_4, rows(2) cols(2)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. set scheme stsj

. 
.                 
. *--- v4 works. Fecal Elastase
. 
. kwallis fecal_elastase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label fecal_elastase

. 
. gr box fecal_elastase, over(ever_mal) title("`grtitle'") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(620 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

.                 
.                 
. *--- v4 works. Amylase
. 
. kwallis ul_amylp, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,008 | 853284.50 |
  |       PM |   757 | 705210.50 |
  +------------------------------+

  chi2(1) = 12.046
     Prob = 0.0005

  chi2(1) with ties = 12.046
               Prob = 0.0005

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label ul_amylp

. 
. gr box ul_amylp, over(ever_mal) title("`grtitle'") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(150 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
. *--- v4 works. LIPASE 
. 
. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label lipase

. 
. gr box lipase, over(ever_mal) title("`grtitle'") subtitle("DIVIDS only") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(60 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

.                 
. 
. *--- v4 works. Trypsinogen
.  
. kwallis ngml_trypsinogen, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 135 | 18054.00 |
  |       PM | 142 | 20449.00 |
  +---------------------------+

  chi2(1) =  1.138
     Prob = 0.2860

  chi2(1) with ties =  1.138
               Prob = 0.2860

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label ngml_trypsinogen

. 
. gr box ngml_trypsinogen, over(ever_mal) title("`grtitle'") subtitle("CT Scan subset") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(250 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
. 
.                 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          local mallabel : value label ever_mal
  5.          scatter `var' ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue%50) || ///
>          scatter `var' ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red%50) ///
>          title("`grtitle' vs `volabel'") ///
>          legend(order(1 "`:label (`mallabel') 0'" 2 "`:label (`mallabel') 1'"))
  6. }

. 
. set scheme tab2

. 
. * FE-1 scatter
. 
. tempfile g1 g2 g3 g4

. 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. local i = 1

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          
.          spearman `var' ct_pan_vol
  5.          local rho = string(r(rho), "%4.2f")
  6.          local p = string(r(p), "%4.3f")
  7.          
.          scatter `var' ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue%50) || ///
>          scatter `var' ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red%50) ///
>          title("`grtitle'") ///
>          legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>          text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
>          xtitle("Pancreatic volume, ml") ///
>          name(g_`i', replace)
  8.          
.          local ++i
  9. }

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

Number of observations =    206
        Spearman's rho = 0.1811

Test of H0: ul_amylp and ct_pan_vol are independent
                  Prob = 0.0093

Number of observations =    199
        Spearman's rho = 0.0786

Test of H0: ngml_trypsinogen and ct_pan_vol are independent
                  Prob = 0.2693

. 
. * Lipase separately since it uses different x variable
. spearman lipase pan_head_ap

Number of observations =    305
        Spearman's rho = 0.0962

Test of H0: lipase and pan_head_ap are independent
                  Prob = 0.0934

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. local liplabel : variable label lipase

. local headlabel : variable label pan_head_ap

. scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue%50) || ///
> scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red%50) ///
> title("`liplabel'") ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
> text(60 4 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
> xtitle("Pancreatic Head AP length, cm") ///
> name(g_4, replace)

. 
. gr combine g_1 g_2 g_3 g_4, rows(2) cols(2)

. 
end of do-file

. pwd
/Users/juansolon/Documents/GitHub/sampa-radio

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. /* figc_all_enzymes.do 
> Sampa
> J Solon
> March 20 2025
> 
> Creates Fig
> local fig3 "./figures/fe1_coh_mn.png"
> local fig3head "Figure 3 Faecal elastase distribution by cohort and malnutrition status."
> 
> local fig3text "a) axial anterior-posterior and transverse head diameters, b) coronal cranio-caudal head diameter, c) coronal cranio-caudal body diameters, d) axial anterior-posterior body an
> d tail diameters, body, and d) length of body and tail."
> 
> schemename Foreground s2color color
> s2mono monochrome s2gcolor color s2manual monochrome s2gmanual monochrome
> For instance, you might type
> Background
> white white white white white
> 
> s1 family s1rcolor
>   s1color
>   s1mono
>   s1manual
> Foreground
> color
> color monochrome monochrome
> Background
> black white white white
> set scheme tab2
> set scheme stmono
> set scheme sj
> set scheme stcolor 
> 
> sj
> */
. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. set scheme stsj

. 
.                 
. *--- v4 works. Fecal Elastase
. 
. kwallis fecal_elastase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label fecal_elastase

. 
. gr box fecal_elastase, over(ever_mal) title("`grtitle'") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(620 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

.                 
.                 
. *--- v4 works. Amylase
. 
. kwallis ul_amylp, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,008 | 853284.50 |
  |       PM |   757 | 705210.50 |
  +------------------------------+

  chi2(1) = 12.046
     Prob = 0.0005

  chi2(1) with ties = 12.046
               Prob = 0.0005

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label ul_amylp

. 
. gr box ul_amylp, over(ever_mal) title("`grtitle'") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(150 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
. *--- v4 works. LIPASE 
. 
. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label lipase

. 
. gr box lipase, over(ever_mal) title("`grtitle'") subtitle("DIVIDS only") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(60 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

.                 
. 
. *--- v4 works. Trypsinogen
.  
. kwallis ngml_trypsinogen, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 135 | 18054.00 |
  |       PM | 142 | 20449.00 |
  +---------------------------+

  chi2(1) =  1.138
     Prob = 0.2860

  chi2(1) with ties =  1.138
               Prob = 0.2860

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label ngml_trypsinogen

. 
. gr box ngml_trypsinogen, over(ever_mal) title("`grtitle'") subtitle("CT Scan subset") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(250 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
. gr export ./figures/figc_all_enzymes_box.png, as(png)
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_all_enzymes_box.png saved as PNG format

. set scheme tab2

. 
. * FE-1 scatter
. 
. tempfile g1 g2 g3 g4

. 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. local i = 1

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          
.          spearman `var' ct_pan_vol
  5.          local rho = string(r(rho), "%4.2f")
  6.          local p = string(r(p), "%4.3f")
  7.          
.          scatter `var' ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue%50) || ///
>          scatter `var' ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red%50) ///
>          title("`grtitle'") ///
>          legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>          text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
>          xtitle("Pancreatic volume, ml") ///
>          name(g_`i', replace)
  8.          
.          local ++i
  9. }

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

Number of observations =    206
        Spearman's rho = 0.1811

Test of H0: ul_amylp and ct_pan_vol are independent
                  Prob = 0.0093

Number of observations =    199
        Spearman's rho = 0.0786

Test of H0: ngml_trypsinogen and ct_pan_vol are independent
                  Prob = 0.2693

. 
. * Lipase separately since it uses different x variable
. spearman lipase pan_head_ap

Number of observations =    305
        Spearman's rho = 0.0962

Test of H0: lipase and pan_head_ap are independent
                  Prob = 0.0934

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. local liplabel : variable label lipase

. local headlabel : variable label pan_head_ap

. scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue%50) || ///
> scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red%50) ///
> title("`liplabel'") ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
> text(60 4 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
> xtitle("Pancreatic Head AP length, cm") ///
> name(g_4, replace)

. 
. gr combine g_1 g_2 g_3 g_4, rows(2) cols(2)

. 
. gr export ./figures/figc_all_enzymes_scatter.png, as(png)
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_all_enzymes_scatter.png saved as PNG format

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. /* figc_all_enzymes.do 
> Sampa
> J Solon
> March 20 2025
> 
> output
> gr export ./figures/figc_a.png, as(png) replace
> gr export ./figures/figc_b.png, as(png) replace
> */
. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. set scheme stsj

. 
.                 
. *--- v4 works. Fecal Elastase
. 
. kwallis fecal_elastase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label fecal_elastase

. 
. gr box fecal_elastase, over(ever_mal) title("`grtitle'") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(620 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

.                 
.                 
. *--- v4 works. Amylase
. 
. kwallis ul_amylp, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,008 | 853284.50 |
  |       PM |   757 | 705210.50 |
  +------------------------------+

  chi2(1) = 12.046
     Prob = 0.0005

  chi2(1) with ties = 12.046
               Prob = 0.0005

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label ul_amylp

. 
. gr box ul_amylp, over(ever_mal) title("`grtitle'") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(150 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
. *--- v4 works. LIPASE 
. 
. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label lipase

. 
. gr box lipase, over(ever_mal) title("`grtitle'") subtitle("DIVIDS only") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(60 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

.                 
. 
. *--- v4 works. Trypsinogen
.  
. kwallis ngml_trypsinogen, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 135 | 18054.00 |
  |       PM | 142 | 20449.00 |
  +---------------------------+

  chi2(1) =  1.138
     Prob = 0.2860

  chi2(1) with ties =  1.138
               Prob = 0.2860

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label ngml_trypsinogen

. 
. gr box ngml_trypsinogen, over(ever_mal) title("`grtitle'") subtitle("CT Scan subset") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(250 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
. gr export ./figures/figc_a.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_a.png saved as PNG format

. set scheme tab2

. 
. * FE-1 scatter
. 
. tempfile g1 g2 g3 g4

. 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. local i = 1

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          
.          spearman `var' ct_pan_vol
  5.          local rho = string(r(rho), "%4.2f")
  6.          local p = string(r(p), "%4.3f")
  7.          
.          scatter `var' ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue%50) || ///
>          scatter `var' ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red%50) ///
>          title("`grtitle'") ///
>          legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>          text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
>          xtitle("Pancreatic volume, ml") ///
>          name(g_`i', replace)
  8.          
.          local ++i
  9. }

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

Number of observations =    206
        Spearman's rho = 0.1811

Test of H0: ul_amylp and ct_pan_vol are independent
                  Prob = 0.0093

Number of observations =    199
        Spearman's rho = 0.0786

Test of H0: ngml_trypsinogen and ct_pan_vol are independent
                  Prob = 0.2693

. 
. * Lipase separately since it uses different x variable
. spearman lipase pan_head_ap

Number of observations =    305
        Spearman's rho = 0.0962

Test of H0: lipase and pan_head_ap are independent
                  Prob = 0.0934

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. local liplabel : variable label lipase

. local headlabel : variable label pan_head_ap

. scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue%50) || ///
> scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red%50) ///
> title("`liplabel'") ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
> text(60 4 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
> xtitle("Pancreatic Head AP length, cm") ///
> name(g_4, replace)

. 
. gr combine g_1 g_2 g_3 g_4, rows(2) cols(2)

. 
. gr export ./figures/figc_b.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_b.png saved as PNG format

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. set scheme tab2

. 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen lipase"

. local i = 1

. foreach var of varlist `enzymes' {
  2.         kwallis `var', by(ever_mal) 
  3.         mystats
  4. 
.         local chi2 = string(r(Chi2), "%4.2f")
  5.         local p = string(r(p), "%4.3f")
  6.         local grtitle : variable label `var'
  7.         
.         if "`var'" == "lipase" {
  8.                 local subtitle "DIVIDS only"
  9.                 local ymax = 60
 10.         }
 11.         else if "`var'" == "ngml_trypsinogen" {
 12.                 local subtitle "CT Scan subset"
 13.                 local ymax = 250
 14.         }
 15.         else {
 16.                 local subtitle "All cohorts"
 17.                 local ymax = 620
 18.         }
 19.         
.         gr box `var', over(ever_mal) title("`grtitle'") subtitle("`subtitle'") ///
>                 xsize(10) ysize(8) ///
>                 marker(1, msize(vsmall)) ///
>                 medline(lwidth(thin)) ///
>                 text(`ymax' 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) ///
>                 name(box_`i', replace)
 20.                 
.         local ++i
 21. }

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,008 | 853284.50 |
  |       PM |   757 | 705210.50 |
  +------------------------------+

  chi2(1) = 12.046
     Prob = 0.0005

  chi2(1) with ties = 12.046
               Prob = 0.0005

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 135 | 18054.00 |
  |       PM | 142 | 20449.00 |
  +---------------------------+

  chi2(1) =  1.138
     Prob = 0.2860

  chi2(1) with ties =  1.138
               Prob = 0.2860

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. 
. gr combine box_1 box_2 box_3 box_4, rows(2) cols(2)

. gr export ./figures/figc_a.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_a.png saved as PNG format

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. /* figc_all_enzymes.do 
> Sampa
> J Solon
> March 20 2025
> 
> output
> gr export ./figures/figc_a.png, as(png) replace
> gr export ./figures/figc_b.png, as(png) replace
> */
. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. set scheme stsj

. 
.                 
. *--- v4 works. Fecal Elastase
. 
. kwallis fecal_elastase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label fecal_elastase

. 
. gr box fecal_elastase, over(ever_mal) title("`grtitle'") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(620 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

.                 
.                 
. *--- v4 works. Amylase
. 
. kwallis ul_amylp, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,008 | 853284.50 |
  |       PM |   757 | 705210.50 |
  +------------------------------+

  chi2(1) = 12.046
     Prob = 0.0005

  chi2(1) with ties = 12.046
               Prob = 0.0005

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label ul_amylp

. 
. gr box ul_amylp, over(ever_mal) title("`grtitle'") subtitle("All cohorts") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(150 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
. *--- v4 works. LIPASE 
. 
. kwallis lipase, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label lipase

. 
. gr box lipase, over(ever_mal) title("`grtitle'") subtitle("DIVIDS only") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(60 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

.                 
. 
. *--- v4 works. Trypsinogen
.  
. kwallis ngml_trypsinogen, by(ever_mal) 

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 135 | 18054.00 |
  |       PM | 142 | 20449.00 |
  +---------------------------+

  chi2(1) =  1.138
     Prob = 0.2860

  chi2(1) with ties =  1.138
               Prob = 0.2860

. mystats

. 
. local chi2 = string(r(Chi2), "%4.2f")

. local p = string(r(p), "%4.3f")

. local grtitle : variable label ngml_trypsinogen

. 
. gr box ngml_trypsinogen, over(ever_mal) title("`grtitle'") subtitle("CT Scan subset") ///
>         xsize(10) ysize(8) ///
>         marker(1, msize(vsmall)) ///
>         medline(lwidth(thin)) ///
>                 text(250 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) 

. 
. gr export ./figures/figc_a.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_a.png saved as PNG format

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen lipase"

. local i = 1

. foreach var of varlist `enzymes' {
  2.         kwallis `var', by(ever_mal) 
  3.         mystats
  4. 
.         local chi2 = string(r(Chi2), "%4.2f")
  5.         local p = string(r(p), "%4.3f")
  6.         local grtitle : variable label `var'
  7.         
.         if "`var'" == "lipase" {
  8.                 local subtitle "DIVIDS only"
  9.                 local ymax = 60
 10.         }
 11.         else if "`var'" == "ngml_trypsinogen" {
 12.                 local subtitle "CT Scan subset"
 13.                 local ymax = 250
 14.         }
 15.         else if "`var'" == "ul_amylp" {
 16.                 local subtitle "All cohorts"
 17.                 local ymax = 150
 18.         }
 19.         else {
 20.                 local subtitle "All cohorts"
 21.                 local ymax = 620
 22.         }
 23.         
.         gr box `var', over(ever_mal) title("`grtitle'") subtitle("`subtitle'") ///
>                 xsize(10) ysize(8) ///
>                 marker(1, msize(vsmall)) ///
>                 medline(lwidth(thin)) ///
>                 text(`ymax' 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) ///
>                 name(box_`i', replace)
 24.                 
.         local ++i
 25. }

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,008 | 853284.50 |
  |       PM |   757 | 705210.50 |
  +------------------------------+

  chi2(1) = 12.046
     Prob = 0.0005

  chi2(1) with ties = 12.046
               Prob = 0.0005

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 135 | 18054.00 |
  |       PM | 142 | 20449.00 |
  +---------------------------+

  chi2(1) =  1.138
     Prob = 0.2860

  chi2(1) with ties =  1.138
               Prob = 0.2860

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. 
. gr combine box_1 box_2 box_3 box_4, rows(2) cols(2)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. set scheme stsj

. ** Gr box 4 enzymes
. 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen lipase"

. local i = 1

. foreach var of varlist `enzymes' {
  2.         kwallis `var', by(ever_mal) 
  3.         mystats
  4. 
.         local chi2 = string(r(Chi2), "%4.2f")
  5.         local p = string(r(p), "%4.3f")
  6.         local grtitle : variable label `var'
  7.         
.         if "`var'" == "lipase" {
  8.                 local subtitle "DIVIDS only"
  9.                 local ymax = 60
 10.         }
 11.         else if "`var'" == "ngml_trypsinogen" {
 12.                 local subtitle "CT Scan subset"
 13.                 local ymax = 250
 14.         }
 15.         else if "`var'" == "ul_amylp" {
 16.                 local subtitle "All cohorts"
 17.                 local ymax = 150
 18.         }
 19.         else {
 20.                 local subtitle "All cohorts"
 21.                 local ymax = 620
 22.         }
 23.         
.         gr box `var', over(ever_mal) title("`grtitle'") subtitle("`subtitle'") ///
>                 xsize(10) ysize(8) ///
>                 marker(1, msize(vsmall)) ///
>                 medline(lwidth(thin)) ///
>                 text(`ymax' 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) ///
>                 name(box_`i', replace)
 24.                 
.         local ++i
 25. }

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,008 | 853284.50 |
  |       PM |   757 | 705210.50 |
  +------------------------------+

  chi2(1) = 12.046
     Prob = 0.0005

  chi2(1) with ties = 12.046
               Prob = 0.0005

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 135 | 18054.00 |
  |       PM | 142 | 20449.00 |
  +---------------------------+

  chi2(1) =  1.138
     Prob = 0.2860

  chi2(1) with ties =  1.138
               Prob = 0.2860

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. 
. gr combine box_1 box_2 box_3 box_4, rows(2) cols(2)

. gr export ./figures/figc_a.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_a.png saved as PNG format

. 
. gr combine box_1 box_2 , rows(1) cols(1)

. gr export ./figures/figc_a_fe_am.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_a_fe_am.png saved as PNG format

. 
end of do-file

. help gr combine

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen lipase"

. local i = 1

. foreach var of varlist `enzymes' {
  2.         kwallis `var', by(ever_mal) 
  3.         mystats
  4. 
.         local chi2 = string(r(Chi2), "%4.2f")
  5.         local p = string(r(p), "%4.3f")
  6.         local grtitle : variable label `var'
  7.         
.         if "`var'" == "lipase" {
  8.                 local subtitle "DIVIDS only"
  9.                 local ymax = 60
 10.         }
 11.         else if "`var'" == "ngml_trypsinogen" {
 12.                 local subtitle "CT Scan subset"
 13.                 local ymax = 250
 14.         }
 15.         else if "`var'" == "ul_amylp" {
 16.                 local subtitle "All cohorts"
 17.                 local ymax = 150
 18.         }
 19.         else {
 20.                 local subtitle "All cohorts"
 21.                 local ymax = 650
 22.         }
 23.         
.         gr box `var', over(ever_mal) title("`grtitle'") subtitle("`subtitle'") ///
>                 xsize(10) ysize(8) ///
>                 marker(1, msize(vsmall)) ///
>                 medline(lwidth(thin)) ///
>                 text(`ymax' 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) ///
>                 name(box_`i', replace)
 24.                 
.         local ++i
 25. }

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,008 | 853284.50 |
  |       PM |   757 | 705210.50 |
  +------------------------------+

  chi2(1) = 12.046
     Prob = 0.0005

  chi2(1) with ties = 12.046
               Prob = 0.0005

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 135 | 18054.00 |
  |       PM | 142 | 20449.00 |
  +---------------------------+

  chi2(1) =  1.138
     Prob = 0.2860

  chi2(1) with ties =  1.138
               Prob = 0.2860

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. 
. gr combine box_1 box_2 box_3 box_4, rows(2) cols(2)

. gr export ./figures/figc_a.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_a.png saved as PNG format

. 
. gr combine box_1 box_2 , rows(1) 

. gr export ./figures/figc_a_fe_am.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_a_fe_am.png saved as PNG format

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. /* figc_all_enzymes.do 
> Sampa
> J Solon
> March 20 2025
> 
> output
> gr export ./figures/figc_a.png, as(png) replace
> gr export ./figures/figc_b.png, as(png) replace
> */
. 
. cap prog drop mystats

. program mystats, rclass
  1. return scalar p_adj= chi2tail(r(df), r(chi2_adj))
  2. return scalar Chi2_adj =  r(chi2_adj)
  3. return scalar  DF =  r(df)
  4. return scalar p= chi2tail(r(df), r(chi2))
  5. return scalar  Chi2 =   r(chi2)
  6. end

. 
. set scheme stsj

. ** Gr box 4 enzymes
. 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen lipase"

. local i = 1

. foreach var of varlist `enzymes' {
  2.         kwallis `var', by(ever_mal) 
  3.         mystats
  4. 
.         local chi2 = string(r(Chi2), "%4.2f")
  5.         local p = string(r(p), "%4.3f")
  6.         local grtitle : variable label `var'
  7.         
.         if "`var'" == "lipase" {
  8.                 local subtitle "DIVIDS only"
  9.                 local ymax = 60
 10.         }
 11.         else if "`var'" == "ngml_trypsinogen" {
 12.                 local subtitle "CT Scan subset"
 13.                 local ymax = 250
 14.         }
 15.         else if "`var'" == "ul_amylp" {
 16.                 local subtitle "All cohorts"
 17.                 local ymax = 150
 18.         }
 19.         else {
 20.                 local subtitle "All cohorts"
 21.                 local ymax = 650
 22.         }
 23.         
.         gr box `var', over(ever_mal) title("`grtitle'") subtitle("`subtitle'") ///
>                 xsize(10) ysize(8) ///
>                 marker(1, msize(vsmall)) ///
>                 medline(lwidth(thin)) ///
>                 text(`ymax' 5 "Chi2 = `chi2'" "p = `p'", size(vsmall) just(left)) ///
>                 name(box_`i', replace)
 24.                 
.         local ++i
 25. }

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,003 | 873326.50 |
  |       PM |   799 | 751176.50 |
  +------------------------------+

  chi2(1) =  7.918
     Prob = 0.0049

  chi2(1) with ties =  8.052
               Prob = 0.0045

Kruskal–Wallis equality-of-populations rank test

  +------------------------------+
  | ever_mal |   Obs |  Rank sum |
  |----------+-------+-----------|
  |      NPM | 1,008 | 853284.50 |
  |       PM |   757 | 705210.50 |
  +------------------------------+

  chi2(1) = 12.046
     Prob = 0.0005

  chi2(1) with ties = 12.046
               Prob = 0.0005

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 135 | 18054.00 |
  |       PM | 142 | 20449.00 |
  +---------------------------+

  chi2(1) =  1.138
     Prob = 0.2860

  chi2(1) with ties =  1.138
               Prob = 0.2860

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM |  54 |  8647.00 |
  |       PM | 253 | 38631.00 |
  +---------------------------+

  chi2(1) =  0.312
     Prob = 0.5762

  chi2(1) with ties =  0.313
               Prob = 0.5756

. 
. * FE-1 AND amylase only
. gr combine box_1 box_2 , rows(1) 

. gr export ./figures/figc_a_1.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_a_1.png saved as PNG format

. 
. * all four enzymes 
. gr combine box_1 box_2 box_3 box_4, rows(2) cols(2)

. gr export ./figures/figc_a_2.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_a_2.png saved as PNG format

. 
. * FE-1 scatter
. 
. tempfile g1 g2 g3 g4

. 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. local i = 1

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          
.          spearman `var' ct_pan_vol
  5.          local rho = string(r(rho), "%4.2f")
  6.          local p = string(r(p), "%4.3f")
  7.          
.          scatter `var' ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue%50) || ///
>          scatter `var' ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red%50) ///
>          title("`grtitle'") ///
>          legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>          text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
>          xtitle("Pancreatic volume, ml") ///
>          name(g_`i', replace)
  8.          
.          local ++i
  9. }

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

Number of observations =    206
        Spearman's rho = 0.1811

Test of H0: ul_amylp and ct_pan_vol are independent
                  Prob = 0.0093

Number of observations =    199
        Spearman's rho = 0.0786

Test of H0: ngml_trypsinogen and ct_pan_vol are independent
                  Prob = 0.2693

. 
. * Lipase separately since it uses different x variable
. spearman lipase pan_head_ap

Number of observations =    305
        Spearman's rho = 0.0962

Test of H0: lipase and pan_head_ap are independent
                  Prob = 0.0934

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. local liplabel : variable label lipase

. local headlabel : variable label pan_head_ap

. scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue%50) || ///
> scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red%50) ///
> title("`liplabel'") ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
> text(60 4 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
> xtitle("Pancreatic Head AP length, cm") ///
> name(g_4, replace)

. 
. gr combine g_1 g_2 g_3 g_4, rows(2) cols(2)

. 
. gr export ./figures/figc_b.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_b.png saved as PNG format

. 
. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. local i = 1

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          
.          spearman `var' ct_pan_vol
  5.          local rho = string(r(rho), "%4.2f")
  6.          local p = string(r(p), "%4.3f")
  7.          
.          scatter `var' ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue%50) msize(small) || ///
>          scatter `var' ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red%50) ///
>          title("`grtitle'") ///
>          legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>          text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
>          xtitle("Pancreatic volume, ml") ///
>          name(g_`i', replace)
  8.          
.          local ++i
  9. }

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

Number of observations =    206
        Spearman's rho = 0.1811

Test of H0: ul_amylp and ct_pan_vol are independent
                  Prob = 0.0093

Number of observations =    199
        Spearman's rho = 0.0786

Test of H0: ngml_trypsinogen and ct_pan_vol are independent
                  Prob = 0.2693

. 
. * Lipase separately since it uses different x variable
. spearman lipase pan_head_ap

Number of observations =    305
        Spearman's rho = 0.0962

Test of H0: lipase and pan_head_ap are independent
                  Prob = 0.0934

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. local liplabel : variable label lipase

. local headlabel : variable label pan_head_ap

. scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue%50) || ///
> scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red%50) ///
> title("`liplabel'") ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
> text(60 4 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
> xtitle("Pancreatic Head AP length, cm") ///
> name(g_4, replace)

. 
. gr combine g_1 g_2 g_3 g_4, rows(2) cols(2)
error (1) reading file
Error in file, skipping lines:
 .insert (l1title = .sized_textbox.new, mtextq(`""') style(scheme l1title) orientation(vertical)) leftof plotregion1 , ring(1) 
.insert (l2title = .sized_textbox.new, mtextq(`""') style(scheme l2title) orientation(vertical)) leftof plotregion1 , ring(2) 
.insert (t1title = .sized_textbox.new, mtextq(`""') style(scheme t1title) ) above plotregion1 , ring(1) 
.insert (t2title = .sized_textbox.new, mtextq(`""') style(scheme t2title) ) above plotregion1 , ring(2) 
.insert (b1title = .sized_textbox.new, mtextq(`""') style(scheme b1title) ) below plotregion1 , ring(1) 
.insert (b2title = .sized_textbox.new, mtextq(`""') style(scheme b1title) ) below plotregion1 , ring(2) 
.insert (note = .sized_textbox.new, mtextq(`""') style(scheme note) ) below plotregion1 , ring(4) 
.note.style.editstyle box_alignment(SW) editcopy
.note.style.editstyle horizontal(left) editcopy
.insert (caption = .sized_textbox.new, mtextq(`""') style(scheme caption) ) below plotregion1 , ring(5) 
.caption.style.editstyle box_alignment(SW) editcopy
.caption.style.editstyle horizontal(left) editcopy
.insert (subtitle = .sized_textbox.new, mtextq(`""') style(scheme subtitle) ) above plotregion1 , ring(6) 
.subtitle.style.editstyle box_alignment(N) editcopy
.subtitle.style.editstyle horizontal(center) editcopy
.insert (title = .sized_textbox.new, mtextq(`""Lipase""') style(scheme title) ) above plotregion1 , ring(7) 
.title.style.editstyle box_alignment(N) editcopy
.title.style.editstyle horizontal(center) editcopy
.insert (spacert = .spacer.new) above plotregion1 , ring(11)
.insert (spacerb = .spacer.new) below plotregion1 , ring(11)
.insert (spacerl = .spacer.new) leftof plotregion1 , ring(11)
.insert (spacerr = .spacer.new) rightof plotregion1 , ring(11)
local tfmt 
.plotregion1.Declare textbox1 = .pos_textbox.new , ypos(60) xpos(4) forcesized mtextq(`" `"ρ = 0.10"' `"p = 0.093"'"') style(scheme text_option) 
.plotregion1.textbox1.style.editstyle  horizontal(left) size(vsmall) editcopy
.command = `"twoway scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue%50) || scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red%50) title("Lipase") lege
> nd(order(1 "NPM" 2 "PM")) text(60 4 "ρ = 0.10" "p = 0.093", size(vsmall) just(left)) xtitle("Pancreatic Head AP length, cm") name(g_4, replace)"'
.date = "24 Mar 2025"
.time = "14:48:47"
.dta_file = "./data-temp/subset_imaging.dta"
.dta_date = "24 Mar 2025 10:28"
<EndItem>
__000003.gversion invalid name
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD51173.000000"

. tempfile g1 g2 g3 g4

. 
. local enzymes "fecal_elastase ul_amylp ngml_trypsinogen"  

. local i = 1

. foreach var of varlist `enzymes' {
  2.          local grtitle : variable label `var'
  3.          local volabel : variable label ct_pan_vol
  4.          
.          spearman `var' ct_pan_vol
  5.          local rho = string(r(rho), "%4.2f")
  6.          local p = string(r(p), "%4.3f")
  7.          
.          scatter `var' ct_pan_vol if ever_mal==0, msymbol(circle) mcolor(blue%50) msize(small) || ///
>          scatter `var' ct_pan_vol if ever_mal==1, msymbol(diamond) mcolor(red%50) msize(small) ///
>          title("`grtitle'") ///
>          legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
>          text(200 150 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
>          xtitle("Pancreatic volume, ml") ///
>          name(g_`i', replace)
  8.          
.          local ++i
  9. }

Number of observations =     179
        Spearman's rho = -0.0162

Test of H0: fecal_elastase and ct_pan_vol are independent
                  Prob =  0.8291

Number of observations =    206
        Spearman's rho = 0.1811

Test of H0: ul_amylp and ct_pan_vol are independent
                  Prob = 0.0093

Number of observations =    199
        Spearman's rho = 0.0786

Test of H0: ngml_trypsinogen and ct_pan_vol are independent
                  Prob = 0.2693

. 
. * Lipase separately since it uses different x variable
. spearman lipase pan_head_ap

Number of observations =    305
        Spearman's rho = 0.0962

Test of H0: lipase and pan_head_ap are independent
                  Prob = 0.0934

. local rho = string(r(rho), "%4.2f")

. local p = string(r(p), "%4.3f")

. 
. local liplabel : variable label lipase

. local headlabel : variable label pan_head_ap

. scatter lipase pan_head_ap if ever_mal==0, msymbol(circle) mcolor(blue%50) msize(small) || ///
> scatter lipase pan_head_ap if ever_mal==1, msymbol(diamond) mcolor(red%50) msize(small) ///
> title("`liplabel'") ///
> legend(order(1 "`:label (ever_mal) 0'" 2 "`:label (ever_mal) 1'")) ///
> text(60 4 "ρ = `rho'" "p = `p'", size(vsmall) just(left)) ///
> xtitle("Pancreatic Head AP length, cm") ///
> name(g_4, replace)

. 
. gr combine g_1 g_2 g_3 g_4, rows(2) cols(2)

. 
. gr export ./figures/figc_b.png, as(png) replace
file /Users/juansolon/Documents/GitHub/sampa-radio/figures/figc_b.png saved as PNG format

. 
end of do-file

. tobit fecal_elastase ever_mal

Iteration 0:  Log likelihood =  -12220.18  
Iteration 1:  Log likelihood =  -12220.18  

Tobit regression                                    Number of obs     =  1,802
                                                           Uncensored =  1,802
Limits: Lower = -inf                                    Left-censored =      0
        Upper = +inf                                   Right-censored =      0

                                                    LR chi2(1)        =   7.82
                                                    Prob > chi2       = 0.0052
Log likelihood = -12220.18                          Pseudo R2         = 0.0003

---------------------------------------------------------------------------------------
       fecal_elastase | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
             ever_mal |   28.30351   10.11264     2.80   0.005     8.469776    48.13725
                _cons |   332.6861   6.733804    49.41   0.000     319.4792     345.893
----------------------+----------------------------------------------------------------
 var(e.fecal_elastase)|   45480.15   1515.163                      42603.49    48551.04
---------------------------------------------------------------------------------------

. sum ul_am

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    ul_amylp |      1,765    33.77156    15.71089        8.3      181.4

. bysort ever_mal : sum ul_am, detail

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> ever_mal = NPM

                        Amylase (U/L)
-------------------------------------------------------------
      Percentiles      Smallest
 1%         12.2            9.1
 5%         16.2            9.2
10%         19.1            9.3       Obs               1,008
25%        23.45           10.4       Sum of wgt.       1,008

50%         29.6                      Mean           32.39077
                        Largest       Std. dev.      13.74248
75%           38          100.5
90%         48.3          106.1       Variance       188.8559
95%         57.5          120.3       Skewness       1.896368
99%         78.6          124.8       Kurtosis       9.406015

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> ever_mal = PM

                        Amylase (U/L)
-------------------------------------------------------------
      Percentiles      Smallest
 1%         13.1            8.3
 5%         17.2            8.8
10%         20.1            8.9       Obs                 757
25%         24.4              9       Sum of wgt.         757

50%         31.1                      Mean           35.61017
                        Largest       Std. dev.      17.84536
75%           42          119.5
90%         57.1          143.8       Variance       318.4567
95%         66.7          178.3       Skewness       2.758245
99%        101.1          181.4       Kurtosis        17.2142


. bysort ever_mal : sum fecal_elastase, detail

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> ever_mal = NPM

                       Fecal Elastase
-------------------------------------------------------------
      Percentiles      Smallest
 1%       10.776          2.716
 5%       30.022          3.922
10%     48.67221          3.924       Obs               1,003
25%      132.437          4.867       Sum of wgt.       1,003

50%      313.704                      Mean           332.6861
                        Largest       Std. dev.      211.4907
75%     587.6312            600
90%          600            600       Variance       44728.32
95%          600            600       Skewness       .0038562
99%          600            600       Kurtosis       1.483128

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> ever_mal = PM

                       Fecal Elastase
-------------------------------------------------------------
      Percentiles      Smallest
 1%       12.428          1.823
 5%       34.982          3.761
10%     62.09501          4.312       Obs                 799
25%     146.2165          5.237       Sum of wgt.         799

50%      374.824                      Mean           360.9896
                        Largest       Std. dev.       215.727
75%          600            600
90%          600            600       Variance       46538.15
95%          600            600       Skewness      -.1845184
99%          600            600       Kurtosis       1.435243


