------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/juansolon/Documents/GitHub/sampa-radio/log/log.log
  log type:  text
 opened on:  20 Mar 2025, 04:12:27

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. br pan_body_trans pan_head_ap pan_head_trans pan_tail_trans if radio3==1 & cohort==3

. 
end of do-file

. tab cohort

     Cohort |      Freq.     Percent        Cum.
------------+-----------------------------------
     DIVIDS |        322       14.14       14.14
        SAM |        108        4.74       18.88
     CICADA |        976       42.84       61.72
    NUSTART |        289       12.69       74.41
      STATT |        275       12.07       86.48
      CLHNS |        308       13.52      100.00
------------+-----------------------------------
      Total |      2,278      100.00

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. missings report pan_body_trans pan_head_ap pan_head_trans pan_tail_trans if radio3==1 & cohort==3

Checking missings in pan_body_trans pan_head_ap pan_head_trans pan_tail_trans:
399 observations with missing values

------------------------
                |     #
----------------+-------
 pan_body_trans |     9
    pan_head_ap |    69
 pan_head_trans |    22
 pan_tail_trans |   399
------------------------

. 
end of do-file

. count if radio3==1 & cohort==3
  416

. tab cohort radio_mis_dims

           |                     radio_mis_dims
    Cohort |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
    DIVIDS |       285         18          2          0         17 |       322 
       SAM |        80          2          0          0         26 |       108 
    CICADA |        17        323         52         24        560 |       976 
   NUSTART |       260          7          2          1         19 |       289 
     STATT |        74        184          2          0         15 |       275 
     CLHNS |       289          1          0          0         18 |       308 
-----------+-------------------------------------------------------+----------
     Total |     1,005        535         58         25        655 |     2,278 

. count if pan_head_trans !=. if cohort==3
invalid syntax
r(198);

. count  pan_head_trans !=. & cohort==3
varlist not allowed
r(101);

. count  if pan_head_trans !=. & cohort==3
  394

. count  if pan_head_ap !=. & cohort==3
  347

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. // Set up multiple imputation for each cohort
. forvalues c = 1/6 {
  2.     // Save original dataset
.     preserve
  3.     
.     // Keep only cohort c
.     keep if cohort==`c'
  4.     
.     // Multiple imputation
.     mi set wide
  5.     mi register imputed pan_head_ap pan_head_trans pan_body_trans pan_tail_trans
  6.     mi impute mvn pan_head_ap pan_head_trans pan_body_trans pan_tail_trans = age bmi, add(20)
  7.     
.     // Run PCA on each imputed dataset
.     mi xeq: pca pan_head_ap pan_head_trans pan_body_trans pan_tail_trans
  8.     mi xeq: predict pc1_imp pc2_imp, score
  9.     
.     // Combine results across imputations
.     mi estimate: mean pc1_imp pc2_imp
 10.     
.     restore
 11. }
(1,956 observations deleted)
variable survey not found
    Your mi data are xtset and some of the variables previously declared by xtset are not in the dataset.  mi verifies that none
    of the xtset variables are also registered as imputed or passive.  Type mi xtset, clear to clear old no-longer-valid settings.
r(111);

end of do-file

r(111);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. dtable  ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_vol if ct2==1, ///
>                 by(ever_mal, nototals) ///
>                 continuous(ct_pan_head_ap ct_pan_head_trans ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail, statistic(p50 iq
> r) test(kwallis)) 

--------------------------------------------------------------------------------------------------------------
                                                                                Ever experience malnutrition? 
                                                                                     NPM              PM      
--------------------------------------------------------------------------------------------------------------
N                                                                                  168 (51.1%)     161 (48.9%)
Pancreas head size measured in transverse dimension                                2.640 0.530     2.660 0.640
Pancreas head size measured in anterior/posterior dimension                        2.580 0.525     2.500 0.600
Pancreas body size measures in anterior/posterior dimension; maximum diameter      2.080 0.630     2.110 0.690
Pancreas tail size measure in anterior/posterior dimension                         1.765 0.550     1.770 0.590
Length of Pancreas body and tail size measured in anterior/posterior dimension    10.440 2.070     9.855 1.890
Calculated Pancreatic Volume; Study                                            66.856 (20.935) 66.500 (23.528)
--------------------------------------------------------------------------------------------------------------

. 
.                 
. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_vol {
  2.         kwallis `var'  ,by(ever_mal)
  3. }

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 167 | 27312.50 |
  |       PM | 157 | 25337.50 |
  +---------------------------+

  chi2(1) =  0.043
     Prob = 0.8356

  chi2(1) with ties =  0.043
               Prob = 0.8356

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 168 | 28731.00 |
  |       PM | 159 | 24897.00 |
  +---------------------------+

  chi2(1) =  1.904
     Prob = 0.1677

  chi2(1) with ties =  1.904
               Prob = 0.1676

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 167 | 26213.00 |
  |       PM | 159 | 27088.00 |
  +---------------------------+

  chi2(1) =  1.646
     Prob = 0.1994

  chi2(1) with ties =  1.647
               Prob = 0.1994

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 168 | 26790.00 |
  |       PM | 157 | 26185.00 |
  +---------------------------+

  chi2(1) =  0.492
     Prob = 0.4828

  chi2(1) with ties =  0.493
               Prob = 0.4828

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 121 | 16852.00 |
  |       PM | 130 | 14774.00 |
  +---------------------------+

  chi2(1) =  7.808
     Prob = 0.0052

  chi2(1) with ties =  7.808
               Prob = 0.0052

Kruskal–Wallis equality-of-populations rank test

  +---------------------------+
  | ever_mal | Obs | Rank sum |
  |----------+-----+----------|
  |      NPM | 118 | 14607.00 |
  |       PM | 124 | 14796.00 |
  +---------------------------+

  chi2(1) =  0.246
     Prob = 0.6199

  chi2(1) with ties =  0.246
               Prob = 0.6199

. 
end of do-file

. stripplot ct_pan_body_tail, over(ever_mal)

. stripplot ct_pan_body_tail, over(ever_mal) cumul

. help putdocx

. help blandaltman

. net search upsetplot
(contacting http://www.stata.com)

2 packages found (Stata Journal listed first)
---------------------------------------------

gr0095 from http://www.stata-journal.com/software/sj24-2
    SJ24-2 gr0095. The joy of sets: Graphical ... / The joy of sets: Graphical
    alternatives to Euler / and Venn diagrams / by Nicholas J. Cox, Department
    of Geography, / Durham University, Durham, U.K. / Tim P. Morris, MRC
    Clinical Trials Unit, / University College London, London, U.K. / Support:

upsetplot from http://fmwww.bc.edu/RePEc/bocode/u
    'UPSETPLOT': module to show Euler or Venn diagrams mapped to bar charts,
    upsetplot style / upsetplot produces a bar chart alternative to Euler or
    Venn / diagrams showing the frequencies (or more generally abundances) /
    of subsets of observations as defined jointly by a bundle of / numeric


1 reference found in tables of contents
---------------------------------------

http://fmwww.bc.edu/RePEc/bocode/u/
    module to provide prefix command for unicode utilities / module to perform
    univariate categorical goodness-of-fit tests / module to extract paradata
    from a string variable produced by the universal client-side paradata
    script / module to estimate the generalized unidiff model for


. net install schemepack, from("https://raw.githubusercontent.com/asjadnaqvi/stata-schemepack/main/installation/") replace
checking schemepack consistency and verifying not already installed...
installing into /Users/juansolon/Library/Application Support/Stata/ado/plus/...
installation complete.

. help set scheme

. set scheme
invalid syntax
r(198);

. query graphics
------------------------------------------------------------------------------------------------------------------------------------
    Graphics settings
      set graphics         on
      set scheme           stcolor
      set printcolor       asis       may be automatic, asis, gs1, gs2, gs3
      set copycolor        asis       may be automatic, asis, gs1, gs2, gs3
      set maxbezierpath    0          bezier path elements

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj`var' = `var'/weight'
  3. }       
weight' invalid name
r(198);

end of do-file

r(198);

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj`var'wt = `var'/weight
  3. }       
(729 missing values generated)
(882 missing values generated)
(673 missing values generated)
(1,082 missing values generated)

. 
end of do-file

. missings report pan_head_ap

Checking missings in pan_head_ap:
724 observations with missing values

---------------------
             |     #
-------------+-------
 pan_head_ap |   724
---------------------

. list if weight ==.

      +----------------------------------------------------------------------------------------------------------------------------+
  22. | record~d |  cohort | sampa_id | orgid |    sex |        dob |  age | control | cont_age | cont_s~e | cont_m~d  | cont_h~t  |
      |   71-238 |  DIVIDS |    10188 |  0188 | Female | 2007-06-27 | 15.2 |       . |        . |        . |        .  |        .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |  cont_art  |  cont_a~s  |  explain   |  insuli~p   |              consent_basic   |  assent   |                preg_test   |
      |         .  |         .  |      Yes   |         .   |     Consents to basic OGTT   |     Yes   |                        .   |
      |-----------------------------------------------------------------------------------+-----------+----------------------------|
      |                            preg_result  | indept~e  | indept~p  | ct_sam~e  | ct  | ivgtt_~e  | ivgtt  | uss_sa~e  |  uss  |
      |                                      .  |       No  |        .  |       No  |  .  |        0  |     .  |      Yes  |  Yes  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ever_mal |           degree_mal | clini~mo |       marital |                                          education | edu_fa~r |
      |       PM |        Normal weight |          |             . |                                                  . |        . |
      |----------+-------------------------------------------------+---------------------------------------------------------------|
      | edu_mo~r | edu_ch~d |        employ | em~ather | em~other  | num_re~e  | re_dwelltype  | re_dwe~o  | re_ten~s  | re_ten~o  |
      |        . |        . |             . |        . |        .  |        .  |            .  |           |        .  |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                                    re_house  |  re_hou~o  |  rooms  |                                re_cook  |  re_coo~o  |
      |                                           .  |         .  |      .  |                                      .  |            |
      |----------------------------------------------------------------------------------------------------------------------------|
      |  re_fuel | re_fue~o |     re_electric | re_ele~o |             re_water | re_wat~o |                  re_toilet | re_toi~o |
      |        . |          |               . |          |                    . |          |                          . |          |
      |---------------------------------------+------------------------------------------------------------------------------------|
      | vcd |  tv | ref | wmachine | computer | stove  | radio  | phone  | cellph~e  | efan  | ac  | sewing  | cow  | pig  | goat  |
      |   . |   . |   . |        . |        . |     .  |     .  |     .  |        .  |    .  |  .  |      .  |   .  |   .  |    .  |
      |-----------------+----------+-----------------------------------------------------------------------------------------------|
      | poultr~n | bike | motorc~e | car | boat | tractor | table | chair | solar  | ses_te~1  | ses_te~2  | ses_te~3  | ses_te~4  |
      |        . |    . |        . |   . |    . |       . |     . |     . |     .  |        .  |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | ses_te~5 |     comp1  | ses_te~6  | ses_te~e  | clinic_~ry  |          pregnant  |                           preg_result1  |
      |        . |         .  |        .  |        .  | 2022-07-27  |                 .  |                                      .  |
      |----------+--------------------------------------------------+--------------------------------------------------------------|
      | suspec~v | hiv | art | art_yrs |     re_art_type | re_art~o | diab | re_dia~r | diag_d~0 | diag_d~1 | diag_d~2 | diag_d~3  |
      |       No |   . |   . |         |               . |          |   No |          |        . |        . |        . |        .  |
      |----------+---------------------+---------------------------------------------------------+---------------------------------|
      | diag_d~4 | diag_d~9 | re_dia~s | re_dia~n | re_dia~1 | ~g1_spec  | re_dia~2  | r~2_spec  | re_dia~3  | r~3_spec  | diag_4  |
      |        . |        . |          |        0 |        . |           |        .  |           |        .  |           |      .  |
      |----------+----------+----------+----------+----------+---------------------------------------------------------------------|
      | diag4_~c | re_lun~1 | re_con~1 | re_con~c | peptic~1 | liver_~1 | kidney~1  | cancer1  | lung_d~2  | re_lun~2  | contis~2  |
      |        . |        . |        . |          |        . |        . |        .  |       .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+--------------------------------------------+-----------+-----------+-----------|
      | c~2_spec | peptic~2 | liver_~2 | kidney~2 | cancer2 | lung_d~3 | contis~3  | c~3_spec  | peptic~3  | liver_~3  | kidney~3  |
      |        . |        . |        . |        . |       . |        . |        .  |        .  |        .  |        .  |        .  |
      |-----------------------------------------------------+----------+-----------------------------------------------------------|
      | cancer3 | lung_d~4 | contis~4 | c~4_spec | peptic~4 | liver_~4 | kidney~4 | cancer4 | hosp_f~q | hosp_d~g | hosp_d~s | med |
      |       . |        . |        . |        . |        . |        . |        . |       . |        . |        . |          |   . |
      |----------------------------------------------------------------------------------------------------------------------------|
      | med_ty~1 | med_ty~2 | med_ty~3 | med_ty~4 | med_ty~5  | med_ty~9  | re_med~s  | thirst  | polyuria  | fatigue  | polydi~a  |
      |        0 |        0 |        0 |        0 |        0  |        .  |           |     No  |       No  |      No  |       No  |
      |----------+----------+----------+----------+--------------------------------------------------------------------+-----------|
      | blurre~n | numbness | other~s1 | other~s2 | other~s3 | other~s4 | other~s5 | other~s6  | other~s7  | other~s8  | other~s9  |
      |       No |       No |        0 |        0 |        0 |        0 |        0 |        0  |        0  |        0  |        0  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | other~10 | other~11 | other~12 | other~13 | other~14 | other~15 | other~16 | other~17  | other~18  | other~99  | re_sym~s  |
      |        0 |        0 |        0 |        1 |        1 |        0 |        0 |        0  |        0  |        .  |           |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | med_ex~1 | med_ex~2  | med_ex~3  | med_ex~4  | med_ex~5  | med_ex~6  | med_ex~7  | med_ex~8  | med_e~99  |   clin_summary  |
      |        0 |        0  |        0  |        0  |        0  |        0  |        0  |        1  |        .  | Generally well  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |           exam_by | sig_exam |                           sig_exam_upload  | metfor~n  | insulin  | flag_m~n  | clinic_~tt  |
      |    Dr. Rekha Garg |          | 54666870-FB14-4559-BBBF-8ADD51A74899.jpeg  |        .  |       .  |        0  | 2022-08-27  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                                                      sample_gp  |    standard_ogtt  |                fasting  |  ogtt_u~t  |
      |     SAM Lusaka, DIVIDS, adults who want only 3-time point OGTT  |                .  |  Nothing or only water  |     mg/dL  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ogtt_t..  | time0_w  |            time0_x  |            time0_y  |  time0_z  |             time0_a  |             time0_b  |
      | 10:35:00  |   10188  |              10188  |                     |        .  |                      |                      |
      |----------------------------------------------------------------------------------------------------------------------------|
      |            time0_c | time0_e | time0_f | time0_g | time0_h | time0_j | time0_k | ogtt_s~m | ogtt_~a0 | ogtt_~o0 | ~a0_cold |
      |                    |         |         |         |         |         |         |      Yes |      Yes |        . |        . |
      |----------------------------------------+-----------------------------------------------------------------------------------|
      |     ogtt_comment_time0 | hba1c | glu0  | mmol_~u0  | out_glu0  | glu0_m~g  | glu0_m~y  | cpept~e0  | mul_c~e0  | ngml_~e0  |
      |                        |   5.3 |   90  |        5  |        0  |       No  |           |      .89  | 49.44444  |      .89  |
      |------------------------+---------------------------------------------------+-----------------------+-----------------------|
      | pmol_~e0  |  insulin0  |  i~n0_mul  |  ~n0_pmol  |  ogtt_t..  |  time15_z  |             time15_a  |             time15_b  |
      | 296.6667  |      4.41  |      4.41  |     26.46  |            |         .  |                       |                       |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      |            time15_c | ogtt~a15 | ogtt_c.. | glu15  | mmol_~15  | out_g~15  | glu15_~g  | glu15_~y  | cpept~15  | mul_c~15  |
      |                     |        . |          |     .  |        .  |        0  |        .  |           |        .  |        .  |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      | ngml_~15  |  pmol_~15  |  insul~15  |  i~15_mul  |  ogtt_t..  |  time30_z  |             time30_a  |             time30_b  |
      |        .  |         .  |         .  |         .  |            |         .  |                       |                       |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      |            time30_c | time30_e | time30_f | time30_g | time30_h | time30_j | time30_k  | ogtt_s..  | ogtt~o30  | ~30_cold  |
      |                     |          |          |          |          |          |           |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ogtt_c.. | glu30 | mmol_~30 | out_g~30 | glu30_~g  | glu30_~y  | cpept~30  | mul_c~30  | ngml_~30  | pmol_~30  | insul~30  |
      |          |     . |        . |        0 |        .  |           |        .  |        .  |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------+-----------+-----------|
      | i~30_mul | ogtt_t.. | time45_z |            time45_a |            time45_b  |            time45_c  | ogtt~a45  | ogtt_c..  |
      |        . |          |        . |                     |                      |                      |        .  |           |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | glu45 | mmol_~45 | out_g~45 | glu45_~g | glu45_~y  | cpept~45  | mul_c~45  | ngml_~45  | pmol_~45  | insul~45  | i~45_mul  |
      |     . |        . |        0 |        . |           |        .  |        .  |        .  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------------------+-----------+-----------+-----------|
      | ogtt_t.. | time60_z |            time60_a |            time60_b |            time60_c  | time60_e  | time60_f  | time60_g  |
      |    11:35 |        . |                     |                     |                      |           |           |           |
      |----------+----------+---------------------+--------------------------------------------+-----------+-----------+-----------|
      | time60_h | time60_j | time60_k | ogtt~a60 | ogtt~o60  | ~60_cold  | ogtt_c..  | glu60  | mmol_~60  | out_g~60  | glu60_~g  |
      |          |          |          |      Yes |        .  |        .  |           |   108  |        6  |        0  |       No  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | glu60_~y  | cpept~60  | mul_c~60  | ngml_~60  | pmol_~60  |  insul~60  |  i~60_mul  |  ~60_pmol  |  ogtt_t..  |  time90_z  |
      |           |     5.53  | 307.2222  |     5.53  | 1843.333  |     55.62  |     55.62  |    333.72  |            |         .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |            time90_a |            time90_b |            time90_c | time90_e | time90_f  | time90_g  | time90_h  | time90_j  |
      |                     |                     |                     |          |           |           |           |           |
      |---------------------+---------------------+--------------------------------+-----------+-----------+-----------+-----------|
      | time90_k | ogtt~a90 | ogtt~o90 | ~90_cold | ogtt_c..  | glu90  | mmol_~90  | out_g~90  | glu90_~g  | glu90_~y  | cpept~90  |
      |          |        . |        . |        . |           |     .  |        .  |        0  |        .  |           |        .  |
      |----------+----------+----------+----------+--------------------------------+-----------------------+-----------------------|
      | mul_c~90 | ngml_~90 | pmol_~90 | insul~90 | i~90_mul | ogtt_t.. | time12~z |            time120_a  |            time120_b  |
      |        . |        . |        . |        . |        . |    12:40 |        . |                       |                       |
      |----------------------------------------------------------------------------------------------------+-----------------------|
      |            time120_c | time12~e | time12~f | time12~g | time12~h | time12~j | time12~k | ogtt_s..  | ogt~o120  | ~20_cold  |
      |                      |          |          |          |          |          |          |      Yes  |        .  |        .  |
      |----------------------------------------------------------------------------------------+-----------+-----------+-----------|
      | ogtt_c.. | glu120 | mmol_g.. | out_~120 | glu120~g | glu120~y  | cpep~120  | mul_~120  | ngml~120  | pmol~120  | insu~120  |
      |          |     96 |     5.33 |        0 |       No |           |     4.47  | 248.3333  |     4.47  |     1490  |    35.18  |
      |----------+-----------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | i~20_mul | ~20_pmol | high_h~1 | high_g~1 | repeat~d | repeat~e  | thawed  | pmh_diab  |   homair  | homair~1  | homabeta  |
      |    35.18 |   211.08 |        0 |        0 |       No |           |     No  |       No  |      .98  | 10.98765  |     58.8  |
      |----------+----------+----------+----------+----------+---------------------+-----------+-----------+-----------+-----------|
      | homabe~p | flag_f~5 | gluc_~ol | gluc_~dl | in~n_mul | Matsud~x | glu0_m~l | glu60_~l  | insuli~x  | flag_p~I  | glu30_~l  |
      |    .1602 |        0 | 5.443333 |    97.98 | 31.73667 | 9.001401 |       90 |      108  |    2.845  |        0  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------+-----------|
      | ogttr_~m | rogtt_~t | ~r_time0  | ogt~e0_1  | ogttr_~a  | ~s_time0  | rglu0  | rglu0_~g  | rglu0_~y  | rhba1c  | ogttr_..  |
      |        . |        . |           |           |        .  |           |     .  |        .  |        .  |      .  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | ogt~30_1 | ogttr_.. | ogttr_.. | rglu30 | rglu30~g  | rglu30~y  | ogttr_..  | ogt~20_1  | ogttr_..  | ogttr_..  | rglu120  |
      |        . |        . |        . |      . |        .  |        .  |           |           |        .  |           |       .  |
      |----------+----------+----------+--------------------------------+-----------+-----------+-----------+----------------------|
      | rglu12~g | rglu12~y | mmol_r~0 | high_g~2 | dia_re~l | glu_co~t | total_~o  | total_~b  | total_~c  | ldl_cho  | ldl_ch~b  |
      |        . |        . |        . |        0 |        . |          |      105  |       No  |           |      67  |        .  |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | ldl_ch~c | hdl_cho | hdl_ch~b | hdl_ch~c | trig | trig_p~b | trig_p~c | lipid_~t  |   hgb  | hgb_prob  | hgb_pr~c  |  rbc  |
      |          |      38 |       No |          | 63.0 |       No |          |    mg/dL  | 11.40  |       No  |        .  | 4.12  |
      |----------+--------------------------------------+----------+----------+-----------+----------------------------------------|
      | rbc_prob | rbc_pr~c | wbc | wbc_prob | wbc_pr~c | platelet | platel~b | platel~c  | lipase  | lipase~b  | lipase~c  | crp  |
      |       No |        . |   4 |       No |        . |      155 |       No |        .  |     29  |       No  |        .  |  .5  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | crp_prob | crp_pr~c | mgl_crp | mgl_cy~n | ul_amylp | clini~ro | systol~1  | systol~2  | systol~3  | systolic  | diasto~1  |
      |       No |        . |      .5 |        . |        . |          |        .  |        .  |        .  |        .  |        .  |
      |----------+----------+--------------------+---------------------------------------------------------------------------------|
      | diasto~2 | diasto~3 | diasto~c | weight1 | weight2 | weight3 | weight | height1 | height2 | height3  | sit_ht1  | sit_ht2  |
      |        . |        . |        . |       . |       . |       . |      . |       . |       . |       .  |       .  |       .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | sit_ht3 | sit_box | tibia1 | tibia2 | tibia3 | tibia | grip_d~d | grip_~r1 | grip_~r2  | grip_~r3  | min_gr~r  | grip_u~r  |
      |       . |       . |      . |      . |      . |     . |        . |        . |        .  |        .  |        .  |        .  |
      |------------------------------------------------------+----------+----------------------------------------------------------|
      | grip_~l1 | grip_~l2 | grip_~l3 | min_gr~l | max_gr~l | max_gr~r | max_grip  | grip_u~l  | muac1  | muac2  | muac3  | muac  |
      |        . |        . |        . |        . |        . |        . |        .  |        .  |     .  |     .  |     .  |    .  |
      |-----------------------------------------------------------------+-----------+-----------+----------------------------------|
      | waist1 | waist2 | waist3 | waist | hip1  | hip2  | hip3  | hip  | triceps1  | triceps2  | triceps3  | triceps  | subscap1  |
      |      . |      . |      . |     . |    .  |    .  |    .  |   .  |        .  |        .  |        .  |       .  |        .  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      | subscap2 | subscap3 | subscap |                                 anthro_prob  | menstr~e  | menst_~h  | tanner  | tanner~d  |
      |        . |        . |       . |                                              |        .  |           |      .  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | adj_he~1 | adj_he~2 | adj_he~3 | height | adj_si~1 | adj_si~2 | adj_si~3 | si~1_adj | si~2_adj | si~3_adj | sit_ht  | bmi  |
      |        . |        . |        . |      . |        . |        . |        . |        . |        . |        . |      .  |   .  |
      |----------------------------------------------------+-----------------------------------------------------------------------|
      | haz | bmiz | bmi_ca~d | bmi_cat | clinic_~dy | bia | fm_kg | fm_per | ffm_kg | ffm_per | fmi | ffmi | impeda~e | bia_prob  |
      |   . |    . |        . |       . |            |   . |     . |      . |      . |       . |   . |    . |        . |        .  |
      |----------------------------------------------------+-----------------------------------+-----------------------+-----------|
      | bia_co~t | adp | adpfm_kg  | adpffm~g  | adpfm_~r  | adpffm~r  | adp_prob  | adp_co~t  | redcap~p  | perso~10  | times~10  |
      |          |   . |        .  |        .  |        .  |        .  |        .  |           |  1divids  |           |           |
      |----------+-----------------------------------------------------------------------------+-----------+-----------+-----------|
      | clinic~l | refer_~n | radiol~r | radiol~s | elasta~l  | fecal_~t  | elasta~r  | refer  | refer_..  | refer_..  | refer_..  |
      |          |        . |        . |          |        .  |        .  |        .  |     .  |        0  |        0  |        0  |
      |----------+----------+----------+----------+--------------------------------------------+-----------+-----------+-----------|
      | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_..  | refer_~o  | refer_~i  | refer~ss  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        .  |           |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_..  | refer_..  | refer_..  | refer_..  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        0  |        0  |        0  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | refer~rs | refer~e1 | refer~e2 | refer~e3 | refer~e4 | refer~e7 | refer~e8 | refer~e9  | refe~e10  | refer~e5  | refer~e6  |
      |          |          |          |          |        . |        . |          |           |        .  |           |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      | clinic_d~s  | urine  | urine_co~t  | urine_~e  |       urine_ali_q  |       urine_ali_r  | u_coll~t  | u_leucs  |  u_gluc  |
      | 2022-07-27  |   Yes  | 2022-07-27  |    13:25  |                    |                    |      Yes  |       0  |       0  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | u_ketone | u_prot | u_nitr~e | u_blood | urine_~m |                 feces | feces_c~dt | feces~me  | feces_~s  | feces~_t  |
      |        0 |      0 |        0 |      ++ |     None |                     . |            |           |           |           |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | feces_~u | feces_~p | feces~te | feces~de | feces~ct | fecal_~e | fecal_~o |                                feces_problem  |
      |          |        . |          |        . |        . |        . |        . |                                               |
      |----------------------------------------------------------------------------------------------------------------------------|
      | clinic_~et | re_cit~s | re_ber~s | re_ban~s | re_app~s | re_pin~s |                                   re_mango | re_melon  |
      |            |        . |        . |        . |        . |        . |                                          . |        .  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      | re_dry~t |                                  re_tomato | re_pep~r | re_ora~g |      re_green_leafy  | re_cru~s  | re_gourd  |
      |        . |                                          . |        . |        . |                   .  |        .  |        .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | legumes | nuts_s~s |            red_meat | poultry | processed_meat | organ_~t |           fish | seafood |           eggs |
      |       . |        . |                   . |       . |              . |        . |              . |       . |              . |
      |---------------------------------------------------------------------+----------+-------------------------------------------|
      |  milk |            milk_tea | yogurt | yogurt~t | yogurt~k | cheese | icecream | dairy_~h  | fruit_~e  |  soda  | alcohol  |
      |     . |                   . |      . |        . |        . |      . |        . |        .  |        .  |     .  |       .  |
      |-------+------------------------------+--------------------------------------------------------------------------+----------|
      | fries | fried_~t | crisps | crackers | samosas | pizza_~r | savour~h |  cake |        cookies | pudding | candy | street~d |
      |     . |        . |      . |        . |       . |        . |        . |     . |              . |       . |     . |        . |
      |------------------------------------------------------------------------------+---------------------------------------------|
      | fast_f~d | alcoho~t | re_leg~s | radio_~m | date_exa~s | time_e~s | pan_si~l | pan_he~s | pan_he~p | pan_bo~s  | pan_ta~s  |
      |        . |        . |        . |      Yes | 2022-07-27 |    11:43 |   Normal |     1.52 |     1.94 |     1.33  |      1.7  |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | pan_sh~e  | pan_sh~m  | pan_sh~y  |   pan_contour  | pan_co~m  | pan_co~y  | pan_pa~a  | pan_pa~m  | pa~rosis  | pa~tosis  |
      |   Normal  |        .  |           | Normal/Smooth  |        .  |           |   Normal  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | pan_duct | pan_d~es | pan_d~ss | pan_ca~i | pan_ca~e | pan_cy~s | pan_ot~l | pan_ot~y  | image_~s  | image_~l  | image_~y  |
      |   Normal |        . |        . |   Absent |        . |          |       No |           |  Optimal  |        .  |           |
      |---------------------+------------------------------------------------------------------------------------------------------|
      |       name_radio    |                       sig_radio    |             sig_uss_upload    |                     file_uss    |
      |   Dr. Nitin Sood    |                                    |    Dr Nitins signature.jpg    |    202207271143590089ABD.DCM    |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                  file_uss2   |                  file_uss3   |                  file_uss4   |                   file_uss5   |
      |  202207271144040090ABD.DCM   |  202207271144090091ABD.DCM   |  202207271144310092ABD.DCM   |   202207271144510093ABD.DCM   |
      |------------------------------+------------------------------+------------------------------+-------------------------------|
      |                  file_uss6   |                  file_uss7   |                  file_uss8   |                   file_uss9   |
      |  202207271144580094ABD.DCM   |  202207271145140095ABD.DCM   |  202207271145170096ABD.DCM   |   202207271145550097ABD.DCM   |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                file_uss10 | hepato~y | spleno~y | cholel~s | steato~s | mass | gyneco~c | athero~s | nephro~s  | pancre~c  |
      | 202207271146040098ABD.DCM |        0 |        0 |        0 |        0 |    0 |        0 |        0 |        0  |        0  |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | ct_scan | ct_date | ct_time | ct_p~ual | ct_pan..  | ct_pan~p  | ct_pan..  | c~tail~s  | ct_pa~il  | ct_pan~y  | ct_pan~d  |
      |      No |         |         |        . |        .  |        .  |        .  |        .  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ct_pa~pe | ct_pan.. | ct_pan.. | ct_pan~r | ct_pan.. | ct_pan.. | ct_pan~a | ct_pa~am  | ct~rosis  | ct~tosis  | ct_pan~t  |
      |        . |        . |          |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+--------------------------------------------------------------------------------|
      | ct_pa~es | ct_pa~ss | ct_pan~i | ct_pa~ce | ct_p~mal  | c~n_spec  | ct_ima~l  | ct_pro~m  | ct_pro~y  | name_ct  | sig_ct  |
      |        . |        . |        . |        . |        .  |           |        .  |        .  |           |          |         |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | sig_ct~d | file_ct | file_ct2 | file_ct3 | file_ct4 | file_ct5 | file_ct6  | file_ct7  | file_ct8  | file_ct9  | file_c~0  |
      |          |         |          |          |          |          |           |           |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | r2_pan.. | r2_pan~p | r2_pan.. | r2_pan.. | r2_pa~il | r2_pan~y | r2_pan~d | r2_rem~s  | r2_pan..  | r2_pan..  | r2_pan..  |
      |        . |        . |        . |        . |        . |        . |        . |           |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | r2_pan.. | r2_pan.. | r2_pan.. | r2_pan.. | r2_rem~a | r3_pan.. | r3_pan~p | r3_pan..  | r3_pan..  | r3_pa~il  | r3_pan~y  |
      |        . |        . |        . |        . |          |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | r3_pan~d | r3_rem~s | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan..  | r3_pan..  | r3_rem~a  | i~e_ne10  |
      |        . |          |        . |        . |        . |        . |        . |        .  |        .  |        .  |           |
      |----------+----------+----------+----------+--------------------------------------------------------------------------------|
      | iv~e_ne1 | ivgt~e_2 | ivgt~e_4 | ivgt~e_6 | ivgt~e_8  | ivg~e_10  | i~t_ne10  | iv~t_ne1  | ivgtt_2  | ivgtt_4  | ivgtt_6  |
      |          |          |          |          |           |           |        .  |        .  |       .  |       .  |       .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ivgtt_8 | ivgtt_10 | iv~e10_l | iv~e10_m | iv~e10_n | iv~e10_p | ivti~1_l  | ivti~1_m  | ivti~1_n  | ivti~1_p  | ivti~2_l  |
      |       . |        . |          |          |          |          |           |           |           |           |           |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ivti~2_m | ivti~2_n | ivti~2_p | ivti~4_l | ivti~4_m | ivti~4_n | ivti~4_p | ivti~6_l  | ivti~6_m  | ivti~6_n  | ivti~6_p  |
      |          |          |          |          |          |          |          |           |           |           |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ivti~8_l  | ivti~8_m  | ivti~8_n  | ivti~8_p  | iv~_10_l  |  iv~_10_m  |  iv~_10_n  |  iv~_10_p  |  temp_o~d  |  flag_f~e  |
      |           |           |           |           |           |            |            |            |         .  |         .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |          _merge | recrui~d | ass~tase  | ass~pase  | radio2  | ct2  | radio_~s  | radio_~l  | radio3  | subset  | subset2  |
      | Master only (1) |        1 |        0  |        1  |    Yes  |  No  |        0  |       12  |    Yes  |      1  |       1  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | epi_bi~y | epi_or~l | child | africa  |          exposuretime  | fec_co~t  | ct_pa~ol  | r2_pa~ol  | r3_pa~ol  | r2_pan..  |
      |        . |        . | Child |   Asia  | Exposure in Childhood  |   DIVIDS  |        .  |        .  |        .  |        .  |
      |----------+----------+------------------------------------------+-----------+-----------+-----------+-----------+-----------|
      | r3_pan.. |       xb | hiv2 | _est_m~1  | _est_m~2  | _est_m~3  | _est_m~4  | _est_m~5  | _est_~5a  | _est_~5b  | _est_~5c  |
      |        . |        . |    0 |        0  |        0  |        0  |        0  |        0  |        0  |        0  |        0  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      |       pc1 |       pc2 | pc_f~1_c1 | pc_f~2_c1 | pc~il1_c1  | pc~il2_c1  | pc_~r1_c1  | pc_~r2_c1  | st~ll1_c1  | s~ll2_c1  |
      | -.0463378 |  .9488155 |  .1170309 | -.3841779 |  -.310951  | -.2160233  |  .3331887  | -.4396421  |  .0840745  | -.420482  |
      |-----------+-----------+-----------+-----------+----------------------------------------------------------------------------|
      | st~il1_c1 | st~il2_c1 | std~r1_c1 | std~r2_c1 | p~ll1_c2 | p~ll2_c2 | p~il1_c2 | p~il2_c2 | pc~r1_c2 | pc~r2_c2 | s~ll1_c2 |
      | -.2468258 | -.2371746 |  .2630714 | -.4825738 |        . |        . |        . |        . |        . |        . |        . |
      |----------------------------------------------------------------------------------------------------------------------------|
      | s~ll2_c2 | s~il1_c2 | s~il2_c2 | st~r1_c2 | st~r2_c2 | p~ll1_c3 | p~ll2_c3 | p~il1_c3  | p~il2_c3  | pc~r1_c3  | pc~r2_c3  |
      |        . |        . |        . |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------------------+-----------+-----------------------|
      | s~ll1_c3 | s~ll2_c3 | s~il1_c3 | s~il2_c3 | st~r1_c3 | st~r2_c3 | pc_f~1_c4 | p~ll2_c4 | pc~il1_c4 | p~il2_c4 | pc_~r1_c4  |
      |        . |        . |        . |        . |        . |        . |         . |        . |         . |        . |         .  |
      |----------+-----------------------------------------------------------------------------------------+-----------------------|
      | pc~r2_c4 | st~ll1_c4 | s~ll2_c4 | st~il1_c4 | s~il2_c4 | st~r1_c4 | st~r2_c4 | p~ll1_c5 | p~ll2_c5 | p~il1_c5  | p~il2_c5  |
      |        . |         . |        . |         . |        . |        . |        . |        . |        . |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------+-----------+-----------|
      | pc~r1_c5 | pc~r2_c5 | s~ll1_c5 | s~ll2_c5 | s~il1_c5 | s~il2_c5 | st~r1_c5 | st~r2_c5  | p~ll1_c6  | p~ll2_c6  | p~il1_c6  |
      |        . |        . |        . |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------------------------------+-----------|
      | p~il2_c6 | pc~r1_c6 | pc~r2_c6 | s~ll1_c6 | s~ll2_c6 | s~il1_c6 | s~il2_c6 | st~r1_c6 | st~r2_c6  | pc1_com~d  | pc2_co~d  |
      |        . |        . |        . |        . |        . |        . |        . |        . |        .  |  .0840745  | -.420482  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |           adjp~pwt           |           adjpan..           |           a~body~t           |           a~tail~t            |
      |                  .           |                  .           |                  .           |                  .            |
      +----------------------------------------------------------------------------------------------------------------------------+

      +----------------------------------------------------------------------------------------------------------------------------+
  28. | record~d |  cohort | sampa_id | orgid |    sex |        dob |  age | control | cont_age | cont_s~e | cont_m~d  | cont_h~t  |
      |   71-213 |  DIVIDS |    10236 |  0236 |   Male | 2007-07-15 |   15 |       . |        . |        . |        .  |        .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |  cont_art  |  cont_a~s  |  explain   |  insuli~p   |              consent_basic   |  assent   |                preg_test   |
      |         .  |         .  |      Yes   |         .   |     Consents to basic OGTT   |     Yes   |                        .   |
      |-----------------------------------------------------------------------------------+-----------+----------------------------|
      |                            preg_result  | indept~e  | indept~p  | ct_sam~e  | ct  | ivgtt_~e  | ivgtt  | uss_sa~e  |  uss  |
      |                                      .  |       No  |        .  |       No  |  .  |        0  |     .  |      Yes  |  Yes  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ever_mal |           degree_mal | clini~mo |       marital |                                          education | edu_fa~r |
      |       PM | Malnutrition Level 2 |          |             . |                                                  . |        . |
      |----------+-------------------------------------------------+---------------------------------------------------------------|
      | edu_mo~r | edu_ch~d |        employ | em~ather | em~other  | num_re~e  | re_dwelltype  | re_dwe~o  | re_ten~s  | re_ten~o  |
      |        . |        . |             . |        . |        .  |        .  |            .  |           |        .  |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                                    re_house  |  re_hou~o  |  rooms  |                                re_cook  |  re_coo~o  |
      |                                           .  |         .  |      .  |                                      .  |            |
      |----------------------------------------------------------------------------------------------------------------------------|
      |  re_fuel | re_fue~o |     re_electric | re_ele~o |             re_water | re_wat~o |                  re_toilet | re_toi~o |
      |        . |          |               . |          |                    . |          |                          . |          |
      |---------------------------------------+------------------------------------------------------------------------------------|
      | vcd |  tv | ref | wmachine | computer | stove  | radio  | phone  | cellph~e  | efan  | ac  | sewing  | cow  | pig  | goat  |
      |   . |   . |   . |        . |        . |     .  |     .  |     .  |        .  |    .  |  .  |      .  |   .  |   .  |    .  |
      |-----------------+----------+-----------------------------------------------------------------------------------------------|
      | poultr~n | bike | motorc~e | car | boat | tractor | table | chair | solar  | ses_te~1  | ses_te~2  | ses_te~3  | ses_te~4  |
      |        . |    . |        . |   . |    . |       . |     . |     . |     .  |        .  |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | ses_te~5 |     comp1  | ses_te~6  | ses_te~e  | clinic_~ry  |          pregnant  |                           preg_result1  |
      |        . |         .  |        .  |        .  | 2022-06-28  |                 .  |                                      .  |
      |----------+--------------------------------------------------+--------------------------------------------------------------|
      | suspec~v | hiv | art | art_yrs |     re_art_type | re_art~o | diab | re_dia~r | diag_d~0 | diag_d~1 | diag_d~2 | diag_d~3  |
      |       No |   . |   . |         |               . |          |   No |          |        . |        . |        . |        .  |
      |----------+---------------------+---------------------------------------------------------+---------------------------------|
      | diag_d~4 | diag_d~9 | re_dia~s | re_dia~n | re_dia~1 | ~g1_spec  | re_dia~2  | r~2_spec  | re_dia~3  | r~3_spec  | diag_4  |
      |        . |        . |          |        0 |        . |           |        .  |           |        .  |           |      .  |
      |----------+----------+----------+----------+----------+---------------------------------------------------------------------|
      | diag4_~c | re_lun~1 | re_con~1 | re_con~c | peptic~1 | liver_~1 | kidney~1  | cancer1  | lung_d~2  | re_lun~2  | contis~2  |
      |        . |        . |        . |          |        . |        . |        .  |       .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+--------------------------------------------+-----------+-----------+-----------|
      | c~2_spec | peptic~2 | liver_~2 | kidney~2 | cancer2 | lung_d~3 | contis~3  | c~3_spec  | peptic~3  | liver_~3  | kidney~3  |
      |        . |        . |        . |        . |       . |        . |        .  |        .  |        .  |        .  |        .  |
      |-----------------------------------------------------+----------+-----------------------------------------------------------|
      | cancer3 | lung_d~4 | contis~4 | c~4_spec | peptic~4 | liver_~4 | kidney~4 | cancer4 | hosp_f~q | hosp_d~g | hosp_d~s | med |
      |       . |        . |        . |        . |        . |        . |        . |       . |        . |        . |          |   . |
      |----------------------------------------------------------------------------------------------------------------------------|
      | med_ty~1 | med_ty~2 | med_ty~3 | med_ty~4 | med_ty~5  | med_ty~9  | re_med~s  | thirst  | polyuria  | fatigue  | polydi~a  |
      |        0 |        0 |        0 |        0 |        0  |        .  |           |     No  |       No  |      No  |       No  |
      |----------+----------+----------+----------+--------------------------------------------------------------------+-----------|
      | blurre~n | numbness | other~s1 | other~s2 | other~s3 | other~s4 | other~s5 | other~s6  | other~s7  | other~s8  | other~s9  |
      |       No |       No |        0 |        0 |        0 |        0 |        0 |        0  |        0  |        0  |        0  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | other~10 | other~11 | other~12 | other~13 | other~14 | other~15 | other~16 | other~17  | other~18  | other~99  | re_sym~s  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        0  |        1  |        .  |           |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | med_ex~1 | med_ex~2  | med_ex~3  | med_ex~4  | med_ex~5  | med_ex~6  | med_ex~7  | med_ex~8  | med_e~99  |   clin_summary  |
      |        0 |        0  |        0  |        0  |        0  |        0  |        0  |        1  |        .  | Generally well  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |           exam_by | sig_exam |                           sig_exam_upload  | metfor~n  | insulin  | flag_m~n  | clinic_~tt  |
      | Dr. Sushila Dhaon |          |           Dr. Sushila Dhaon_Signature.jpg  |        .  |       .  |        0  | 2022-06-28  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                                                      sample_gp  |    standard_ogtt  |                fasting  |  ogtt_u~t  |
      |     SAM Lusaka, DIVIDS, adults who want only 3-time point OGTT  |                .  |  Nothing or only water  |     mg/dL  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ogtt_t..  | time0_w  |            time0_x  |            time0_y  |  time0_z  |             time0_a  |             time0_b  |
      | 09:20:00  |   10236  |              10236  |                     |        .  |                      |                      |
      |----------------------------------------------------------------------------------------------------------------------------|
      |            time0_c | time0_e | time0_f | time0_g | time0_h | time0_j | time0_k | ogtt_s~m | ogtt_~a0 | ogtt_~o0 | ~a0_cold |
      |                    |         |         |         |         |         |         |      Yes |      Yes |        . |        . |
      |----------------------------------------+-----------------------------------------------------------------------------------|
      |     ogtt_comment_time0 | hba1c | glu0  | mmol_~u0  | out_glu0  | glu0_m~g  | glu0_m~y  | cpept~e0  | mul_c~e0  | ngml_~e0  |
      |                        |   5.8 |   95  |     5.28  |        0  |       No  |           |     1.26  |       70  |     1.26  |
      |------------------------+---------------------------------------------------+-----------------------+-----------------------|
      | pmol_~e0  |  insulin0  |  i~n0_mul  |  ~n0_pmol  |  ogtt_t..  |  time15_z  |             time15_a  |             time15_b  |
      |      420  |      7.99  |      7.99  |     47.94  |            |         .  |                       |                       |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      |            time15_c | ogtt~a15 | ogtt_c.. | glu15  | mmol_~15  | out_g~15  | glu15_~g  | glu15_~y  | cpept~15  | mul_c~15  |
      |                     |        . |          |     .  |        .  |        0  |        .  |           |        .  |        .  |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      | ngml_~15  |  pmol_~15  |  insul~15  |  i~15_mul  |  ogtt_t..  |  time30_z  |             time30_a  |             time30_b  |
      |        .  |         .  |         .  |         .  |            |         .  |                       |                       |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      |            time30_c | time30_e | time30_f | time30_g | time30_h | time30_j | time30_k  | ogtt_s..  | ogtt~o30  | ~30_cold  |
      |                     |          |          |          |          |          |           |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ogtt_c.. | glu30 | mmol_~30 | out_g~30 | glu30_~g  | glu30_~y  | cpept~30  | mul_c~30  | ngml_~30  | pmol_~30  | insul~30  |
      |          |     . |        . |        0 |        .  |           |        .  |        .  |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------+-----------+-----------|
      | i~30_mul | ogtt_t.. | time45_z |            time45_a |            time45_b  |            time45_c  | ogtt~a45  | ogtt_c..  |
      |        . |          |        . |                     |                      |                      |        .  |           |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | glu45 | mmol_~45 | out_g~45 | glu45_~g | glu45_~y  | cpept~45  | mul_c~45  | ngml_~45  | pmol_~45  | insul~45  | i~45_mul  |
      |     . |        . |        0 |        . |           |        .  |        .  |        .  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------------------+-----------+-----------+-----------|
      | ogtt_t.. | time60_z |            time60_a |            time60_b |            time60_c  | time60_e  | time60_f  | time60_g  |
      |    10:20 |        . |                     |                     |                      |           |           |           |
      |----------+----------+---------------------+--------------------------------------------+-----------+-----------+-----------|
      | time60_h | time60_j | time60_k | ogtt~a60 | ogtt~o60  | ~60_cold  | ogtt_c..  | glu60  | mmol_~60  | out_g~60  | glu60_~g  |
      |          |          |          |      Yes |        .  |        .  |           |   104  |     5.78  |        0  |       No  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | glu60_~y  | cpept~60  | mul_c~60  | ngml_~60  | pmol_~60  |  insul~60  |  i~60_mul  |  ~60_pmol  |  ogtt_t..  |  time90_z  |
      |           |     3.71  | 206.1111  |     3.71  | 1236.667  |     36.16  |     36.16  |    216.96  |            |         .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |            time90_a |            time90_b |            time90_c | time90_e | time90_f  | time90_g  | time90_h  | time90_j  |
      |                     |                     |                     |          |           |           |           |           |
      |---------------------+---------------------+--------------------------------+-----------+-----------+-----------+-----------|
      | time90_k | ogtt~a90 | ogtt~o90 | ~90_cold | ogtt_c..  | glu90  | mmol_~90  | out_g~90  | glu90_~g  | glu90_~y  | cpept~90  |
      |          |        . |        . |        . |           |     .  |        .  |        0  |        .  |           |        .  |
      |----------+----------+----------+----------+--------------------------------+-----------------------+-----------------------|
      | mul_c~90 | ngml_~90 | pmol_~90 | insul~90 | i~90_mul | ogtt_t.. | time12~z |            time120_a  |            time120_b  |
      |        . |        . |        . |        . |        . |    11:20 |        . |                       |                       |
      |----------------------------------------------------------------------------------------------------+-----------------------|
      |            time120_c | time12~e | time12~f | time12~g | time12~h | time12~j | time12~k | ogtt_s..  | ogt~o120  | ~20_cold  |
      |                      |          |          |          |          |          |          |      Yes  |        .  |        .  |
      |----------------------------------------------------------------------------------------+-----------+-----------+-----------|
      | ogtt_c.. | glu120 | mmol_g.. | out_~120 | glu120~g | glu120~y  | cpep~120  | mul_~120  | ngml~120  | pmol~120  | insu~120  |
      |          |    115 |     6.39 |        0 |       No |           |     4.14  |      230  |     4.14  |     1380  |    45.82  |
      |----------+-----------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | i~20_mul | ~20_pmol | high_h~1 | high_g~1 | repeat~d | repeat~e  | thawed  | pmh_diab  |   homair  | homair~1  | homabeta  |
      |    45.82 |   274.92 |        0 |        0 |       No |           |     No  |       No  | 1.874987  | 16.42667  | 89.77527  |
      |----------+----------+----------+----------+----------+---------------------+-----------+-----------+-----------+-----------|
      | homabe~p | flag_f~5 | gluc_~ol | gluc_~dl | in~n_mul | Matsud~x | glu0_m~l | glu60_~l  | insuli~x  | flag_p~I  | glu30_~l  |
      | .1911236 |        0 | 5.816667 |    104.7 |    29.99 | 6.476074 |    95.04 |   104.04  |     3.13  |        0  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------+-----------|
      | ogttr_~m | rogtt_~t | ~r_time0  | ogt~e0_1  | ogttr_~a  | ~s_time0  | rglu0  | rglu0_~g  | rglu0_~y  | rhba1c  | ogttr_..  |
      |        . |        . |           |           |        .  |           |     .  |        .  |        .  |      .  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | ogt~30_1 | ogttr_.. | ogttr_.. | rglu30 | rglu30~g  | rglu30~y  | ogttr_..  | ogt~20_1  | ogttr_..  | ogttr_..  | rglu120  |
      |        . |        . |        . |      . |        .  |        .  |           |           |        .  |           |       .  |
      |----------+----------+----------+--------------------------------+-----------+-----------+-----------+----------------------|
      | rglu12~g | rglu12~y | mmol_r~0 | high_g~2 | dia_re~l | glu_co~t | total_~o  | total_~b  | total_~c  | ldl_cho  | ldl_ch~b  |
      |        . |        . |        . |        0 |        . |          |      127  |       No  |           |      72  |       No  |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | ldl_ch~c | hdl_cho | hdl_ch~b | hdl_ch~c | trig | trig_p~b | trig_p~c | lipid_~t  |   hgb  | hgb_prob  | hgb_pr~c  |  rbc  |
      |          |      42 |       No |          | 79.0 |       No |          |    mg/dL  | 13.80  |       No  |        .  | 4.55  |
      |----------+--------------------------------------+----------+----------+-----------+----------------------------------------|
      | rbc_prob | rbc_pr~c | wbc | wbc_prob | wbc_pr~c | platelet | platel~b | platel~c  | lipase  | lipase~b  | lipase~c  | crp  |
      |       No |        . | 5.9 |       No |        . |      112 |       No |        .  |     67  |       No  |        .  |  .5  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | crp_prob | crp_pr~c | mgl_crp | mgl_cy~n | ul_amylp | clini~ro | systol~1  | systol~2  | systol~3  | systolic  | diasto~1  |
      |       No |        . |      .5 |        . |        . |          |        .  |        .  |        .  |        .  |        .  |
      |----------+----------+--------------------+---------------------------------------------------------------------------------|
      | diasto~2 | diasto~3 | diasto~c | weight1 | weight2 | weight3 | weight | height1 | height2 | height3  | sit_ht1  | sit_ht2  |
      |        . |        . |        . |       . |       . |       . |      . |       . |       . |       .  |       .  |       .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | sit_ht3 | sit_box | tibia1 | tibia2 | tibia3 | tibia | grip_d~d | grip_~r1 | grip_~r2  | grip_~r3  | min_gr~r  | grip_u~r  |
      |       . |       . |      . |      . |      . |     . |        . |        . |        .  |        .  |        .  |        .  |
      |------------------------------------------------------+----------+----------------------------------------------------------|
      | grip_~l1 | grip_~l2 | grip_~l3 | min_gr~l | max_gr~l | max_gr~r | max_grip  | grip_u~l  | muac1  | muac2  | muac3  | muac  |
      |        . |        . |        . |        . |        . |        . |        .  |        .  |     .  |     .  |     .  |    .  |
      |-----------------------------------------------------------------+-----------+-----------+----------------------------------|
      | waist1 | waist2 | waist3 | waist | hip1  | hip2  | hip3  | hip  | triceps1  | triceps2  | triceps3  | triceps  | subscap1  |
      |      . |      . |      . |     . |    .  |    .  |    .  |   .  |        .  |        .  |        .  |       .  |        .  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      | subscap2 | subscap3 | subscap |                                 anthro_prob  | menstr~e  | menst_~h  | tanner  | tanner~d  |
      |        . |        . |       . |                                              |        .  |           |      .  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | adj_he~1 | adj_he~2 | adj_he~3 | height | adj_si~1 | adj_si~2 | adj_si~3 | si~1_adj | si~2_adj | si~3_adj | sit_ht  | bmi  |
      |        . |        . |        . |      . |        . |        . |        . |        . |        . |        . |      .  |   .  |
      |----------------------------------------------------+-----------------------------------------------------------------------|
      | haz | bmiz | bmi_ca~d | bmi_cat | clinic_~dy | bia | fm_kg | fm_per | ffm_kg | ffm_per | fmi | ffmi | impeda~e | bia_prob  |
      |   . |    . |        . |       . |            |   . |     . |      . |      . |       . |   . |    . |        . |        .  |
      |----------------------------------------------------+-----------------------------------+-----------------------+-----------|
      | bia_co~t | adp | adpfm_kg  | adpffm~g  | adpfm_~r  | adpffm~r  | adp_prob  | adp_co~t  | redcap~p  | perso~10  | times~10  |
      |          |   . |        .  |        .  |        .  |        .  |        .  |           |  1divids  |           |           |
      |----------+-----------------------------------------------------------------------------+-----------+-----------+-----------|
      | clinic~l | refer_~n | radiol~r | radiol~s | elasta~l  | fecal_~t  | elasta~r  | refer  | refer_..  | refer_..  | refer_..  |
      |          |        . |        . |          |        .  |        .  |        .  |     .  |        0  |        0  |        0  |
      |----------+----------+----------+----------+--------------------------------------------+-----------+-----------+-----------|
      | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_..  | refer_~o  | refer_~i  | refer~ss  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        .  |           |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_..  | refer_..  | refer_..  | refer_..  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        0  |        0  |        0  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | refer~rs | refer~e1 | refer~e2 | refer~e3 | refer~e4 | refer~e7 | refer~e8 | refer~e9  | refe~e10  | refer~e5  | refer~e6  |
      |          |          |          |          |        . |        . |          |           |        .  |           |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      | clinic_d~s  | urine  | urine_co~t  | urine_~e  |       urine_ali_q  |       urine_ali_r  | u_coll~t  | u_leucs  |  u_gluc  |
      |          .  |     .  |             |           |                    |                    |        .  |       .  |       .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | u_ketone | u_prot | u_nitr~e | u_blood | urine_~m |                 feces | feces_c~dt | feces~me  | feces_~s  | feces~_t  |
      |        . |      . |        . |       . |          |                     . |            |           |           |           |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | feces_~u | feces_~p | feces~te | feces~de | feces~ct | fecal_~e | fecal_~o |                                feces_problem  |
      |          |        . |          |        . |        . |        . |        . |                                               |
      |----------------------------------------------------------------------------------------------------------------------------|
      | clinic_~et | re_cit~s | re_ber~s | re_ban~s | re_app~s | re_pin~s |                                   re_mango | re_melon  |
      |            |        . |        . |        . |        . |        . |                                          . |        .  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      | re_dry~t |                                  re_tomato | re_pep~r | re_ora~g |      re_green_leafy  | re_cru~s  | re_gourd  |
      |        . |                                          . |        . |        . |                   .  |        .  |        .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | legumes | nuts_s~s |            red_meat | poultry | processed_meat | organ_~t |           fish | seafood |           eggs |
      |       . |        . |                   . |       . |              . |        . |              . |       . |              . |
      |---------------------------------------------------------------------+----------+-------------------------------------------|
      |  milk |            milk_tea | yogurt | yogurt~t | yogurt~k | cheese | icecream | dairy_~h  | fruit_~e  |  soda  | alcohol  |
      |     . |                   . |      . |        . |        . |      . |        . |        .  |        .  |     .  |       .  |
      |-------+------------------------------+--------------------------------------------------------------------------+----------|
      | fries | fried_~t | crisps | crackers | samosas | pizza_~r | savour~h |  cake |        cookies | pudding | candy | street~d |
      |     . |        . |      . |        . |       . |        . |        . |     . |              . |       . |     . |        . |
      |------------------------------------------------------------------------------+---------------------------------------------|
      | fast_f~d | alcoho~t | re_leg~s | radio_~m | date_exa~s | time_e~s | pan_si~l | pan_he~s | pan_he~p | pan_bo~s  | pan_ta~s  |
      |        . |        . |        . |      Yes | 2022-06-28 |    11:02 |   Normal |     1.66 |     2.73 |     1.64  |     1.66  |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | pan_sh~e  | pan_sh~m  | pan_sh~y  |   pan_contour  | pan_co~m  | pan_co~y  | pan_pa~a  | pan_pa~m  | pa~rosis  | pa~tosis  |
      |   Normal  |        .  |           | Normal/Smooth  |        .  |           |   Normal  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | pan_duct | pan_d~es | pan_d~ss | pan_ca~i | pan_ca~e | pan_cy~s | pan_ot~l | pan_ot~y  | image_~s  | image_~l  | image_~y  |
      |   Normal |        . |        . |   Absent |        . |          |       No |           |  Optimal  |        .  |           |
      |---------------------+------------------------------------------------------------------------------------------------------|
      |       name_radio    |                       sig_radio    |             sig_uss_upload    |                     file_uss    |
      |   Dr. Nitin Sood    |                                    |    Dr Nitins signature.jpg    |    202206281102330013ABD.DCM    |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                  file_uss2   |                  file_uss3   |                  file_uss4   |                   file_uss5   |
      |  202206281102450014ABD.DCM   |  202206281102560015ABD.DCM   |  202206281103060016ABD.DCM   |   202206281103160017ABD.DCM   |
      |------------------------------+------------------------------+------------------------------+-------------------------------|
      |                  file_uss6   |                  file_uss7   |                  file_uss8   |                   file_uss9   |
      |  202206281103220018ABD.DCM   |  202206281103310019ABD.DCM   |  202206281103440020ABD.DCM   |   202206281103540021ABD.DCM   |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                file_uss10 | hepato~y | spleno~y | cholel~s | steato~s | mass | gyneco~c | athero~s | nephro~s  | pancre~c  |
      | 202206281104210022ABD.DCM |        0 |        0 |        0 |        0 |    0 |        0 |        0 |        0  |        0  |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | ct_scan | ct_date | ct_time | ct_p~ual | ct_pan..  | ct_pan~p  | ct_pan..  | c~tail~s  | ct_pa~il  | ct_pan~y  | ct_pan~d  |
      |      No |         |         |        . |        .  |        .  |        .  |        .  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ct_pa~pe | ct_pan.. | ct_pan.. | ct_pan~r | ct_pan.. | ct_pan.. | ct_pan~a | ct_pa~am  | ct~rosis  | ct~tosis  | ct_pan~t  |
      |        . |        . |          |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+--------------------------------------------------------------------------------|
      | ct_pa~es | ct_pa~ss | ct_pan~i | ct_pa~ce | ct_p~mal  | c~n_spec  | ct_ima~l  | ct_pro~m  | ct_pro~y  | name_ct  | sig_ct  |
      |        . |        . |        . |        . |        .  |           |        .  |        .  |           |          |         |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | sig_ct~d | file_ct | file_ct2 | file_ct3 | file_ct4 | file_ct5 | file_ct6  | file_ct7  | file_ct8  | file_ct9  | file_c~0  |
      |          |         |          |          |          |          |           |           |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | r2_pan.. | r2_pan~p | r2_pan.. | r2_pan.. | r2_pa~il | r2_pan~y | r2_pan~d | r2_rem~s  | r2_pan..  | r2_pan..  | r2_pan..  |
      |        . |        . |        . |        . |        . |        . |        . |           |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | r2_pan.. | r2_pan.. | r2_pan.. | r2_pan.. | r2_rem~a | r3_pan.. | r3_pan~p | r3_pan..  | r3_pan..  | r3_pa~il  | r3_pan~y  |
      |        . |        . |        . |        . |          |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | r3_pan~d | r3_rem~s | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan..  | r3_pan..  | r3_rem~a  | i~e_ne10  |
      |        . |          |        . |        . |        . |        . |        . |        .  |        .  |        .  |           |
      |----------+----------+----------+----------+--------------------------------------------------------------------------------|
      | iv~e_ne1 | ivgt~e_2 | ivgt~e_4 | ivgt~e_6 | ivgt~e_8  | ivg~e_10  | i~t_ne10  | iv~t_ne1  | ivgtt_2  | ivgtt_4  | ivgtt_6  |
      |          |          |          |          |           |           |        .  |        .  |       .  |       .  |       .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ivgtt_8 | ivgtt_10 | iv~e10_l | iv~e10_m | iv~e10_n | iv~e10_p | ivti~1_l  | ivti~1_m  | ivti~1_n  | ivti~1_p  | ivti~2_l  |
      |       . |        . |          |          |          |          |           |           |           |           |           |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ivti~2_m | ivti~2_n | ivti~2_p | ivti~4_l | ivti~4_m | ivti~4_n | ivti~4_p | ivti~6_l  | ivti~6_m  | ivti~6_n  | ivti~6_p  |
      |          |          |          |          |          |          |          |           |           |           |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ivti~8_l  | ivti~8_m  | ivti~8_n  | ivti~8_p  | iv~_10_l  |  iv~_10_m  |  iv~_10_n  |  iv~_10_p  |  temp_o~d  |  flag_f~e  |
      |           |           |           |           |           |            |            |            |         .  |         .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |          _merge | recrui~d | ass~tase  | ass~pase  | radio2  | ct2  | radio_~s  | radio_~l  | radio3  | subset  | subset2  |
      | Master only (1) |        1 |        0  |        1  |    Yes  |  No  |        0  |       12  |    Yes  |      1  |       1  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | epi_bi~y | epi_or~l | child | africa  |          exposuretime  | fec_co~t  | ct_pa~ol  | r2_pa~ol  | r3_pa~ol  | r2_pan..  |
      |        . |        . | Child |   Asia  | Exposure in Childhood  |   DIVIDS  |        .  |        .  |        .  |        .  |
      |----------+----------+------------------------------------------+-----------+-----------+-----------+-----------+-----------|
      | r3_pan.. |       xb | hiv2 | _est_m~1  | _est_m~2  | _est_m~3  | _est_m~4  | _est_m~5  | _est_~5a  | _est_~5b  | _est_~5c  |
      |        . |        . |    0 |        0  |        0  |        0  |        0  |        0  |        0  |        0  |        0  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      |       pc1 |       pc2 | pc_f~1_c1 | pc_f~2_c1 | pc~il1_c1  | pc~il2_c1  | pc_~r1_c1  | pc_~r2_c1  | st~ll1_c1  | s~ll2_c1  |
      |  1.414732 |   .627571 |  1.856186 |  1.346222 |  1.805653  |  1.260221  |  2.086195  |  1.302347  |  1.333476  | 1.473438  |
      |-----------+-----------+-----------+-----------+----------------------------------------------------------------------------|
      | st~il1_c1 | st~il2_c1 | std~r1_c1 | std~r2_c1 | p~ll1_c2 | p~ll2_c2 | p~il1_c2 | p~il2_c2 | pc~r1_c2 | pc~r2_c2 | s~ll1_c2 |
      |  1.433286 |  1.383612 |  1.647169 |  1.429523 |        . |        . |        . |        . |        . |        . |        . |
      |----------------------------------------------------------------------------------------------------------------------------|
      | s~ll2_c2 | s~il1_c2 | s~il2_c2 | st~r1_c2 | st~r2_c2 | p~ll1_c3 | p~ll2_c3 | p~il1_c3  | p~il2_c3  | pc~r1_c3  | pc~r2_c3  |
      |        . |        . |        . |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------------------+-----------+-----------------------|
      | s~ll1_c3 | s~ll2_c3 | s~il1_c3 | s~il2_c3 | st~r1_c3 | st~r2_c3 | pc_f~1_c4 | p~ll2_c4 | pc~il1_c4 | p~il2_c4 | pc_~r1_c4  |
      |        . |        . |        . |        . |        . |        . |         . |        . |         . |        . |         .  |
      |----------+-----------------------------------------------------------------------------------------+-----------------------|
      | pc~r2_c4 | st~ll1_c4 | s~ll2_c4 | st~il1_c4 | s~il2_c4 | st~r1_c4 | st~r2_c4 | p~ll1_c5 | p~ll2_c5 | p~il1_c5  | p~il2_c5  |
      |        . |         . |        . |         . |        . |        . |        . |        . |        . |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------+-----------+-----------|
      | pc~r1_c5 | pc~r2_c5 | s~ll1_c5 | s~ll2_c5 | s~il1_c5 | s~il2_c5 | st~r1_c5 | st~r2_c5  | p~ll1_c6  | p~ll2_c6  | p~il1_c6  |
      |        . |        . |        . |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------------------------------+-----------|
      | p~il2_c6 | pc~r1_c6 | pc~r2_c6 | s~ll1_c6 | s~ll2_c6 | s~il1_c6 | s~il2_c6 | st~r1_c6 | st~r2_c6  | pc1_com~d  | pc2_co~d  |
      |        . |        . |        . |        . |        . |        . |        . |        . |        .  |  1.333476  | 1.473438  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |           adjp~pwt           |           adjpan..           |           a~body~t           |           a~tail~t            |
      |                  .           |                  .           |                  .           |                  .            |
      +----------------------------------------------------------------------------------------------------------------------------+

      +----------------------------------------------------------------------------------------------------------------------------+
  66. | record~d |  cohort | sampa_id | orgid |    sex |        dob |  age | control | cont_age | cont_s~e | cont_m~d  | cont_h~t  |
      |   71-225 |  DIVIDS |    10574 |  0574 |   Male | 2007-11-29 | 14.6 |       . |        . |        . |        .  |        .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |  cont_art  |  cont_a~s  |  explain   |  insuli~p   |              consent_basic   |  assent   |                preg_test   |
      |         .  |         .  |      Yes   |         .   |     Consents to basic OGTT   |     Yes   |                        .   |
      |-----------------------------------------------------------------------------------+-----------+----------------------------|
      |                            preg_result  | indept~e  | indept~p  | ct_sam~e  | ct  | ivgtt_~e  | ivgtt  | uss_sa~e  |  uss  |
      |                                      .  |       No  |        .  |       No  |  .  |        0  |     .  |      Yes  |  Yes  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ever_mal |           degree_mal | clini~mo |       marital |                                          education | edu_fa~r |
      |       PM |        Normal weight |          |             . |                                                  . |        . |
      |----------+-------------------------------------------------+---------------------------------------------------------------|
      | edu_mo~r | edu_ch~d |        employ | em~ather | em~other  | num_re~e  | re_dwelltype  | re_dwe~o  | re_ten~s  | re_ten~o  |
      |        . |        . |             . |        . |        .  |        .  |            .  |           |        .  |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                                    re_house  |  re_hou~o  |  rooms  |                                re_cook  |  re_coo~o  |
      |                                           .  |         .  |      .  |                                      .  |            |
      |----------------------------------------------------------------------------------------------------------------------------|
      |  re_fuel | re_fue~o |     re_electric | re_ele~o |             re_water | re_wat~o |                  re_toilet | re_toi~o |
      |        . |          |               . |          |                    . |          |                          . |          |
      |---------------------------------------+------------------------------------------------------------------------------------|
      | vcd |  tv | ref | wmachine | computer | stove  | radio  | phone  | cellph~e  | efan  | ac  | sewing  | cow  | pig  | goat  |
      |   . |   . |   . |        . |        . |     .  |     .  |     .  |        .  |    .  |  .  |      .  |   .  |   .  |    .  |
      |-----------------+----------+-----------------------------------------------------------------------------------------------|
      | poultr~n | bike | motorc~e | car | boat | tractor | table | chair | solar  | ses_te~1  | ses_te~2  | ses_te~3  | ses_te~4  |
      |        . |    . |        . |   . |    . |       . |     . |     . |     .  |        .  |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | ses_te~5 |     comp1  | ses_te~6  | ses_te~e  | clinic_~ry  |          pregnant  |                           preg_result1  |
      |        . |         .  |        .  |        .  |             |                 .  |                                      .  |
      |----------+--------------------------------------------------+--------------------------------------------------------------|
      | suspec~v | hiv | art | art_yrs |     re_art_type | re_art~o | diab | re_dia~r | diag_d~0 | diag_d~1 | diag_d~2 | diag_d~3  |
      |        . |   . |   . |         |               . |          |   No |          |        . |        . |        . |        .  |
      |----------+---------------------+---------------------------------------------------------+---------------------------------|
      | diag_d~4 | diag_d~9 | re_dia~s | re_dia~n | re_dia~1 | ~g1_spec  | re_dia~2  | r~2_spec  | re_dia~3  | r~3_spec  | diag_4  |
      |        . |        . |          |        . |        . |           |        .  |           |        .  |           |      .  |
      |----------+----------+----------+----------+----------+---------------------------------------------------------------------|
      | diag4_~c | re_lun~1 | re_con~1 | re_con~c | peptic~1 | liver_~1 | kidney~1  | cancer1  | lung_d~2  | re_lun~2  | contis~2  |
      |        . |        . |        . |          |        . |        . |        .  |       .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+--------------------------------------------+-----------+-----------+-----------|
      | c~2_spec | peptic~2 | liver_~2 | kidney~2 | cancer2 | lung_d~3 | contis~3  | c~3_spec  | peptic~3  | liver_~3  | kidney~3  |
      |        . |        . |        . |        . |       . |        . |        .  |        .  |        .  |        .  |        .  |
      |-----------------------------------------------------+----------+-----------------------------------------------------------|
      | cancer3 | lung_d~4 | contis~4 | c~4_spec | peptic~4 | liver_~4 | kidney~4 | cancer4 | hosp_f~q | hosp_d~g | hosp_d~s | med |
      |       . |        . |        . |        . |        . |        . |        . |       . |        . |        . |          |   . |
      |----------------------------------------------------------------------------------------------------------------------------|
      | med_ty~1 | med_ty~2 | med_ty~3 | med_ty~4 | med_ty~5  | med_ty~9  | re_med~s  | thirst  | polyuria  | fatigue  | polydi~a  |
      |        0 |        0 |        0 |        0 |        0  |        .  |           |      .  |        .  |       .  |        .  |
      |----------+----------+----------+----------+--------------------------------------------------------------------+-----------|
      | blurre~n | numbness | other~s1 | other~s2 | other~s3 | other~s4 | other~s5 | other~s6  | other~s7  | other~s8  | other~s9  |
      |        . |        . |        0 |        0 |        0 |        0 |        0 |        0  |        0  |        0  |        0  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | other~10 | other~11 | other~12 | other~13 | other~14 | other~15 | other~16 | other~17  | other~18  | other~99  | re_sym~s  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        0  |        0  |        .  |           |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | med_ex~1 | med_ex~2  | med_ex~3  | med_ex~4  | med_ex~5  | med_ex~6  | med_ex~7  | med_ex~8  | med_e~99  |   clin_summary  |
      |        0 |        0  |        0  |        0  |        0  |        0  |        0  |        0  |        .  |              .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |           exam_by | sig_exam |                           sig_exam_upload  | metfor~n  | insulin  | flag_m~n  | clinic_~tt  |
      |                   |          |                                            |        .  |       .  |        0  | 2022-07-04  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                                                      sample_gp  |    standard_ogtt  |                fasting  |  ogtt_u~t  |
      |     SAM Lusaka, DIVIDS, adults who want only 3-time point OGTT  |                .  |  Nothing or only water  |     mg/dL  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ogtt_t..  | time0_w  |            time0_x  |            time0_y  |  time0_z  |             time0_a  |             time0_b  |
      | 11:10:00  |   10574  |              10574  |                     |        .  |                      |                      |
      |----------------------------------------------------------------------------------------------------------------------------|
      |            time0_c | time0_e | time0_f | time0_g | time0_h | time0_j | time0_k | ogtt_s~m | ogtt_~a0 | ogtt_~o0 | ~a0_cold |
      |                    |         |         |         |         |         |         |      Yes |      Yes |        . |        . |
      |----------------------------------------+-----------------------------------------------------------------------------------|
      |     ogtt_comment_time0 | hba1c | glu0  | mmol_~u0  | out_glu0  | glu0_m~g  | glu0_m~y  | cpept~e0  | mul_c~e0  | ngml_~e0  |
      |                        |   5.3 |   86  |     4.78  |        0  |       No  |           |     1.27  | 70.55555  |     1.27  |
      |------------------------+---------------------------------------------------+-----------------------+-----------------------|
      | pmol_~e0  |  insulin0  |  i~n0_mul  |  ~n0_pmol  |  ogtt_t..  |  time15_z  |             time15_a  |             time15_b  |
      | 423.3333  |     12.38  |     12.38  |     74.28  |            |         .  |                       |                       |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      |            time15_c | ogtt~a15 | ogtt_c.. | glu15  | mmol_~15  | out_g~15  | glu15_~g  | glu15_~y  | cpept~15  | mul_c~15  |
      |                     |        . |          |     .  |        .  |        0  |        .  |           |        .  |        .  |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      | ngml_~15  |  pmol_~15  |  insul~15  |  i~15_mul  |  ogtt_t..  |  time30_z  |             time30_a  |             time30_b  |
      |        .  |         .  |         .  |         .  |            |         .  |                       |                       |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      |            time30_c | time30_e | time30_f | time30_g | time30_h | time30_j | time30_k  | ogtt_s..  | ogtt~o30  | ~30_cold  |
      |                     |          |          |          |          |          |           |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ogtt_c.. | glu30 | mmol_~30 | out_g~30 | glu30_~g  | glu30_~y  | cpept~30  | mul_c~30  | ngml_~30  | pmol_~30  | insul~30  |
      |          |     . |        . |        0 |        .  |           |        .  |        .  |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------+-----------+-----------|
      | i~30_mul | ogtt_t.. | time45_z |            time45_a |            time45_b  |            time45_c  | ogtt~a45  | ogtt_c..  |
      |        . |          |        . |                     |                      |                      |        .  |           |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | glu45 | mmol_~45 | out_g~45 | glu45_~g | glu45_~y  | cpept~45  | mul_c~45  | ngml_~45  | pmol_~45  | insul~45  | i~45_mul  |
      |     . |        . |        0 |        . |           |        .  |        .  |        .  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------------------+-----------+-----------+-----------|
      | ogtt_t.. | time60_z |            time60_a |            time60_b |            time60_c  | time60_e  | time60_f  | time60_g  |
      |    12:30 |        . |                     |                     |                      |           |           |           |
      |----------+----------+---------------------+--------------------------------------------+-----------+-----------+-----------|
      | time60_h | time60_j | time60_k | ogtt~a60 | ogtt~o60  | ~60_cold  | ogtt_c..  | glu60  | mmol_~60  | out_g~60  | glu60_~g  |
      |          |          |          |      Yes |        .  |        .  |           |    95  |     5.28  |        0  |       No  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | glu60_~y  | cpept~60  | mul_c~60  | ngml_~60  | pmol_~60  |  insul~60  |  i~60_mul  |  ~60_pmol  |  ogtt_t..  |  time90_z  |
      |           |     4.72  | 262.2222  |     4.72  | 1573.333  |     68.25  |     68.25  |     409.5  |            |         .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |            time90_a |            time90_b |            time90_c | time90_e | time90_f  | time90_g  | time90_h  | time90_j  |
      |                     |                     |                     |          |           |           |           |           |
      |---------------------+---------------------+--------------------------------+-----------+-----------+-----------+-----------|
      | time90_k | ogtt~a90 | ogtt~o90 | ~90_cold | ogtt_c..  | glu90  | mmol_~90  | out_g~90  | glu90_~g  | glu90_~y  | cpept~90  |
      |          |        . |        . |        . |           |     .  |        .  |        0  |        .  |           |        .  |
      |----------+----------+----------+----------+--------------------------------+-----------------------+-----------------------|
      | mul_c~90 | ngml_~90 | pmol_~90 | insul~90 | i~90_mul | ogtt_t.. | time12~z |            time120_a  |            time120_b  |
      |        . |        . |        . |        . |        . |    13:30 |        . |                       |                       |
      |----------------------------------------------------------------------------------------------------+-----------------------|
      |            time120_c | time12~e | time12~f | time12~g | time12~h | time12~j | time12~k | ogtt_s..  | ogt~o120  | ~20_cold  |
      |                      |          |          |          |          |          |          |      Yes  |        .  |        .  |
      |----------------------------------------------------------------------------------------+-----------+-----------+-----------|
      | ogtt_c.. | glu120 | mmol_g.. | out_~120 | glu120~g | glu120~y  | cpep~120  | mul_~120  | ngml~120  | pmol~120  | insu~120  |
      |          |     80 |     4.44 |        0 |       No |           |     3.18  | 176.6667  |     3.18  |     1060  |    33.15  |
      |----------+-----------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | i~20_mul | ~20_pmol | high_h~1 | high_g~1 | repeat~d | repeat~e  | thawed  | pmh_diab  |   homair  | homair~1  | homabeta  |
      |    33.15 |    198.9 |        0 |        0 |       No |           |     No  |       No  | 2.630062  | 14.98913  | 193.4375  |
      |----------+----------+----------+----------+----------+---------------------+-----------+-----------+-----------+-----------|
      | homabe~p | flag_f~5 | gluc_~ol | gluc_~dl | in~n_mul | Matsud~x | glu0_m~l | glu60_~l  | insuli~x  | flag_p~I  | glu30_~l  |
      | .2678906 |        0 | 4.833333 |       87 | 37.92667 | 5.334055 |    86.04 |    95.04  | 6.207778  |        0  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------+-----------|
      | ogttr_~m | rogtt_~t | ~r_time0  | ogt~e0_1  | ogttr_~a  | ~s_time0  | rglu0  | rglu0_~g  | rglu0_~y  | rhba1c  | ogttr_..  |
      |        . |        . |           |           |        .  |           |     .  |        .  |        .  |      .  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | ogt~30_1 | ogttr_.. | ogttr_.. | rglu30 | rglu30~g  | rglu30~y  | ogttr_..  | ogt~20_1  | ogttr_..  | ogttr_..  | rglu120  |
      |        . |        . |        . |      . |        .  |        .  |           |           |        .  |           |       .  |
      |----------+----------+----------+--------------------------------+-----------+-----------+-----------+----------------------|
      | rglu12~g | rglu12~y | mmol_r~0 | high_g~2 | dia_re~l | glu_co~t | total_~o  | total_~b  | total_~c  | ldl_cho  | ldl_ch~b  |
      |        . |        . |        . |        0 |        . |          |      123  |       No  |           |      87  |       No  |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | ldl_ch~c | hdl_cho | hdl_ch~b | hdl_ch~c | trig | trig_p~b | trig_p~c | lipid_~t  |   hgb  | hgb_prob  | hgb_pr~c  |  rbc  |
      |          |      34 |       No |          | 73.0 |       No |          |    mg/dL  | 11.60  |       No  |        .  | 4.25  |
      |----------+--------------------------------------+----------+----------+-----------+----------------------------------------|
      | rbc_prob | rbc_pr~c | wbc | wbc_prob | wbc_pr~c | platelet | platel~b | platel~c  | lipase  | lipase~b  | lipase~c  | crp  |
      |       No |        . | 5.8 |       No |        . |      247 |       No |        .  |     34  |       No  |        .  |  .5  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | crp_prob | crp_pr~c | mgl_crp | mgl_cy~n | ul_amylp | clini~ro | systol~1  | systol~2  | systol~3  | systolic  | diasto~1  |
      |       No |        . |      .5 |        . |        . |          |        .  |        .  |        .  |        .  |        .  |
      |----------+----------+--------------------+---------------------------------------------------------------------------------|
      | diasto~2 | diasto~3 | diasto~c | weight1 | weight2 | weight3 | weight | height1 | height2 | height3  | sit_ht1  | sit_ht2  |
      |        . |        . |        . |       . |       . |       . |      . |       . |       . |       .  |       .  |       .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | sit_ht3 | sit_box | tibia1 | tibia2 | tibia3 | tibia | grip_d~d | grip_~r1 | grip_~r2  | grip_~r3  | min_gr~r  | grip_u~r  |
      |       . |       . |      . |      . |      . |     . |        . |        . |        .  |        .  |        .  |        .  |
      |------------------------------------------------------+----------+----------------------------------------------------------|
      | grip_~l1 | grip_~l2 | grip_~l3 | min_gr~l | max_gr~l | max_gr~r | max_grip  | grip_u~l  | muac1  | muac2  | muac3  | muac  |
      |        . |        . |        . |        . |        . |        . |        .  |        .  |     .  |     .  |     .  |    .  |
      |-----------------------------------------------------------------+-----------+-----------+----------------------------------|
      | waist1 | waist2 | waist3 | waist | hip1  | hip2  | hip3  | hip  | triceps1  | triceps2  | triceps3  | triceps  | subscap1  |
      |      . |      . |      . |     . |    .  |    .  |    .  |   .  |        .  |        .  |        .  |       .  |        .  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      | subscap2 | subscap3 | subscap |                                 anthro_prob  | menstr~e  | menst_~h  | tanner  | tanner~d  |
      |        . |        . |       . |                                              |        .  |           |      .  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | adj_he~1 | adj_he~2 | adj_he~3 | height | adj_si~1 | adj_si~2 | adj_si~3 | si~1_adj | si~2_adj | si~3_adj | sit_ht  | bmi  |
      |        . |        . |        . |      . |        . |        . |        . |        . |        . |        . |      .  |   .  |
      |----------------------------------------------------+-----------------------------------------------------------------------|
      | haz | bmiz | bmi_ca~d | bmi_cat | clinic_~dy | bia | fm_kg | fm_per | ffm_kg | ffm_per | fmi | ffmi | impeda~e | bia_prob  |
      |   . |    . |        . |       . |            |   . |     . |      . |      . |       . |   . |    . |        . |        .  |
      |----------------------------------------------------+-----------------------------------+-----------------------+-----------|
      | bia_co~t | adp | adpfm_kg  | adpffm~g  | adpfm_~r  | adpffm~r  | adp_prob  | adp_co~t  | redcap~p  | perso~10  | times~10  |
      |          |   . |        .  |        .  |        .  |        .  |        .  |           |  1divids  |           |           |
      |----------+-----------------------------------------------------------------------------+-----------+-----------+-----------|
      | clinic~l | refer_~n | radiol~r | radiol~s | elasta~l  | fecal_~t  | elasta~r  | refer  | refer_..  | refer_..  | refer_..  |
      |          |        . |        . |          |        .  |        .  |        .  |     .  |        0  |        0  |        0  |
      |----------+----------+----------+----------+--------------------------------------------+-----------+-----------+-----------|
      | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_..  | refer_~o  | refer_~i  | refer~ss  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        .  |           |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_..  | refer_..  | refer_..  | refer_..  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        0  |        0  |        0  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | refer~rs | refer~e1 | refer~e2 | refer~e3 | refer~e4 | refer~e7 | refer~e8 | refer~e9  | refe~e10  | refer~e5  | refer~e6  |
      |          |          |          |          |        . |        . |          |           |        .  |           |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      | clinic_d~s  | urine  | urine_co~t  | urine_~e  |       urine_ali_q  |       urine_ali_r  | u_coll~t  | u_leucs  |  u_gluc  |
      | 2022-07-04  |   Yes  | 2022-07-04  |    13:45  |                    |                    |      Yes  |       0  |       0  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | u_ketone | u_prot | u_nitr~e | u_blood | urine_~m |                 feces | feces_c~dt | feces~me  | feces_~s  | feces~_t  |
      |        0 |      0 |        0 |       0 |     None | Brought one from home | 2023-01-30 | 08:15:00  |           |           |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | feces_~u | feces_~p | feces~te | feces~de | feces~ct | fecal_~e | fecal_~o |                                feces_problem  |
      |          |       No |          |        . |      Yes |        . |        . |                                               |
      |----------------------------------------------------------------------------------------------------------------------------|
      | clinic_~et | re_cit~s | re_ber~s | re_ban~s | re_app~s | re_pin~s |                                   re_mango | re_melon  |
      |            |        . |        . |        . |        . |        . |                                          . |        .  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      | re_dry~t |                                  re_tomato | re_pep~r | re_ora~g |      re_green_leafy  | re_cru~s  | re_gourd  |
      |        . |                                          . |        . |        . |                   .  |        .  |        .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | legumes | nuts_s~s |            red_meat | poultry | processed_meat | organ_~t |           fish | seafood |           eggs |
      |       . |        . |                   . |       . |              . |        . |              . |       . |              . |
      |---------------------------------------------------------------------+----------+-------------------------------------------|
      |  milk |            milk_tea | yogurt | yogurt~t | yogurt~k | cheese | icecream | dairy_~h  | fruit_~e  |  soda  | alcohol  |
      |     . |                   . |      . |        . |        . |      . |        . |        .  |        .  |     .  |       .  |
      |-------+------------------------------+--------------------------------------------------------------------------+----------|
      | fries | fried_~t | crisps | crackers | samosas | pizza_~r | savour~h |  cake |        cookies | pudding | candy | street~d |
      |     . |        . |      . |        . |       . |        . |        . |     . |              . |       . |     . |        . |
      |------------------------------------------------------------------------------+---------------------------------------------|
      | fast_f~d | alcoho~t | re_leg~s | radio_~m | date_exa~s | time_e~s | pan_si~l | pan_he~s | pan_he~p | pan_bo~s  | pan_ta~s  |
      |        . |        . |        . |      Yes | 2022-07-04 |    12:12 |   Normal |     1.55 |     2.58 |     1.48  |     1.42  |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | pan_sh~e  | pan_sh~m  | pan_sh~y  |   pan_contour  | pan_co~m  | pan_co~y  | pan_pa~a  | pan_pa~m  | pa~rosis  | pa~tosis  |
      |   Normal  |        .  |           | Normal/Smooth  |        .  |           |   Normal  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | pan_duct | pan_d~es | pan_d~ss | pan_ca~i | pan_ca~e | pan_cy~s | pan_ot~l | pan_ot~y  | image_~s  | image_~l  | image_~y  |
      |   Normal |        . |        . |   Absent |        . |          |       No |           |  Optimal  |        .  |           |
      |---------------------+------------------------------------------------------------------------------------------------------|
      |       name_radio    |                       sig_radio    |             sig_uss_upload    |                     file_uss    |
      |   Dr. Nitin Sood    |                                    |    Dr Nitins signature.jpg    |    202207041212400052ABD.DCM    |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                  file_uss2   |                  file_uss3   |                  file_uss4   |                   file_uss5   |
      |  202207041212450053ABD.DCM   |  202207041212500054ABD.DCM   |  202207041212560055ABD.DCM   |   202207041213120056ABD.DCM   |
      |------------------------------+------------------------------+------------------------------+-------------------------------|
      |                  file_uss6   |                  file_uss7   |                  file_uss8   |                   file_uss9   |
      |  202207041213160057ABD.DCM   |  202207041213200058ABD.DCM   |  202207041213450059ABD.DCM   |   202207041214330060ABD.DCM   |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                file_uss10 | hepato~y | spleno~y | cholel~s | steato~s | mass | gyneco~c | athero~s | nephro~s  | pancre~c  |
      | 202207041214410061ABD.DCM |        0 |        0 |        0 |        0 |    0 |        0 |        0 |        0  |        0  |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | ct_scan | ct_date | ct_time | ct_p~ual | ct_pan..  | ct_pan~p  | ct_pan..  | c~tail~s  | ct_pa~il  | ct_pan~y  | ct_pan~d  |
      |      No |         |         |        . |        .  |        .  |        .  |        .  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ct_pa~pe | ct_pan.. | ct_pan.. | ct_pan~r | ct_pan.. | ct_pan.. | ct_pan~a | ct_pa~am  | ct~rosis  | ct~tosis  | ct_pan~t  |
      |        . |        . |          |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+--------------------------------------------------------------------------------|
      | ct_pa~es | ct_pa~ss | ct_pan~i | ct_pa~ce | ct_p~mal  | c~n_spec  | ct_ima~l  | ct_pro~m  | ct_pro~y  | name_ct  | sig_ct  |
      |        . |        . |        . |        . |        .  |           |        .  |        .  |           |          |         |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | sig_ct~d | file_ct | file_ct2 | file_ct3 | file_ct4 | file_ct5 | file_ct6  | file_ct7  | file_ct8  | file_ct9  | file_c~0  |
      |          |         |          |          |          |          |           |           |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | r2_pan.. | r2_pan~p | r2_pan.. | r2_pan.. | r2_pa~il | r2_pan~y | r2_pan~d | r2_rem~s  | r2_pan..  | r2_pan..  | r2_pan..  |
      |        . |        . |        . |        . |        . |        . |        . |           |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | r2_pan.. | r2_pan.. | r2_pan.. | r2_pan.. | r2_rem~a | r3_pan.. | r3_pan~p | r3_pan..  | r3_pan..  | r3_pa~il  | r3_pan~y  |
      |        . |        . |        . |        . |          |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | r3_pan~d | r3_rem~s | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan..  | r3_pan..  | r3_rem~a  | i~e_ne10  |
      |        . |          |        . |        . |        . |        . |        . |        .  |        .  |        .  |           |
      |----------+----------+----------+----------+--------------------------------------------------------------------------------|
      | iv~e_ne1 | ivgt~e_2 | ivgt~e_4 | ivgt~e_6 | ivgt~e_8  | ivg~e_10  | i~t_ne10  | iv~t_ne1  | ivgtt_2  | ivgtt_4  | ivgtt_6  |
      |          |          |          |          |           |           |        .  |        .  |       .  |       .  |       .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ivgtt_8 | ivgtt_10 | iv~e10_l | iv~e10_m | iv~e10_n | iv~e10_p | ivti~1_l  | ivti~1_m  | ivti~1_n  | ivti~1_p  | ivti~2_l  |
      |       . |        . |          |          |          |          |           |           |           |           |           |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ivti~2_m | ivti~2_n | ivti~2_p | ivti~4_l | ivti~4_m | ivti~4_n | ivti~4_p | ivti~6_l  | ivti~6_m  | ivti~6_n  | ivti~6_p  |
      |          |          |          |          |          |          |          |           |           |           |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ivti~8_l  | ivti~8_m  | ivti~8_n  | ivti~8_p  | iv~_10_l  |  iv~_10_m  |  iv~_10_n  |  iv~_10_p  |  temp_o~d  |  flag_f~e  |
      |           |           |           |           |           |            |            |            |         .  |         .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |          _merge | recrui~d | ass~tase  | ass~pase  | radio2  | ct2  | radio_~s  | radio_~l  | radio3  | subset  | subset2  |
      | Master only (1) |        1 |        0  |        1  |    Yes  |  No  |        0  |       12  |    Yes  |      1  |       1  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | epi_bi~y | epi_or~l | child | africa  |          exposuretime  | fec_co~t  | ct_pa~ol  | r2_pa~ol  | r3_pa~ol  | r2_pan..  |
      |        . |        . | Child |   Asia  | Exposure in Childhood  |   DIVIDS  |        .  |        .  |        .  |        .  |
      |----------+----------+------------------------------------------+-----------+-----------+-----------+-----------+-----------|
      | r3_pan.. |       xb | hiv2 | _est_m~1  | _est_m~2  | _est_m~3  | _est_m~4  | _est_m~5  | _est_~5a  | _est_~5b  | _est_~5c  |
      |        . |        . |    0 |        0  |        0  |        0  |        0  |        0  |        0  |        0  |        0  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      |       pc1 |       pc2 | pc_f~1_c1 | pc_f~2_c1 | pc~il1_c1  | pc~il2_c1  | pc_~r1_c1  | pc_~r2_c1  | st~ll1_c1  | s~ll2_c1  |
      |    .66899 |  .3502493 |  .8080032 |  1.320527 |  1.037153  |  1.201899  |  1.048341  |  1.312498  |  .5804663  | 1.445314  |
      |-----------+-----------+-----------+-----------+----------------------------------------------------------------------------|
      | st~il1_c1 | st~il2_c1 | std~r1_c1 | std~r2_c1 | p~ll1_c2 | p~ll2_c2 | p~il1_c2 | p~il2_c2 | pc~r1_c2 | pc~r2_c2 | s~ll1_c2 |
      |   .823268 |  1.319579 |  .8277245 |  1.440666 |        . |        . |        . |        . |        . |        . |        . |
      |----------------------------------------------------------------------------------------------------------------------------|
      | s~ll2_c2 | s~il1_c2 | s~il2_c2 | st~r1_c2 | st~r2_c2 | p~ll1_c3 | p~ll2_c3 | p~il1_c3  | p~il2_c3  | pc~r1_c3  | pc~r2_c3  |
      |        . |        . |        . |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------------------+-----------+-----------------------|
      | s~ll1_c3 | s~ll2_c3 | s~il1_c3 | s~il2_c3 | st~r1_c3 | st~r2_c3 | pc_f~1_c4 | p~ll2_c4 | pc~il1_c4 | p~il2_c4 | pc_~r1_c4  |
      |        . |        . |        . |        . |        . |        . |         . |        . |         . |        . |         .  |
      |----------+-----------------------------------------------------------------------------------------+-----------------------|
      | pc~r2_c4 | st~ll1_c4 | s~ll2_c4 | st~il1_c4 | s~il2_c4 | st~r1_c4 | st~r2_c4 | p~ll1_c5 | p~ll2_c5 | p~il1_c5  | p~il2_c5  |
      |        . |         . |        . |         . |        . |        . |        . |        . |        . |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------+-----------+-----------|
      | pc~r1_c5 | pc~r2_c5 | s~ll1_c5 | s~ll2_c5 | s~il1_c5 | s~il2_c5 | st~r1_c5 | st~r2_c5  | p~ll1_c6  | p~ll2_c6  | p~il1_c6  |
      |        . |        . |        . |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------------------------------+-----------|
      | p~il2_c6 | pc~r1_c6 | pc~r2_c6 | s~ll1_c6 | s~ll2_c6 | s~il1_c6 | s~il2_c6 | st~r1_c6 | st~r2_c6  | pc1_com~d  | pc2_co~d  |
      |        . |        . |        . |        . |        . |        . |        . |        . |        .  |  .5804663  | 1.445314  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |           adjp~pwt           |           adjpan..           |           a~body~t           |           a~tail~t            |
      |                  .           |                  .           |                  .           |                  .            |
      +----------------------------------------------------------------------------------------------------------------------------+

      +----------------------------------------------------------------------------------------------------------------------------+
 234. | record~d |  cohort | sampa_id | orgid |    sex |        dob |  age | control | cont_age | cont_s~e | cont_m~d  | cont_h~t  |
      |   71-312 |  DIVIDS |    11786 |  1786 |   Male | 2009-08-06 | 13.3 |       . |        . |        . |        .  |        .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |  cont_art  |  cont_a~s  |  explain   |  insuli~p   |              consent_basic   |  assent   |                preg_test   |
      |         .  |         .  |      Yes   |         .   |     Consents to basic OGTT   |     Yes   |                        .   |
      |-----------------------------------------------------------------------------------+-----------+----------------------------|
      |                            preg_result  | indept~e  | indept~p  | ct_sam~e  | ct  | ivgtt_~e  | ivgtt  | uss_sa~e  |  uss  |
      |                                      .  |       No  |        .  |       No  |  .  |        0  |     .  |      Yes  |  Yes  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ever_mal |           degree_mal | clini~mo |       marital |                                          education | edu_fa~r |
      |       PM | Malnutrition Level 1 |          |             . |                                                  . |        . |
      |----------+-------------------------------------------------+---------------------------------------------------------------|
      | edu_mo~r | edu_ch~d |        employ | em~ather | em~other  | num_re~e  | re_dwelltype  | re_dwe~o  | re_ten~s  | re_ten~o  |
      |        . |        . |             . |        . |        .  |        .  |            .  |           |        .  |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                                    re_house  |  re_hou~o  |  rooms  |                                re_cook  |  re_coo~o  |
      |                                           .  |         .  |      .  |                                      .  |            |
      |----------------------------------------------------------------------------------------------------------------------------|
      |  re_fuel | re_fue~o |     re_electric | re_ele~o |             re_water | re_wat~o |                  re_toilet | re_toi~o |
      |        . |          |               . |          |                    . |          |                          . |          |
      |---------------------------------------+------------------------------------------------------------------------------------|
      | vcd |  tv | ref | wmachine | computer | stove  | radio  | phone  | cellph~e  | efan  | ac  | sewing  | cow  | pig  | goat  |
      |   . |   . |   . |        . |        . |     .  |     .  |     .  |        .  |    .  |  .  |      .  |   .  |   .  |    .  |
      |-----------------+----------+-----------------------------------------------------------------------------------------------|
      | poultr~n | bike | motorc~e | car | boat | tractor | table | chair | solar  | ses_te~1  | ses_te~2  | ses_te~3  | ses_te~4  |
      |        . |    . |        . |   . |    . |       . |     . |     . |     .  |        .  |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | ses_te~5 |     comp1  | ses_te~6  | ses_te~e  | clinic_~ry  |          pregnant  |                           preg_result1  |
      |        . |         .  |        .  |        .  |             |                 .  |                                      .  |
      |----------+--------------------------------------------------+--------------------------------------------------------------|
      | suspec~v | hiv | art | art_yrs |     re_art_type | re_art~o | diab | re_dia~r | diag_d~0 | diag_d~1 | diag_d~2 | diag_d~3  |
      |        . |   . |   . |         |               . |          |   No |          |        . |        . |        . |        .  |
      |----------+---------------------+---------------------------------------------------------+---------------------------------|
      | diag_d~4 | diag_d~9 | re_dia~s | re_dia~n | re_dia~1 | ~g1_spec  | re_dia~2  | r~2_spec  | re_dia~3  | r~3_spec  | diag_4  |
      |        . |        . |          |        . |        . |           |        .  |           |        .  |           |      .  |
      |----------+----------+----------+----------+----------+---------------------------------------------------------------------|
      | diag4_~c | re_lun~1 | re_con~1 | re_con~c | peptic~1 | liver_~1 | kidney~1  | cancer1  | lung_d~2  | re_lun~2  | contis~2  |
      |        . |        . |        . |          |        . |        . |        .  |       .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+--------------------------------------------+-----------+-----------+-----------|
      | c~2_spec | peptic~2 | liver_~2 | kidney~2 | cancer2 | lung_d~3 | contis~3  | c~3_spec  | peptic~3  | liver_~3  | kidney~3  |
      |        . |        . |        . |        . |       . |        . |        .  |        .  |        .  |        .  |        .  |
      |-----------------------------------------------------+----------+-----------------------------------------------------------|
      | cancer3 | lung_d~4 | contis~4 | c~4_spec | peptic~4 | liver_~4 | kidney~4 | cancer4 | hosp_f~q | hosp_d~g | hosp_d~s | med |
      |       . |        . |        . |        . |        . |        . |        . |       . |        . |        . |          |   . |
      |----------------------------------------------------------------------------------------------------------------------------|
      | med_ty~1 | med_ty~2 | med_ty~3 | med_ty~4 | med_ty~5  | med_ty~9  | re_med~s  | thirst  | polyuria  | fatigue  | polydi~a  |
      |        0 |        0 |        0 |        0 |        0  |        .  |           |      .  |        .  |       .  |        .  |
      |----------+----------+----------+----------+--------------------------------------------------------------------+-----------|
      | blurre~n | numbness | other~s1 | other~s2 | other~s3 | other~s4 | other~s5 | other~s6  | other~s7  | other~s8  | other~s9  |
      |        . |        . |        0 |        0 |        0 |        0 |        0 |        0  |        0  |        0  |        0  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | other~10 | other~11 | other~12 | other~13 | other~14 | other~15 | other~16 | other~17  | other~18  | other~99  | re_sym~s  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        0  |        0  |        .  |           |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | med_ex~1 | med_ex~2  | med_ex~3  | med_ex~4  | med_ex~5  | med_ex~6  | med_ex~7  | med_ex~8  | med_e~99  |   clin_summary  |
      |        0 |        0  |        0  |        0  |        0  |        0  |        0  |        0  |        .  |              .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |           exam_by | sig_exam |                           sig_exam_upload  | metfor~n  | insulin  | flag_m~n  | clinic_~tt  |
      |                   |          |                                            |        .  |       .  |        0  | 2022-11-15  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                                                      sample_gp  |    standard_ogtt  |                fasting  |  ogtt_u~t  |
      |     SAM Lusaka, DIVIDS, adults who want only 3-time point OGTT  |                .  |  Nothing or only water  |     mg/dL  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ogtt_t..  | time0_w  |            time0_x  |            time0_y  |  time0_z  |             time0_a  |             time0_b  |
      | 10:10:00  |   11786  |              11786  |                     |        .  |                      |                      |
      |----------------------------------------------------------------------------------------------------------------------------|
      |            time0_c | time0_e | time0_f | time0_g | time0_h | time0_j | time0_k | ogtt_s~m | ogtt_~a0 | ogtt_~o0 | ~a0_cold |
      |                    |         |         |         |         |         |         |      Yes |      Yes |        . |        . |
      |----------------------------------------+-----------------------------------------------------------------------------------|
      |     ogtt_comment_time0 | hba1c | glu0  | mmol_~u0  | out_glu0  | glu0_m~g  | glu0_m~y  | cpept~e0  | mul_c~e0  | ngml_~e0  |
      |                        |   5.5 |  101  |     5.61  |        0  |       No  |           |     1.52  | 84.44444  |     1.52  |
      |------------------------+---------------------------------------------------+-----------------------+-----------------------|
      | pmol_~e0  |  insulin0  |  i~n0_mul  |  ~n0_pmol  |  ogtt_t..  |  time15_z  |             time15_a  |             time15_b  |
      | 506.6667  |     12.39  |     12.39  |     74.34  |            |         .  |                       |                       |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      |            time15_c | ogtt~a15 | ogtt_c.. | glu15  | mmol_~15  | out_g~15  | glu15_~g  | glu15_~y  | cpept~15  | mul_c~15  |
      |                     |        . |          |     .  |        .  |        0  |        .  |           |        .  |        .  |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      | ngml_~15  |  pmol_~15  |  insul~15  |  i~15_mul  |  ogtt_t..  |  time30_z  |             time30_a  |             time30_b  |
      |        .  |         .  |         .  |         .  |            |         .  |                       |                       |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      |            time30_c | time30_e | time30_f | time30_g | time30_h | time30_j | time30_k  | ogtt_s..  | ogtt~o30  | ~30_cold  |
      |                     |          |          |          |          |          |           |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ogtt_c.. | glu30 | mmol_~30 | out_g~30 | glu30_~g  | glu30_~y  | cpept~30  | mul_c~30  | ngml_~30  | pmol_~30  | insul~30  |
      |          |     . |        . |        0 |        .  |           |        .  |        .  |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------+-----------+-----------|
      | i~30_mul | ogtt_t.. | time45_z |            time45_a |            time45_b  |            time45_c  | ogtt~a45  | ogtt_c..  |
      |        . |          |        . |                     |                      |                      |        .  |           |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | glu45 | mmol_~45 | out_g~45 | glu45_~g | glu45_~y  | cpept~45  | mul_c~45  | ngml_~45  | pmol_~45  | insul~45  | i~45_mul  |
      |     . |        . |        0 |        . |           |        .  |        .  |        .  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------------------+-----------+-----------+-----------|
      | ogtt_t.. | time60_z |            time60_a |            time60_b |            time60_c  | time60_e  | time60_f  | time60_g  |
      |    11:10 |        . |                     |                     |                      |           |           |           |
      |----------+----------+---------------------+--------------------------------------------+-----------+-----------+-----------|
      | time60_h | time60_j | time60_k | ogtt~a60 | ogtt~o60  | ~60_cold  | ogtt_c..  | glu60  | mmol_~60  | out_g~60  | glu60_~g  |
      |          |          |          |      Yes |        .  |        .  |           |   104  |     5.78  |        0  |       No  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | glu60_~y  | cpept~60  | mul_c~60  | ngml_~60  | pmol_~60  |  insul~60  |  i~60_mul  |  ~60_pmol  |  ogtt_t..  |  time90_z  |
      |           |     4.47  | 248.3333  |     4.47  |     1490  |     32.21  |     32.21  |    193.26  |            |         .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |            time90_a |            time90_b |            time90_c | time90_e | time90_f  | time90_g  | time90_h  | time90_j  |
      |                     |                     |                     |          |           |           |           |           |
      |---------------------+---------------------+--------------------------------+-----------+-----------+-----------+-----------|
      | time90_k | ogtt~a90 | ogtt~o90 | ~90_cold | ogtt_c..  | glu90  | mmol_~90  | out_g~90  | glu90_~g  | glu90_~y  | cpept~90  |
      |          |        . |        . |        . |           |     .  |        .  |        0  |        .  |           |        .  |
      |----------+----------+----------+----------+--------------------------------+-----------------------+-----------------------|
      | mul_c~90 | ngml_~90 | pmol_~90 | insul~90 | i~90_mul | ogtt_t.. | time12~z |            time120_a  |            time120_b  |
      |        . |        . |        . |        . |        . |    12:10 |        . |                       |                       |
      |----------------------------------------------------------------------------------------------------+-----------------------|
      |            time120_c | time12~e | time12~f | time12~g | time12~h | time12~j | time12~k | ogtt_s..  | ogt~o120  | ~20_cold  |
      |                      |          |          |          |          |          |          |      Yes  |        .  |        .  |
      |----------------------------------------------------------------------------------------+-----------+-----------+-----------|
      | ogtt_c.. | glu120 | mmol_g.. | out_~120 | glu120~g | glu120~y  | cpep~120  | mul_~120  | ngml~120  | pmol~120  | insu~120  |
      |          |     99 |      5.5 |        0 |       No |           |     5.63  | 312.7778  |     5.63  | 1876.667  |    49.57  |
      |----------+-----------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | i~20_mul | ~20_pmol | high_h~1 | high_g~1 | repeat~d | repeat~e  | thawed  | pmh_diab  |   homair  | homair~1  | homabeta  |
      |    49.57 |   297.42 |        0 |        0 |       No |           |     No  |       No  |  3.08924  | 21.05482  | 117.4408  |
      |----------+----------+----------+----------+----------+---------------------+-----------+-----------+-----------+-----------|
      | homabe~p | flag_f~5 | gluc_~ol | gluc_~dl | in~n_mul | Matsud~x | glu0_m~l | glu60_~l  | insuli~x  | flag_p~I  | glu30_~l  |
      | .1945024 |        0 |     5.63 |   101.34 |    31.39 | 5.012571 |   100.98 |   104.04  | 6.477129  |        0  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------+-----------|
      | ogttr_~m | rogtt_~t | ~r_time0  | ogt~e0_1  | ogttr_~a  | ~s_time0  | rglu0  | rglu0_~g  | rglu0_~y  | rhba1c  | ogttr_..  |
      |        . |        . |           |           |        .  |           |     .  |        .  |        .  |      .  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | ogt~30_1 | ogttr_.. | ogttr_.. | rglu30 | rglu30~g  | rglu30~y  | ogttr_..  | ogt~20_1  | ogttr_..  | ogttr_..  | rglu120  |
      |        . |        . |        . |      . |        .  |        .  |           |           |        .  |           |       .  |
      |----------+----------+----------+--------------------------------+-----------+-----------+-----------+----------------------|
      | rglu12~g | rglu12~y | mmol_r~0 | high_g~2 | dia_re~l | glu_co~t | total_~o  | total_~b  | total_~c  | ldl_cho  | ldl_ch~b  |
      |        . |        . |        . |        0 |        . |          |      129  |       No  |           |      83  |       No  |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | ldl_ch~c | hdl_cho | hdl_ch~b | hdl_ch~c | trig | trig_p~b | trig_p~c | lipid_~t  |   hgb  | hgb_prob  | hgb_pr~c  |  rbc  |
      |          |      40 |       No |          | 64.0 |       No |          |    mg/dL  | 10.60  |       No  |        .  | 3.95  |
      |----------+--------------------------------------+----------+----------+-----------+----------------------------------------|
      | rbc_prob | rbc_pr~c | wbc | wbc_prob | wbc_pr~c | platelet | platel~b | platel~c  | lipase  | lipase~b  | lipase~c  | crp  |
      |       No |        . | 7.6 |       No |        . |      269 |       No |        .  |     29  |       No  |        .  |  .5  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | crp_prob | crp_pr~c | mgl_crp | mgl_cy~n | ul_amylp | clini~ro | systol~1  | systol~2  | systol~3  | systolic  | diasto~1  |
      |       No |        . |      .5 |        . |        . |          |        .  |        .  |        .  |        .  |        .  |
      |----------+----------+--------------------+---------------------------------------------------------------------------------|
      | diasto~2 | diasto~3 | diasto~c | weight1 | weight2 | weight3 | weight | height1 | height2 | height3  | sit_ht1  | sit_ht2  |
      |        . |        . |        . |       . |       . |       . |      . |       . |       . |       .  |       .  |       .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | sit_ht3 | sit_box | tibia1 | tibia2 | tibia3 | tibia | grip_d~d | grip_~r1 | grip_~r2  | grip_~r3  | min_gr~r  | grip_u~r  |
      |       . |       . |      . |      . |      . |     . |        . |        . |        .  |        .  |        .  |        .  |
      |------------------------------------------------------+----------+----------------------------------------------------------|
      | grip_~l1 | grip_~l2 | grip_~l3 | min_gr~l | max_gr~l | max_gr~r | max_grip  | grip_u~l  | muac1  | muac2  | muac3  | muac  |
      |        . |        . |        . |        . |        . |        . |        .  |        .  |     .  |     .  |     .  |    .  |
      |-----------------------------------------------------------------+-----------+-----------+----------------------------------|
      | waist1 | waist2 | waist3 | waist | hip1  | hip2  | hip3  | hip  | triceps1  | triceps2  | triceps3  | triceps  | subscap1  |
      |      . |      . |      . |     . |    .  |    .  |    .  |   .  |        .  |        .  |        .  |       .  |        .  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      | subscap2 | subscap3 | subscap |                                 anthro_prob  | menstr~e  | menst_~h  | tanner  | tanner~d  |
      |        . |        . |       . |                                              |        .  |           |      .  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | adj_he~1 | adj_he~2 | adj_he~3 | height | adj_si~1 | adj_si~2 | adj_si~3 | si~1_adj | si~2_adj | si~3_adj | sit_ht  | bmi  |
      |        . |        . |        . |      . |        . |        . |        . |        . |        . |        . |      .  |   .  |
      |----------------------------------------------------+-----------------------------------------------------------------------|
      | haz | bmiz | bmi_ca~d | bmi_cat | clinic_~dy | bia | fm_kg | fm_per | ffm_kg | ffm_per | fmi | ffmi | impeda~e | bia_prob  |
      |   . |    . |        . |       . |            |   . |     . |      . |      . |       . |   . |    . |        . |        .  |
      |----------------------------------------------------+-----------------------------------+-----------------------+-----------|
      | bia_co~t | adp | adpfm_kg  | adpffm~g  | adpfm_~r  | adpffm~r  | adp_prob  | adp_co~t  | redcap~p  | perso~10  | times~10  |
      |          |   . |        .  |        .  |        .  |        .  |        .  |           |  1divids  |           |           |
      |----------+-----------------------------------------------------------------------------+-----------+-----------+-----------|
      | clinic~l | refer_~n | radiol~r | radiol~s | elasta~l  | fecal_~t  | elasta~r  | refer  | refer_..  | refer_..  | refer_..  |
      |          |        . |        . |          |        .  |        .  |        .  |     .  |        0  |        0  |        0  |
      |----------+----------+----------+----------+--------------------------------------------+-----------+-----------+-----------|
      | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_..  | refer_~o  | refer_~i  | refer~ss  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        .  |           |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_..  | refer_..  | refer_..  | refer_..  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        0  |        0  |        0  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | refer~rs | refer~e1 | refer~e2 | refer~e3 | refer~e4 | refer~e7 | refer~e8 | refer~e9  | refe~e10  | refer~e5  | refer~e6  |
      |          |          |          |          |        . |        . |          |           |        .  |           |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      | clinic_d~s  | urine  | urine_co~t  | urine_~e  |       urine_ali_q  |       urine_ali_r  | u_coll~t  | u_leucs  |  u_gluc  |
      | 2023-02-08  |     .  |             |           |                    |                    |        .  |       .  |       .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | u_ketone | u_prot | u_nitr~e | u_blood | urine_~m |                 feces | feces_c~dt | feces~me  | feces_~s  | feces~_t  |
      |        . |      . |        . |       . |          | Brought one from home | 2023-02-08 | 09:20:00  |           |           |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | feces_~u | feces_~p | feces~te | feces~de | feces~ct | fecal_~e | fecal_~o |                                feces_problem  |
      |          |       No |          |        . |      Yes |        . |        . |                                               |
      |----------------------------------------------------------------------------------------------------------------------------|
      | clinic_~et | re_cit~s | re_ber~s | re_ban~s | re_app~s | re_pin~s |                                   re_mango | re_melon  |
      |            |        . |        . |        . |        . |        . |                                          . |        .  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      | re_dry~t |                                  re_tomato | re_pep~r | re_ora~g |      re_green_leafy  | re_cru~s  | re_gourd  |
      |        . |                                          . |        . |        . |                   .  |        .  |        .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | legumes | nuts_s~s |            red_meat | poultry | processed_meat | organ_~t |           fish | seafood |           eggs |
      |       . |        . |                   . |       . |              . |        . |              . |       . |              . |
      |---------------------------------------------------------------------+----------+-------------------------------------------|
      |  milk |            milk_tea | yogurt | yogurt~t | yogurt~k | cheese | icecream | dairy_~h  | fruit_~e  |  soda  | alcohol  |
      |     . |                   . |      . |        . |        . |      . |        . |        .  |        .  |     .  |       .  |
      |-------+------------------------------+--------------------------------------------------------------------------+----------|
      | fries | fried_~t | crisps | crackers | samosas | pizza_~r | savour~h |  cake |        cookies | pudding | candy | street~d |
      |     . |        . |      . |        . |       . |        . |        . |     . |              . |       . |     . |        . |
      |------------------------------------------------------------------------------+---------------------------------------------|
      | fast_f~d | alcoho~t | re_leg~s | radio_~m | date_exa~s | time_e~s | pan_si~l | pan_he~s | pan_he~p | pan_bo~s  | pan_ta~s  |
      |        . |        . |        . |      Yes | 2022-11-15 |    11:16 |   Normal |     1.52 |     2.25 |      .92  |     1.03  |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | pan_sh~e  | pan_sh~m  | pan_sh~y  |   pan_contour  | pan_co~m  | pan_co~y  | pan_pa~a  | pan_pa~m  | pa~rosis  | pa~tosis  |
      |   Normal  |        .  |           | Normal/Smooth  |        .  |           |   Normal  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | pan_duct | pan_d~es | pan_d~ss | pan_ca~i | pan_ca~e | pan_cy~s | pan_ot~l | pan_ot~y  | image_~s  | image_~l  | image_~y  |
      |   Normal |        . |        . |   Absent |        . |          |       No |           |  Optimal  |        .  |           |
      |---------------------+------------------------------------------------------------------------------------------------------|
      |       name_radio    |                       sig_radio    |             sig_uss_upload    |                     file_uss    |
      |   Dr. Nitin Sood    |                                    |    Dr Nitins signature.jpg    |    202211151116150028ABD.DCM    |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                  file_uss2   |                  file_uss3   |                  file_uss4   |                   file_uss5   |
      |  202211151116200029ABD.DCM   |  202211151116350030ABD.DCM   |  202211151116430031ABD.DCM   |   202211151116530032ABD.DCM   |
      |------------------------------+------------------------------+------------------------------+-------------------------------|
      |                  file_uss6   |                  file_uss7   |                  file_uss8   |                   file_uss9   |
      |  202211151117000033ABD.DCM   |  202211151117080034ABD.DCM   |  202211151117220035ABD.DCM   |   202211151117270036ABD.DCM   |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                file_uss10 | hepato~y | spleno~y | cholel~s | steato~s | mass | gyneco~c | athero~s | nephro~s  | pancre~c  |
      | 202211151117560037ABD.DCM |        0 |        0 |        0 |        0 |    0 |        0 |        0 |        0  |        0  |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | ct_scan | ct_date | ct_time | ct_p~ual | ct_pan..  | ct_pan~p  | ct_pan..  | c~tail~s  | ct_pa~il  | ct_pan~y  | ct_pan~d  |
      |      No |         |         |        . |        .  |        .  |        .  |        .  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ct_pa~pe | ct_pan.. | ct_pan.. | ct_pan~r | ct_pan.. | ct_pan.. | ct_pan~a | ct_pa~am  | ct~rosis  | ct~tosis  | ct_pan~t  |
      |        . |        . |          |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+--------------------------------------------------------------------------------|
      | ct_pa~es | ct_pa~ss | ct_pan~i | ct_pa~ce | ct_p~mal  | c~n_spec  | ct_ima~l  | ct_pro~m  | ct_pro~y  | name_ct  | sig_ct  |
      |        . |        . |        . |        . |        .  |           |        .  |        .  |           |          |         |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | sig_ct~d | file_ct | file_ct2 | file_ct3 | file_ct4 | file_ct5 | file_ct6  | file_ct7  | file_ct8  | file_ct9  | file_c~0  |
      |          |         |          |          |          |          |           |           |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | r2_pan.. | r2_pan~p | r2_pan.. | r2_pan.. | r2_pa~il | r2_pan~y | r2_pan~d | r2_rem~s  | r2_pan..  | r2_pan..  | r2_pan..  |
      |        . |        . |        . |        . |        . |        . |        . |           |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | r2_pan.. | r2_pan.. | r2_pan.. | r2_pan.. | r2_rem~a | r3_pan.. | r3_pan~p | r3_pan..  | r3_pan..  | r3_pa~il  | r3_pan~y  |
      |        . |        . |        . |        . |          |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | r3_pan~d | r3_rem~s | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan..  | r3_pan..  | r3_rem~a  | i~e_ne10  |
      |        . |          |        . |        . |        . |        . |        . |        .  |        .  |        .  |           |
      |----------+----------+----------+----------+--------------------------------------------------------------------------------|
      | iv~e_ne1 | ivgt~e_2 | ivgt~e_4 | ivgt~e_6 | ivgt~e_8  | ivg~e_10  | i~t_ne10  | iv~t_ne1  | ivgtt_2  | ivgtt_4  | ivgtt_6  |
      |          |          |          |          |           |           |        .  |        .  |       .  |       .  |       .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ivgtt_8 | ivgtt_10 | iv~e10_l | iv~e10_m | iv~e10_n | iv~e10_p | ivti~1_l  | ivti~1_m  | ivti~1_n  | ivti~1_p  | ivti~2_l  |
      |       . |        . |          |          |          |          |           |           |           |           |           |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ivti~2_m | ivti~2_n | ivti~2_p | ivti~4_l | ivti~4_m | ivti~4_n | ivti~4_p | ivti~6_l  | ivti~6_m  | ivti~6_n  | ivti~6_p  |
      |          |          |          |          |          |          |          |           |           |           |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ivti~8_l  | ivti~8_m  | ivti~8_n  | ivti~8_p  | iv~_10_l  |  iv~_10_m  |  iv~_10_n  |  iv~_10_p  |  temp_o~d  |  flag_f~e  |
      |           |           |           |           |           |            |            |            |         .  |         .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |          _merge | recrui~d | ass~tase  | ass~pase  | radio2  | ct2  | radio_~s  | radio_~l  | radio3  | subset  | subset2  |
      | Master only (1) |        1 |        0  |        1  |    Yes  |  No  |        0  |       12  |    Yes  |      1  |       1  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | epi_bi~y | epi_or~l | child | africa  |          exposuretime  | fec_co~t  | ct_pa~ol  | r2_pa~ol  | r3_pa~ol  | r2_pan..  |
      |        . |        . | Child |   Asia  | Exposure in Childhood  |   DIVIDS  |        .  |        .  |        .  |        .  |
      |----------+----------+------------------------------------------+-----------+-----------+-----------+-----------+-----------|
      | r3_pan.. |       xb | hiv2 | _est_m~1  | _est_m~2  | _est_m~3  | _est_m~4  | _est_m~5  | _est_~5a  | _est_~5b  | _est_~5c  |
      |        . |        . |    0 |        0  |        0  |        0  |        0  |        0  |        0  |        0  |        0  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      |       pc1 |       pc2 | pc_f~1_c1 | pc_f~2_c1 | pc~il1_c1  | pc~il2_c1  | pc_~r1_c1  | pc_~r2_c1  | st~ll1_c1  | s~ll2_c1  |
      | -.9414865 | -.3068794 | -1.355101 |  1.444819 | -.6971341  |  1.323221  | -1.407855  |  1.528295  | -.9734994  | 1.581351  |
      |-----------+-----------+-----------+-----------+----------------------------------------------------------------------------|
      | st~il1_c1 | st~il2_c1 | std~r1_c1 | std~r2_c1 | p~ll1_c2 | p~ll2_c2 | p~il1_c2 | p~il2_c2 | pc~r1_c2 | pc~r2_c2 | s~ll1_c2 |
      | -.5533691 |  1.452781 | -1.111581 |  1.677536 |        . |        . |        . |        . |        . |        . |        . |
      |----------------------------------------------------------------------------------------------------------------------------|
      | s~ll2_c2 | s~il1_c2 | s~il2_c2 | st~r1_c2 | st~r2_c2 | p~ll1_c3 | p~ll2_c3 | p~il1_c3  | p~il2_c3  | pc~r1_c3  | pc~r2_c3  |
      |        . |        . |        . |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------------------+-----------+-----------------------|
      | s~ll1_c3 | s~ll2_c3 | s~il1_c3 | s~il2_c3 | st~r1_c3 | st~r2_c3 | pc_f~1_c4 | p~ll2_c4 | pc~il1_c4 | p~il2_c4 | pc_~r1_c4  |
      |        . |        . |        . |        . |        . |        . |         . |        . |         . |        . |         .  |
      |----------+-----------------------------------------------------------------------------------------+-----------------------|
      | pc~r2_c4 | st~ll1_c4 | s~ll2_c4 | st~il1_c4 | s~il2_c4 | st~r1_c4 | st~r2_c4 | p~ll1_c5 | p~ll2_c5 | p~il1_c5  | p~il2_c5  |
      |        . |         . |        . |         . |        . |        . |        . |        . |        . |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------+-----------+-----------|
      | pc~r1_c5 | pc~r2_c5 | s~ll1_c5 | s~ll2_c5 | s~il1_c5 | s~il2_c5 | st~r1_c5 | st~r2_c5  | p~ll1_c6  | p~ll2_c6  | p~il1_c6  |
      |        . |        . |        . |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------------------------------+-----------|
      | p~il2_c6 | pc~r1_c6 | pc~r2_c6 | s~ll1_c6 | s~ll2_c6 | s~il1_c6 | s~il2_c6 | st~r1_c6 | st~r2_c6  | pc1_com~d  | pc2_co~d  |
      |        . |        . |        . |        . |        . |        . |        . |        . |        .  | -.9734994  | 1.581351  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |           adjp~pwt           |           adjpan..           |           a~body~t           |           a~tail~t            |
      |                  .           |                  .           |                  .           |                  .            |
      +----------------------------------------------------------------------------------------------------------------------------+

      +----------------------------------------------------------------------------------------------------------------------------+
1565. | record~d |  cohort | sampa_id | orgid |    sex |        dob |  age | control | cont_age | cont_s~e | cont_m~d  | cont_h~t  |
      |   72-271 | NUSTART |    40174 |  5867 | Female | 1983-05-01 | 39.5 |      No |        . |        . |        .  |        .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |  cont_art  |  cont_a~s  |  explain   |  insuli~p   |              consent_basic   |  assent   |                preg_test   |
      |         .  |         .  |      Yes   |         .   |  Consents to standard OGTT   |       .   |  Yes, will agree to test   |
      |-----------------------------------------------------------------------------------+-----------+----------------------------|
      |                            preg_result  | indept~e  | indept~p  | ct_sam~e  | ct  | ivgtt_~e  | ivgtt  | uss_sa~e  |  uss  |
      | has documented positive pregnancy test  |       No  |        .  |       No  |  .  |        0  |     .  |      Yes  |  Yes  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ever_mal |           degree_mal | clini~mo |       marital |                                          education | edu_fa~r |
      |       PM | Malnutrition Level 2 |          | Widow/widower | Completed primary (with or without some secondary) |        . |
      |----------+-------------------------------------------------+---------------------------------------------------------------|
      | edu_mo~r | edu_ch~d |        employ | em~ather | em~other  | num_re~e  | re_dwelltype  | re_dwe~o  | re_ten~s  | re_ten~o  |
      |        . |        . | Casual labour |        . |        .  |        7  | Single house  |           |      Own  |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                                    re_house  |  re_hou~o  |  rooms  |                                re_cook  |  re_coo~o  |
      |  Partly low quality and partly high quality  |         .  |      3  |  In separate room/kitchen in the house  |            |
      |----------------------------------------------------------------------------------------------------------------------------|
      |  re_fuel | re_fue~o |     re_electric | re_ele~o |             re_water | re_wat~o |                  re_toilet | re_toi~o |
      | Charcoal |          | Yes, own source |          | Piped private source |          | Shared/ public Pit latrine |          |
      |---------------------------------------+------------------------------------------------------------------------------------|
      | vcd |  tv | ref | wmachine | computer | stove  | radio  | phone  | cellph~e  | efan  | ac  | sewing  | cow  | pig  | goat  |
      | Yes | Yes | Yes |       No |       No |   Yes  |    No  |    No  |      Yes  |   No  | No  |     No  |  No  |  No  |   No  |
      |-----------------+----------+-----------------------------------------------------------------------------------------------|
      | poultr~n | bike | motorc~e | car | boat | tractor | table | chair | solar  | ses_te~1  | ses_te~2  | ses_te~3  | ses_te~4  |
      |       No |   No |       No |  No |   No |      No |   Yes |   Yes |    No  |        .  |        .  |        .  |   medium  |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | ses_te~5 |     comp1  | ses_te~6  | ses_te~e  | clinic_~ry  |          pregnant  |                           preg_result1  |
      |        . | -2.162497  |        .  |        2  | 2022-10-17  | Yes agree to test  | has documented positive pregnancy test  |
      |----------+--------------------------------------------------+--------------------------------------------------------------|
      | suspec~v | hiv | art | art_yrs |     re_art_type | re_art~o | diab | re_dia~r | diag_d~0 | diag_d~1 | diag_d~2 | diag_d~3  |
      |        . | Yes | Yes |    11.0 | Tenofovir-based |          |   No |          |        . |        . |        . |        .  |
      |----------+---------------------+---------------------------------------------------------+---------------------------------|
      | diag_d~4 | diag_d~9 | re_dia~s | re_dia~n | re_dia~1 | ~g1_spec  | re_dia~2  | r~2_spec  | re_dia~3  | r~3_spec  | diag_4  |
      |        . |        . |          |        0 |        . |           |        .  |           |        .  |           |      .  |
      |----------+----------+----------+----------+----------+---------------------------------------------------------------------|
      | diag4_~c | re_lun~1 | re_con~1 | re_con~c | peptic~1 | liver_~1 | kidney~1  | cancer1  | lung_d~2  | re_lun~2  | contis~2  |
      |        . |        . |        . |          |        . |        . |        .  |       .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+--------------------------------------------+-----------+-----------+-----------|
      | c~2_spec | peptic~2 | liver_~2 | kidney~2 | cancer2 | lung_d~3 | contis~3  | c~3_spec  | peptic~3  | liver_~3  | kidney~3  |
      |        . |        . |        . |        . |       . |        . |        .  |        .  |        .  |        .  |        .  |
      |-----------------------------------------------------+----------+-----------------------------------------------------------|
      | cancer3 | lung_d~4 | contis~4 | c~4_spec | peptic~4 | liver_~4 | kidney~4 | cancer4 | hosp_f~q | hosp_d~g | hosp_d~s | med |
      |       . |        . |        . |        . |        . |        . |        . |       . |        . |        . |          |   . |
      |----------------------------------------------------------------------------------------------------------------------------|
      | med_ty~1 | med_ty~2 | med_ty~3 | med_ty~4 | med_ty~5  | med_ty~9  | re_med~s  | thirst  | polyuria  | fatigue  | polydi~a  |
      |        0 |        0 |        0 |        0 |        0  |        .  |           |     No  |       No  |      No  |       No  |
      |----------+----------+----------+----------+--------------------------------------------------------------------+-----------|
      | blurre~n | numbness | other~s1 | other~s2 | other~s3 | other~s4 | other~s5 | other~s6  | other~s7  | other~s8  | other~s9  |
      |       No |       No |        0 |        0 |        0 |        0 |        0 |        0  |        0  |        0  |        0  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | other~10 | other~11 | other~12 | other~13 | other~14 | other~15 | other~16 | other~17  | other~18  | other~99  | re_sym~s  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        0  |        1  |        .  |           |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | med_ex~1 | med_ex~2  | med_ex~3  | med_ex~4  | med_ex~5  | med_ex~6  | med_ex~7  | med_ex~8  | med_e~99  |   clin_summary  |
      |        0 |        0  |        0  |        0  |        0  |        0  |        0  |        1  |        .  | Generally well  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |           exam_by | sig_exam |                           sig_exam_upload  | metfor~n  | insulin  | flag_m~n  | clinic_~tt  |
      |    Mundia Imasiku |          |                         1666012015027.jpg  |        .  |       .  |        0  | 2022-10-17  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                                                      sample_gp  |    standard_ogtt  |                fasting  |  ogtt_u~t  |
      | Adults agreeing to Standard OGTT but not in in-depth subsample  | 7 timepoint OGTT  |  Nothing or only water  |     mg/dL  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ogtt_t..  | time0_w  |            time0_x  |            time0_y  |  time0_z  |             time0_a  |             time0_b  |
      | 08:12:00  |          | 40174Se17.10.2202X  | 40174Se17.10.2202Y  |        .  |  40174P17.10.22013A  |  40174P17.10.22013B  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |            time0_c | time0_e | time0_f | time0_g | time0_h | time0_j | time0_k | ogtt_s~m | ogtt_~a0 | ogtt_~o0 | ~a0_cold |
      | 40174P17.10.22013C |         |         |         |         |         |         |      Yes |      Yes |        . |        . |
      |----------------------------------------+-----------------------------------------------------------------------------------|
      |     ogtt_comment_time0 | hba1c | glu0  | mmol_~u0  | out_glu0  | glu0_m~g  | glu0_m~y  | cpept~e0  | mul_c~e0  | ngml_~e0  |
      | Glucose given at 08:15 |   5.7 |   93  |     5.17  |        0  |       No  |           |        .  | 78.03333  |   1.4046  |
      |------------------------+---------------------------------------------------+-----------------------+-----------------------|
      | pmol_~e0  |  insulin0  |  i~n0_mul  |  ~n0_pmol  |  ogtt_t..  |  time15_z  |             time15_a  |             time15_b  |
      |    468.2  |         .  |      7.18  |         .  |     08:30  |         .  |  40174P17.10.221513A  |  40174P17.10.221513B  |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      |            time15_c | ogtt~a15 | ogtt_c.. | glu15  | mmol_~15  | out_g~15  | glu15_~g  | glu15_~y  | cpept~15  | mul_c~15  |
      | 40174P17.10.221513C |      Yes |          |   109  |     6.06  |        0  |       No  |           |        .  |      207  |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      | ngml_~15  |  pmol_~15  |  insul~15  |  i~15_mul  |  ogtt_t..  |  time30_z  |             time30_a  |             time30_b  |
      |    3.726  |      1242  |         .  |     40.45  |     08:45  |         .  |  40174P17.10.223013A  |  40174P17.10.223013B  |
      |----------------------------------------------------------------------------+-----------------------+-----------------------|
      |            time30_c | time30_e | time30_f | time30_g | time30_h | time30_j | time30_k  | ogtt_s..  | ogtt~o30  | ~30_cold  |
      | 40174P17.10.223013C |          |          |          |          |          |           |      Yes  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ogtt_c.. | glu30 | mmol_~30 | out_g~30 | glu30_~g  | glu30_~y  | cpept~30  | mul_c~30  | ngml_~30  | pmol_~30  | insul~30  |
      |          |    95 |     5.28 |        0 |       No  |           |        .  | 489.3333  |    8.808  |     2936  |        .  |
      |----------+-----------------------------------------------------------------------------------------+-----------+-----------|
      | i~30_mul | ogtt_t.. | time45_z |            time45_a |            time45_b  |            time45_c  | ogtt~a45  | ogtt_c..  |
      |      175 |    09:00 |        . | 40174P17.10.224513A | 40174P17.10.224513B  | 40174P17.10.224513C  |      Yes  |           |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | glu45 | mmol_~45 | out_g~45 | glu45_~g | glu45_~y  | cpept~45  | mul_c~45  | ngml_~45  | pmol_~45  | insul~45  | i~45_mul  |
      |    98 |     5.44 |        0 |        . |           |        .  | 280.3333  |    5.046  |     1682  |        .  |    53.35  |
      |----------------------------------------------------------------------------------------+-----------+-----------+-----------|
      | ogtt_t.. | time60_z |            time60_a |            time60_b |            time60_c  | time60_e  | time60_f  | time60_g  |
      |    09:15 |        . | 40174P17.10.226013A | 40174P17.10.226013B | 40174P17.10.226013C  |           |           |           |
      |----------+----------+---------------------+--------------------------------------------+-----------+-----------+-----------|
      | time60_h | time60_j | time60_k | ogtt~a60 | ogtt~o60  | ~60_cold  | ogtt_c..  | glu60  | mmol_~60  | out_g~60  | glu60_~g  |
      |          |          |          |      Yes |        .  |        .  |           |    92  |     5.11  |        0  |       No  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | glu60_~y  | cpept~60  | mul_c~60  | ngml_~60  | pmol_~60  |  insul~60  |  i~60_mul  |  ~60_pmol  |  ogtt_t..  |  time90_z  |
      |           |        .  |    290.5  |    5.229  |     1743  |         .  |  41.11666  |         .  |     09:45  |         .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |            time90_a |            time90_b |            time90_c | time90_e | time90_f  | time90_g  | time90_h  | time90_j  |
      | 40174P17.10.229013A | 40174P17.10.229013B | 40174P17.10.229013C |          |           |           |           |           |
      |---------------------+---------------------+--------------------------------+-----------+-----------+-----------+-----------|
      | time90_k | ogtt~a90 | ogtt~o90 | ~90_cold | ogtt_c..  | glu90  | mmol_~90  | out_g~90  | glu90_~g  | glu90_~y  | cpept~90  |
      |          |      Yes |        . |        . |           |    89  |     4.94  |        0  |       No  |           |        .  |
      |----------+----------+----------+----------+--------------------------------+-----------------------+-----------------------|
      | mul_c~90 | ngml_~90 | pmol_~90 | insul~90 | i~90_mul | ogtt_t.. | time12~z |            time120_a  |            time120_b  |
      | 232.1667 |    4.179 |     1393 |        . |     24.5 |    10:15 |        . | 40174P17.10.2212013A  | 40174P17.10.2212013B  |
      |----------------------------------------------------------------------------------------------------+-----------------------|
      |            time120_c | time12~e | time12~f | time12~g | time12~h | time12~j | time12~k | ogtt_s..  | ogt~o120  | ~20_cold  |
      | 40174P17.10.2212013C |          |          |          |          |          |          |      Yes  |        .  |        .  |
      |----------------------------------------------------------------------------------------+-----------+-----------+-----------|
      | ogtt_c.. | glu120 | mmol_g.. | out_~120 | glu120~g | glu120~y  | cpep~120  | mul_~120  | ngml~120  | pmol~120  | insu~120  |
      |          |     92 |     5.11 |        0 |       No |           |        .  | 262.6667  |    4.728  |     1576  |        .  |
      |----------+-----------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | i~20_mul | ~20_pmol | high_h~1 | high_g~1 | repeat~d | repeat~e  | thawed  | pmh_diab  |   homair  | homair~1  | homabeta  |
      |     28.3 |        . |        0 |        0 |       No |           |     No  |       No  | 1.649804  | 17.93033  | 85.98801  |
      |----------+----------+----------+----------+----------+---------------------+-----------+-----------+-----------+-----------|
      | homabe~p | flag_f~5 | gluc_~ol | gluc_~dl | in~n_mul | Matsud~x | glu0_m~l | glu60_~l  | insuli~x  | flag_p~I  | glu30_~l  |
      |  .227091 |        0 | 5.301429 | 95.42572 | 52.84238 |  5.44794 |    93.06 |    91.98  | 84.75743  |        0  |    95.04  |
      |----------+----------+------------------------------------------------------------------------------------------+-----------|
      | ogttr_~m | rogtt_~t | ~r_time0  | ogt~e0_1  | ogttr_~a  | ~s_time0  | rglu0  | rglu0_~g  | rglu0_~y  | rhba1c  | ogttr_..  |
      |        . |        . |           |           |        .  |           |     .  |        .  |        .  |      .  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | ogt~30_1 | ogttr_.. | ogttr_.. | rglu30 | rglu30~g  | rglu30~y  | ogttr_..  | ogt~20_1  | ogttr_..  | ogttr_..  | rglu120  |
      |        . |        . |        . |      . |        .  |        .  |           |           |        .  |           |       .  |
      |----------+----------+----------+--------------------------------+-----------+-----------+-----------+----------------------|
      | rglu12~g | rglu12~y | mmol_r~0 | high_g~2 | dia_re~l | glu_co~t | total_~o  | total_~b  | total_~c  | ldl_cho  | ldl_ch~b  |
      |        . |        . |        . |        0 |        . |          |        .  |        .  |           |       .  |        .  |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | ldl_ch~c | hdl_cho | hdl_ch~b | hdl_ch~c | trig | trig_p~b | trig_p~c | lipid_~t  |   hgb  | hgb_prob  | hgb_pr~c  |  rbc  |
      |          |       . |        . |          |      |        . |          |        .  |        |        .  |        .  |    .  |
      |----------+--------------------------------------+----------+----------+-----------+----------------------------------------|
      | rbc_prob | rbc_pr~c | wbc | wbc_prob | wbc_pr~c | platelet | platel~b | platel~c  | lipase  | lipase~b  | lipase~c  | crp  |
      |        . |        . |   . |        . |        . |        . |        . |        .  |      .  |        .  |        .  |   .  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | crp_prob | crp_pr~c | mgl_crp | mgl_cy~n | ul_amylp | clini~ro | systol~1  | systol~2  | systol~3  | systolic  | diasto~1  |
      |        . |        . |    3.74 |      .81 |     51.6 |          |        .  |        .  |        .  |        .  |        .  |
      |----------+----------+--------------------+---------------------------------------------------------------------------------|
      | diasto~2 | diasto~3 | diasto~c | weight1 | weight2 | weight3 | weight | height1 | height2 | height3  | sit_ht1  | sit_ht2  |
      |        . |        . |        . |       . |       . |       . |      . |       . |       . |       .  |       .  |       .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | sit_ht3 | sit_box | tibia1 | tibia2 | tibia3 | tibia | grip_d~d | grip_~r1 | grip_~r2  | grip_~r3  | min_gr~r  | grip_u~r  |
      |       . |       . |      . |      . |      . |     . |        . |        . |        .  |        .  |        .  |       kg  |
      |------------------------------------------------------+----------+----------------------------------------------------------|
      | grip_~l1 | grip_~l2 | grip_~l3 | min_gr~l | max_gr~l | max_gr~r | max_grip  | grip_u~l  | muac1  | muac2  | muac3  | muac  |
      |        . |        . |        . |        . |        . |        . |        .  |       kg  |     .  |     .  |     .  |    .  |
      |-----------------------------------------------------------------+-----------+-----------+----------------------------------|
      | waist1 | waist2 | waist3 | waist | hip1  | hip2  | hip3  | hip  | triceps1  | triceps2  | triceps3  | triceps  | subscap1  |
      |      . |      . |      . |     . |    .  |    .  |    .  |   .  |        .  |        .  |        .  |       .  |        .  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      | subscap2 | subscap3 | subscap |                                 anthro_prob  | menstr~e  | menst_~h  | tanner  | tanner~d  |
      |        . |        . |       . | Not done, participant three months pregnant  |        .  |           |      .  |        .  |
      |----------+----------+------------------------------------------------------------------------------------------------------|
      | adj_he~1 | adj_he~2 | adj_he~3 | height | adj_si~1 | adj_si~2 | adj_si~3 | si~1_adj | si~2_adj | si~3_adj | sit_ht  | bmi  |
      |        . |        . |        . |      . |        . |        . |        . |        . |        . |        . |      .  |   .  |
      |----------------------------------------------------+-----------------------------------------------------------------------|
      | haz | bmiz | bmi_ca~d | bmi_cat | clinic_~dy | bia | fm_kg | fm_per | ffm_kg | ffm_per | fmi | ffmi | impeda~e | bia_prob  |
      |   . |    . |        . |   Obese | 2022-10-17 |  No |     . |      . |      . |       . |   . |    . |        . |        .  |
      |----------------------------------------------------+-----------------------------------+-----------------------+-----------|
      | bia_co~t | adp | adpfm_kg  | adpffm~g  | adpfm_~r  | adpffm~r  | adp_prob  | adp_co~t  | redcap~p  | perso~10  | times~10  |
      |          |  No |        .  |        .  |        .  |        .  |        .  |           | 4nustart  |           |           |
      |----------+-----------------------------------------------------------------------------+-----------+-----------+-----------|
      | clinic~l | refer_~n | radiol~r | radiol~s | elasta~l  | fecal_~t  | elasta~r  | refer  | refer_..  | refer_..  | refer_..  |
      |          |        . |        . |          |        .  |        .  |        .  |     .  |        0  |        0  |        0  |
      |----------+----------+----------+----------+--------------------------------------------+-----------+-----------+-----------|
      | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_..  | refer_~o  | refer_~i  | refer~ss  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        .  |           |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_.. | refer_..  | refer_..  | refer_..  | refer_..  |
      |        0 |        0 |        0 |        0 |        0 |        0 |        0 |        0  |        0  |        0  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | refer~rs | refer~e1 | refer~e2 | refer~e3 | refer~e4 | refer~e7 | refer~e8 | refer~e9  | refe~e10  | refer~e5  | refer~e6  |
      |          |          |          |          |        . |        . |          |           |        .  |           |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      | clinic_d~s  | urine  | urine_co~t  | urine_~e  |       urine_ali_q  |       urine_ali_r  | u_coll~t  | u_leucs  |  u_gluc  |
      | 2022-10-17  |   Yes  | 2022-10-17  |    10:00  | 40174U17.10.2202Q  | 40174U17.10.2202R  |      Yes  |   trace  |       0  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | u_ketone | u_prot | u_nitr~e | u_blood | urine_~m |                 feces | feces_c~dt | feces~me  | feces_~s  | feces~_t  |
      |        0 |  trace |        0 |   trace |     None |                     . |            |           |           |           |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | feces_~u | feces_~p | feces~te | feces~de | feces~ct | fecal_~e | fecal_~o |                                feces_problem  |
      |          |        . |          |        . |        . |        . |        . | Participant could not produce stool specemen  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | clinic_~et | re_cit~s | re_ber~s | re_ban~s | re_app~s | re_pin~s |                                   re_mango | re_melon  |
      | 2022-10-17 |    Never |    Never |    Never |    Never |    Never | <1 serving/week (small portions or rarely) |    Never  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      | re_dry~t |                                  re_tomato | re_pep~r | re_ora~g |      re_green_leafy  | re_cru~s  | re_gourd  |
      |    Never | <1 serving/week (small portions or rarely) |    Never |    Never | 2-3 servings / week  |    Never  |    Never  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | legumes | nuts_s~s |            red_meat | poultry | processed_meat | organ_~t |           fish | seafood |           eggs |
      |   Never |    Never | 2-3 servings / week |   Never | 1 serving/week |    Never | 1 serving/week |   Never | 1 serving/week |
      |---------------------------------------------------------------------+----------+-------------------------------------------|
      |  milk |            milk_tea | yogurt | yogurt~t | yogurt~k | cheese | icecream | dairy_~h  | fruit_~e  |  soda  | alcohol  |
      | Never | 2-3 servings / week |  Never |    Never |    Never |  Never |    Never |    Never  |    Never  | Never  |   Never  |
      |-------+------------------------------+--------------------------------------------------------------------------+----------|
      | fries | fried_~t | crisps | crackers | samosas | pizza_~r | savour~h |  cake |        cookies | pudding | candy | street~d |
      | Never |    Never |  Never |    Never |   Never |    Never |    Never | Never | 1 serving/week |   Never | Never |    Never |
      |------------------------------------------------------------------------------+---------------------------------------------|
      | fast_f~d | alcoho~t | re_leg~s | radio_~m | date_exa~s | time_e~s | pan_si~l | pan_he~s | pan_he~p | pan_bo~s  | pan_ta~s  |
      |    Never |        . |        1 |      Yes | 2022-12-07 |          |   Normal |     2.43 |     2.38 |     1.17  |     1.29  |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | pan_sh~e  | pan_sh~m  | pan_sh~y  |   pan_contour  | pan_co~m  | pan_co~y  | pan_pa~a  | pan_pa~m  | pa~rosis  | pa~tosis  |
      |   Normal  |        .  |           | Normal/Smooth  |        .  |           |   Normal  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | pan_duct | pan_d~es | pan_d~ss | pan_ca~i | pan_ca~e | pan_cy~s | pan_ot~l | pan_ot~y  | image_~s  | image_~l  | image_~y  |
      |   Normal |        . |        . |   Absent |        . |          |       No |           |  Optimal  |        .  |           |
      |---------------------+------------------------------------------------------------------------------------------------------|
      |       name_radio    |                       sig_radio    |             sig_uss_upload    |                     file_uss    |
      |       Dr J Shawa    |   signature_2022-12-28_0813.png    |         jane signature.png    |                 US 40174.jpg    |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                  file_uss2   |                  file_uss3   |                  file_uss4   |                   file_uss5   |
      |                              |                              |                              |                               |
      |------------------------------+------------------------------+------------------------------+-------------------------------|
      |                  file_uss6   |                  file_uss7   |                  file_uss8   |                   file_uss9   |
      |                              |                              |                              |                               |
      |----------------------------------------------------------------------------------------------------------------------------|
      |                file_uss10 | hepato~y | spleno~y | cholel~s | steato~s | mass | gyneco~c | athero~s | nephro~s  | pancre~c  |
      |                           |        0 |        0 |        0 |        0 |    0 |        0 |        0 |        0  |        0  |
      |----------------------------------------------------------------------------------------------------+-----------+-----------|
      | ct_scan | ct_date | ct_time | ct_p~ual | ct_pan..  | ct_pan~p  | ct_pan..  | c~tail~s  | ct_pa~il  | ct_pan~y  | ct_pan~d  |
      |       . |         |         |        . |        .  |        .  |        .  |        .  |        .  |        .  |        .  |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ct_pa~pe | ct_pan.. | ct_pan.. | ct_pan~r | ct_pan.. | ct_pan.. | ct_pan~a | ct_pa~am  | ct~rosis  | ct~tosis  | ct_pan~t  |
      |        . |        . |          |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+--------------------------------------------------------------------------------|
      | ct_pa~es | ct_pa~ss | ct_pan~i | ct_pa~ce | ct_p~mal  | c~n_spec  | ct_ima~l  | ct_pro~m  | ct_pro~y  | name_ct  | sig_ct  |
      |        . |        . |        . |        . |        .  |           |        .  |        .  |           |          |         |
      |----------+-----------------------------------------------------------------------------------------------------------------|
      | sig_ct~d | file_ct | file_ct2 | file_ct3 | file_ct4 | file_ct5 | file_ct6  | file_ct7  | file_ct8  | file_ct9  | file_c~0  |
      |          |         |          |          |          |          |           |           |        .  |        .  |        .  |
      |----------+-----------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | r2_pan.. | r2_pan~p | r2_pan.. | r2_pan.. | r2_pa~il | r2_pan~y | r2_pan~d | r2_rem~s  | r2_pan..  | r2_pan..  | r2_pan..  |
      |        . |        . |        . |        . |        . |        . |        . |           |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | r2_pan.. | r2_pan.. | r2_pan.. | r2_pan.. | r2_rem~a | r3_pan.. | r3_pan~p | r3_pan..  | r3_pan..  | r3_pa~il  | r3_pan~y  |
      |        . |        . |        . |        . |          |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------+-----------+-----------+-----------|
      | r3_pan~d | r3_rem~s | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan.. | r3_pan..  | r3_pan..  | r3_rem~a  | i~e_ne10  |
      |        . |          |        . |        . |        . |        . |        . |        .  |        .  |        .  |           |
      |----------+----------+----------+----------+--------------------------------------------------------------------------------|
      | iv~e_ne1 | ivgt~e_2 | ivgt~e_4 | ivgt~e_6 | ivgt~e_8  | ivg~e_10  | i~t_ne10  | iv~t_ne1  | ivgtt_2  | ivgtt_4  | ivgtt_6  |
      |          |          |          |          |           |           |        .  |        .  |       .  |       .  |       .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ivgtt_8 | ivgtt_10 | iv~e10_l | iv~e10_m | iv~e10_n | iv~e10_p | ivti~1_l  | ivti~1_m  | ivti~1_n  | ivti~1_p  | ivti~2_l  |
      |       . |        . |          |          |          |          |           |           |           |           |           |
      |----------------------------------------------------------------------------+-----------+-----------+-----------+-----------|
      | ivti~2_m | ivti~2_n | ivti~2_p | ivti~4_l | ivti~4_m | ivti~4_n | ivti~4_p | ivti~6_l  | ivti~6_m  | ivti~6_n  | ivti~6_p  |
      |          |          |          |          |          |          |          |           |           |           |           |
      |----------------------------------------------------------------------------------------------------------------------------|
      | ivti~8_l  | ivti~8_m  | ivti~8_n  | ivti~8_p  | iv~_10_l  |  iv~_10_m  |  iv~_10_n  |  iv~_10_p  |  temp_o~d  |  flag_f~e  |
      |           |           |           |           |           |            |            |            |      5867  |         .  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |          _merge | recrui~d | ass~tase  | ass~pase  | radio2  | ct2  | radio_~s  | radio_~l  | radio3  | subset  | subset2  |
      | Master only (1) |        1 |        0  |        0  |    Yes  |  No  |        0  |       12  |    Yes  |      1  |       1  |
      |----------------------------------------------------------------------------------------------------------------------------|
      | epi_bi~y | epi_or~l | child | africa  |          exposuretime  | fec_co~t  | ct_pa~ol  | r2_pa~ol  | r3_pa~ol  | r2_pan..  |
      |        . |        . | Adult | Africa  |    Exposure as Adults  |  NUSTART  |        .  |        .  |        .  |        .  |
      |----------+----------+------------------------------------------+-----------+-----------+-----------+-----------+-----------|
      | r3_pan.. |       xb | hiv2 | _est_m~1  | _est_m~2  | _est_m~3  | _est_m~4  | _est_m~5  | _est_~5a  | _est_~5b  | _est_~5c  |
      |        . | 434.8237 |    1 |        0  |        0  |        0  |        0  |        0  |        0  |        0  |        0  |
      |----------------------------------------------------------------------------------------------------------------+-----------|
      |       pc1 |       pc2 | pc_f~1_c1 | pc_f~2_c1 | pc~il1_c1  | pc~il2_c1  | pc_~r1_c1  | pc_~r2_c1  | st~ll1_c1  | s~ll2_c1  |
      |  .6715143 | -1.030123 |         . |         . |         .  |         .  |         .  |         .  |         .  |        .  |
      |-----------+-----------+-----------+-----------+----------------------------------------------------------------------------|
      | st~il1_c1 | st~il2_c1 | std~r1_c1 | std~r2_c1 | p~ll1_c2 | p~ll2_c2 | p~il1_c2 | p~il2_c2 | pc~r1_c2 | pc~r2_c2 | s~ll1_c2 |
      |         . |         . |         . |         . |        . |        . |        . |        . |        . |        . |        . |
      |----------------------------------------------------------------------------------------------------------------------------|
      | s~ll2_c2 | s~il1_c2 | s~il2_c2 | st~r1_c2 | st~r2_c2 | p~ll1_c3 | p~ll2_c3 | p~il1_c3  | p~il2_c3  | pc~r1_c3  | pc~r2_c3  |
      |        . |        . |        . |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------------------+-----------+-----------------------|
      | s~ll1_c3 | s~ll2_c3 | s~il1_c3 | s~il2_c3 | st~r1_c3 | st~r2_c3 | pc_f~1_c4 | p~ll2_c4 | pc~il1_c4 | p~il2_c4 | pc_~r1_c4  |
      |        . |        . |        . |        . |        . |        . | -.5673117 | 1.067125 | -.0815474 | .7842325 | -.9751728  |
      |----------+-----------------------------------------------------------------------------------------+-----------------------|
      | pc~r2_c4 | st~ll1_c4 | s~ll2_c4 | st~il1_c4 | s~il2_c4 | st~r1_c4 | st~r2_c4 | p~ll1_c5 | p~ll2_c5 | p~il1_c5  | p~il2_c5  |
      | .1550482 | -.3832694 | 1.212402 | -.0607016 | .9655611 | -.704646 | .2072777 |        . |        . |        .  |        .  |
      |----------+-----------------------------------------------------------------------------------------+-----------+-----------|
      | pc~r1_c5 | pc~r2_c5 | s~ll1_c5 | s~ll2_c5 | s~il1_c5 | s~il2_c5 | st~r1_c5 | st~r2_c5  | p~ll1_c6  | p~ll2_c6  | p~il1_c6  |
      |        . |        . |        . |        . |        . |        . |        . |        .  |        .  |        .  |        .  |
      |----------+----------+----------+----------+----------+----------+----------+-----------------------------------+-----------|
      | p~il2_c6 | pc~r1_c6 | pc~r2_c6 | s~ll1_c6 | s~ll2_c6 | s~il1_c6 | s~il2_c6 | st~r1_c6 | st~r2_c6  | pc1_com~d  | pc2_co~d  |
      |        . |        . |        . |        . |        . |        . |        . |        . |        .  | -.3832694  | 1.212402  |
      |----------------------------------------------------------------------------------------------------------------------------|
      |           adjp~pwt           |           adjpan..           |           a~body~t           |           a~tail~t            |
      |                  .           |                  .           |                  .           |                  .            |
      +----------------------------------------------------------------------------------------------------------------------------+

. list radio3 sampaid if radio3==1 & weight==.
variable sampaid not found
r(111);

. list radio3 sampa_id if radio3==1 & weight==.

      +-------------------+
      | radio3   sampa_id |
      |-------------------|
  22. |    Yes      10188 |
  28. |    Yes      10236 |
  66. |    Yes      10574 |
 234. |    Yes      11786 |
1565. |    Yes      40174 |
      +-------------------+

. list radio3 sampa_id weight bmi if radio3==1 & weight==.

      +----------------------------------+
      | radio3   sampa_id   weight   bmi |
      |----------------------------------|
  22. |    Yes      10188        .     . |
  28. |    Yes      10236        .     . |
  66. |    Yes      10574        .     . |
 234. |    Yes      11786        .     . |
1565. |    Yes      40174        .     . |
      +----------------------------------+

. list radio3 sampa_id assay_f ct2 weight bmi if radio3==1 & weight==.

      +---------------------------------------------------+
      | radio3   sampa_id   ass~tase   ct2   weight   bmi |
      |---------------------------------------------------|
  22. |    Yes      10188          0    No        .     . |
  28. |    Yes      10236          0    No        .     . |
  66. |    Yes      10574          0    No        .     . |
 234. |    Yes      11786          0    No        .     . |
1565. |    Yes      40174          0    No        .     . |
      +---------------------------------------------------+

. list radio3 sampa_id assay_f ct2 weight bmi if radio3==1 & weight==.

      +---------------------------------------------------+
      | radio3   sampa_id   ass~tase   ct2   weight   bmi |
      |---------------------------------------------------|
  22. |    Yes      10188          0    No        .     . |
  28. |    Yes      10236          0    No        .     . |
  66. |    Yes      10574          0    No        .     . |
 234. |    Yes      11786          0    No        .     . |
1565. |    Yes      40174          0    No        .     . |
      +---------------------------------------------------+

. list radio3 sampa_id assay_f ct2 pan_head_ap weight bmi if radio3==1 & weight==.

      +--------------------------------------------------------------+
      | radio3   sampa_id   ass~tase   ct2   pan_he~p   weight   bmi |
      |--------------------------------------------------------------|
  22. |    Yes      10188          0    No       1.94        .     . |
  28. |    Yes      10236          0    No       2.73        .     . |
  66. |    Yes      10574          0    No       2.58        .     . |
 234. |    Yes      11786          0    No       2.25        .     . |
1565. |    Yes      40174          0    No       2.38        .     . |
      +--------------------------------------------------------------+

. list radio3 sampa_id assay_f ct2 pan_head_ap radio_mis_dims weight bmi if radio3==1 & weight==.

      +-------------------------------------------------------------------------+
      | radio3   sampa_id   ass~tase   ct2   pan_he~p   radio_~s   weight   bmi |
      |-------------------------------------------------------------------------|
  22. |    Yes      10188          0    No       1.94          0        .     . |
  28. |    Yes      10236          0    No       2.73          0        .     . |
  66. |    Yes      10574          0    No       2.58          0        .     . |
 234. |    Yes      11786          0    No       2.25          0        .     . |
1565. |    Yes      40174          0    No       2.38          0        .     . |
      +-------------------------------------------------------------------------+

. tab cohort

     Cohort |      Freq.     Percent        Cum.
------------+-----------------------------------
     DIVIDS |        322       14.14       14.14
        SAM |        108        4.74       18.88
     CICADA |        976       42.84       61.72
    NUSTART |        289       12.69       74.41
      STATT |        275       12.07       86.48
      CLHNS |        308       13.52      100.00
------------+-----------------------------------
      Total |      2,278      100.00

. drop adjpan_head_apwt adjpan_head_transwt adjpan_body_transwt adjpan_tail_transwt

. scatter fecal_elastase ct_pan_vol 

. tobit fecal_elastase ct_pan_vol , ul(600)

Refining starting values:

Grid node 0:  Log likelihood =  -883.6033

Fitting full model:

Iteration 0:  Log likelihood =  -883.6033  
Iteration 1:  Log likelihood = -865.48097  
Iteration 2:  Log likelihood = -863.62504  
Iteration 3:  Log likelihood = -863.59826  
Iteration 4:  Log likelihood = -863.59817  
Iteration 5:  Log likelihood = -863.59817  

Tobit regression                                    Number of obs     =    179
                                                           Uncensored =    114
Limits: Lower = -inf                                    Left-censored =      0
        Upper =  600                                   Right-censored =     65

                                                    LR chi2(1)        =   0.05
                                                    Prob > chi2       = 0.8219
Log likelihood = -863.59817                         Pseudo R2         = 0.0000

---------------------------------------------------------------------------------------
       fecal_elastase | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
           ct_pan_vol |  -.2453323   1.089986    -0.23   0.822    -2.396289    1.905625
                _cons |   501.2205   75.42102     6.65   0.000     352.3861    650.0549
----------------------+----------------------------------------------------------------
 var(e.fecal_elastase)|   84457.46    12198.9                      63511.19    112311.9
---------------------------------------------------------------------------------------

. tobit fecal_elastase pc1 , ul(600)

Refining starting values:

Grid node 0:  Log likelihood = -3710.9101

Fitting full model:

Iteration 0:  Log likelihood = -3710.9101  
Iteration 1:  Log likelihood = -3633.2183  
Iteration 2:  Log likelihood = -3625.2782  
Iteration 3:  Log likelihood =   -3625.16  
Iteration 4:  Log likelihood = -3625.1596  
Iteration 5:  Log likelihood = -3625.1596  

Tobit regression                                    Number of obs     =    752
                                                           Uncensored =    480
Limits: Lower = -inf                                    Left-censored =      0
        Upper =  600                                   Right-censored =    272

                                                    LR chi2(1)        =  29.50
                                                    Prob > chi2       = 0.0000
Log likelihood = -3625.1596                         Pseudo R2         = 0.0041

---------------------------------------------------------------------------------------
       fecal_elastase | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
                  pc1 |  -37.94694   7.029315    -5.40   0.000    -51.74638   -24.14749
                _cons |   481.3527   11.60163    41.49   0.000     458.5772    504.1282
----------------------+----------------------------------------------------------------
 var(e.fecal_elastase)|   82770.09   5820.577                       72097.2    95022.94
---------------------------------------------------------------------------------------

. tobit fecal_elastase pc1 pc2 , ul(600)

Refining starting values:

Grid node 0:  Log likelihood = -3707.7142

Fitting full model:

Iteration 0:  Log likelihood = -3707.7142  
Iteration 1:  Log likelihood = -3629.9671  
Iteration 2:  Log likelihood = -3622.0241  
Iteration 3:  Log likelihood =  -3621.906  
Iteration 4:  Log likelihood = -3621.9057  
Iteration 5:  Log likelihood = -3621.9057  

Tobit regression                                    Number of obs     =    752
                                                           Uncensored =    480
Limits: Lower = -inf                                    Left-censored =      0
        Upper =  600                                   Right-censored =    272

                                                    LR chi2(2)        =  36.01
                                                    Prob > chi2       = 0.0000
Log likelihood = -3621.9057                         Pseudo R2         = 0.0049

---------------------------------------------------------------------------------------
       fecal_elastase | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
                  pc1 |  -37.83151   6.980034    -5.42   0.000    -51.53424   -24.12878
                  pc2 |  -29.95174   11.71893    -2.56   0.011    -52.95755   -6.945922
                _cons |   477.2339   11.60715    41.12   0.000     454.4475    500.0202
----------------------+----------------------------------------------------------------
 var(e.fecal_elastase)|   81839.15   5753.382                      71289.24    93950.31
---------------------------------------------------------------------------------------

. tobit fecal_elastase ct_pan_vol , ul(600)

Refining starting values:

Grid node 0:  Log likelihood =  -883.6033

Fitting full model:

Iteration 0:  Log likelihood =  -883.6033  
Iteration 1:  Log likelihood = -865.48097  
Iteration 2:  Log likelihood = -863.62504  
Iteration 3:  Log likelihood = -863.59826  
Iteration 4:  Log likelihood = -863.59817  
Iteration 5:  Log likelihood = -863.59817  

Tobit regression                                    Number of obs     =    179
                                                           Uncensored =    114
Limits: Lower = -inf                                    Left-censored =      0
        Upper =  600                                   Right-censored =     65

                                                    LR chi2(1)        =   0.05
                                                    Prob > chi2       = 0.8219
Log likelihood = -863.59817                         Pseudo R2         = 0.0000

---------------------------------------------------------------------------------------
       fecal_elastase | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
           ct_pan_vol |  -.2453323   1.089986    -0.23   0.822    -2.396289    1.905625
                _cons |   501.2205   75.42102     6.65   0.000     352.3861    650.0549
----------------------+----------------------------------------------------------------
 var(e.fecal_elastase)|   84457.46    12198.9                      63511.19    112311.9
---------------------------------------------------------------------------------------

. tobit fecal_elastase pan_head_ap , ul(600)

Refining starting values:

Grid node 0:  Log likelihood =  -6527.949

Fitting full model:

Iteration 0:  Log likelihood =  -6527.949  
Iteration 1:  Log likelihood = -6434.8808  
Iteration 2:  Log likelihood = -6428.9464  
Iteration 3:  Log likelihood =  -6428.906  
Iteration 4:  Log likelihood =  -6428.906  

Tobit regression                                    Number of obs     =  1,240
                                                           Uncensored =    863
Limits: Lower = -inf                                    Left-censored =      0
        Upper =  600                                   Right-censored =    377

                                                    LR chi2(1)        =  43.64
                                                    Prob > chi2       = 0.0000
Log likelihood = -6428.906                          Pseudo R2         = 0.0034

---------------------------------------------------------------------------------------
       fecal_elastase | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
          pan_head_ap |  -109.2121   16.53995    -6.60   0.000    -141.6615   -76.76271
                _cons |   657.6102   36.11386    18.21   0.000     586.7591    728.4613
----------------------+----------------------------------------------------------------
 var(e.fecal_elastase)|   78066.49   4053.716                      70505.27    86438.61
---------------------------------------------------------------------------------------

. tobit fecal_elastase pan_head_trans , ul(600)

Refining starting values:

Grid node 0:  Log likelihood = -5836.7645

Fitting full model:

Iteration 0:  Log likelihood = -5836.7645  
Iteration 1:  Log likelihood = -5756.2622  
Iteration 2:  Log likelihood = -5751.3465  
Iteration 3:  Log likelihood = -5751.3104  
Iteration 4:  Log likelihood = -5751.3104  

Tobit regression                                    Number of obs     =  1,102
                                                           Uncensored =    771
Limits: Lower = -inf                                    Left-censored =      0
        Upper =  600                                   Right-censored =    331

                                                    LR chi2(1)        =  19.64
                                                    Prob > chi2       = 0.0000
Log likelihood = -5751.3104                         Pseudo R2         = 0.0017

---------------------------------------------------------------------------------------
       fecal_elastase | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
       pan_head_trans |  -76.83417   17.36321    -4.43   0.000    -110.9029   -42.76546
                _cons |   578.9215   36.47497    15.87   0.000     507.3532    650.4898
----------------------+----------------------------------------------------------------
 var(e.fecal_elastase)|   79854.64   4388.093                      71692.59    88945.91
---------------------------------------------------------------------------------------

. tobit fecal_elastase pan_head_trans pan_head_ap , ul(600)

Refining starting values:

Grid node 0:  Log likelihood = -5562.5373

Fitting full model:

Iteration 0:  Log likelihood = -5562.5373  
Iteration 1:  Log likelihood = -5480.5965  
Iteration 2:  Log likelihood = -5475.1392  
Iteration 3:  Log likelihood = -5475.1054  
Iteration 4:  Log likelihood = -5475.1054  

Tobit regression                                    Number of obs     =  1,060
                                                           Uncensored =    734
Limits: Lower = -inf                                    Left-censored =      0
        Upper =  600                                   Right-censored =    326

                                                    LR chi2(2)        =  47.73
                                                    Prob > chi2       = 0.0000
Log likelihood = -5475.1054                         Pseudo R2         = 0.0043

---------------------------------------------------------------------------------------
       fecal_elastase | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
       pan_head_trans |  -14.66567   21.13801    -0.69   0.488    -56.14285    26.81151
          pan_head_ap |   -115.543   21.68147    -5.33   0.000    -158.0866   -72.99942
                _cons |   705.2978   43.62766    16.17   0.000     619.6912    790.9044
----------------------+----------------------------------------------------------------
 var(e.fecal_elastase)|   79286.32   4466.351                       70989.4    88552.95
---------------------------------------------------------------------------------------

. tobit fecal_elastase pan_head_trans pan_head_ap height , ul(600)

Refining starting values:

Grid node 0:  Log likelihood = -5562.5568

Fitting full model:

Iteration 0:  Log likelihood = -5562.5568  
Iteration 1:  Log likelihood = -5480.5226  
Iteration 2:  Log likelihood = -5475.0502  
Iteration 3:  Log likelihood = -5475.0165  
Iteration 4:  Log likelihood = -5475.0164  

Tobit regression                                    Number of obs     =  1,060
                                                           Uncensored =    734
Limits: Lower = -inf                                    Left-censored =      0
        Upper =  600                                   Right-censored =    326

                                                    LR chi2(3)        =  47.91
                                                    Prob > chi2       = 0.0000
Log likelihood = -5475.0164                         Pseudo R2         = 0.0044

---------------------------------------------------------------------------------------
       fecal_elastase | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
       pan_head_trans |  -12.85322   21.57097    -0.60   0.551    -55.18002    29.47358
          pan_head_ap |  -114.9495   21.72763    -5.29   0.000    -157.5837    -72.3153
               height |  -.3920606   .9294554    -0.42   0.673    -2.215848    1.431727
                _cons |   763.2576   144.2463     5.29   0.000     480.2159    1046.299
----------------------+----------------------------------------------------------------
 var(e.fecal_elastase)|   79298.13   4467.331                      70999.41    88566.83
---------------------------------------------------------------------------------------

. scatter pc1 ct_pan_vol

. scatter pc2 ct_pan_vol

. baplot pc1 ct_pan_vol

Bland-Altman comparison of pc1 and ct_pan_vol
Limits of agreement (Reference Range for difference): -109.860 to -25.406
Mean difference: -67.633 (CI -70.774 to -64.492) 
Range :  2.319 to 86.696
Pitman's Test of difference in variance: r = -0.991, n = 176, p = 0.000
            graph __000002 __000001 if __000000 & __000004 == 1 , symbol(o)   yline(-109.85985037819, -25.40585227040628, -67.632851
> 32429816)   

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. cap drop ct_pan_vol

.         gen ct_pan_vol=((ct_pan_tail_trans+ct_pan_body_trans)/2)*ct_pan_body_tail*ct_pan_cc_body+((ct_pan_head_ap/2)^2)*3.14*ct_pa
> n_cc_head
(2,036 missing values generated)

.         cap label variable ct_pan_vol "Calculated Pancreatic Volume; Study"

. 
.         
. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_cc_body ct_pan
> _cc_head {
  2.         gen adj_wt_`var' = `var'/weight
  3. }
(1,954 missing values generated)
(1,951 missing values generated)
(1,952 missing values generated)
(1,953 missing values generated)
(2,027 missing values generated)
(2,031 missing values generated)
(2,033 missing values generated)

. 
. 
. foreach var of varlist ct_pan_head_trans ct_pan_head_ap ct_pan_body_trans ct_pan_tail_trans ct_pan_body_tail ct_pan_cc_body ct_pan
> _cc_head {
  2.         gen adj_sqrt_`var' = sqrt(`var')
  3. }               
(1,954 missing values generated)
(1,951 missing values generated)
(1,952 missing values generated)
(1,953 missing values generated)
(2,027 missing values generated)
(2,031 missing values generated)
(2,033 missing values generated)

.         
. * Derived USS Variables 
. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj_wt_`var' = `var'/weight
  3. }
(729 missing values generated)
(882 missing values generated)
(673 missing values generated)
(1,082 missing values generated)

. 
. 
. foreach var of varlist pan_head_ap pan_head_trans pan_body_trans pan_tail_trans {
  2.         gen adj_sqrt_`var' = sqrt(`var')
  3. }               
(724 missing values generated)
(877 missing values generated)
(668 missing values generated)
(1,077 missing values generated)

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. 
. /* QC variables */
. cap drop r2_pan_vol

.         gen r2_pan_vol=((r2_pan_tail_trans+r2_pan_body_trans)/2)*r2_pan_body_tail*r2_pan_cc_body+((r2_pan_head_ap/2)^2)*3.14*r2_pa
> n_cc_head
(2,151 missing values generated)

.         cap label variable r2_pan_vol "Calculated Pancreatic Volume; Radiologist 2"

. 
. cap drop r3_pan_vol

.         gen r3_pan_vol=((r3_pan_tail_trans+r3_pan_body_trans)/2)*r3_pan_body_tail*r3_pan_cc_body+((r3_pan_head_ap/2)^2)*3.14*r3_pa
> n_cc_head
(2,146 missing values generated)

.         cap label variable r3_pan_vol "Calculated Pancreatic Volume; Radiologist 3"

. 
. cap drop r2_pan_vol_intra

.         gen r2_pan_vol_intra=((r2_pan_tail_trans_intra+r2_pan_body_trans_intra)/2)*r2_pan_body_tail_intra*r2_pan_cc_body_intra+((r
> 2_pan_head_ap_intra/2)^2)*3.14*r2_pan_cc_head_intra
(2,259 missing values generated)

.         cap label variable r2_pan_vol_intra "Calculated Pancreatic Volume Intra; Radiologist 2"

. 
. cap drop r3_pan_vol_intra

.         gen r3_pan_vol_intra=((r3_pan_tail_trans_intra+r3_pan_body_trans_intra)/2)*r3_pan_body_tail_intra*r3_pan_cc_body_intra+((r
> 3_pan_head_ap_intra/2)^2)*3.14*r3_pan_cc_head_intra
(2,261 missing values generated)

.         cap label variable r3_pan_vol_intra "Calculated Pancreatic Volume Intra; Radiologist 3"

. 
end of do-file

. do "/var/folders/lh/z7glx7t90sxdbn12r3xcjr7h0000gq/T//SD77831.000000"

. 
. **# Create Study Dataset for Analysis
. version 18.5

. 
. *CLEAR
. clear all

. set more off

. 
. capture log close
